//use rayon::prelude::*;
use std::fs;
use std::path::Path;
/*use std::sync::{
    Mutex,
    atomic::{AtomicU64, AtomicUsize, Ordering},
};*/

pub fn проверка_наличия_папки_умная_строка(
    путь: &Text_Changer::Умная_Строка,
) {
    match создать_вложенные_папки(путь.as_str()) {
        Ok(()) => (), //println!("Успех для: {}", путь),
        Err(ошибка) => eprintln!("Ошибка для |{}| : |{}|", путь, ошибка),
    }
}
pub fn проверка_наличия_папки(путь: &String) {
    match создать_вложенные_папки(путь.as_str()) {
        Ok(()) => (), //println!("Успех для: {}", путь),
        Err(ошибка) => eprintln!("Ошибка для |{}| : |{}|", путь, ошибка),
    }
}

pub fn создать_вложенные_папки(
    путь_исходный: &str,
) -> Result<(), Box<dyn std::error::Error>> {
    let путь = Path::new(путь_исходный);
    // Получаем родительскую директорию (все папки кроме файла)
    if let Some(родительская_папка) = путь.parent() {
        if !родительская_папка.exists() {
            //println!("Создаем директории: {}", родительская_папка.display());
            fs::create_dir_all(родительская_папка).unwrap();
        } else {
            /*println!(
                "Директория уже существует: {}",
                родительская_папка.display()
            );*/
        }
    }
    Ok(())
}

pub fn заменить_путь_выходным_книгам(
    куча: &rapidhash::fast::RapidHashSet<String>,
    _доп: &str,
) {
    use Text_Changer::ПУТИ_ОБЩИЕ;
    //начало
    //let пути_общие: Text_Changer::Пути_Общие = Default::default();
    //
    let выводной_ряд: rapidhash::fast::RapidHashSet<String> = куча
        .iter()
        .map(|строка| строка.replace(&ПУТИ_ОБЩИЕ.книги, &ПУТИ_ОБЩИЕ.вывод_книги))
        .collect();
    //
    выводной_ряд
        .iter()
        .for_each(|путь| проверка_наличия_папки(путь));
    //
}

pub fn создать_папку_книги(
    имя_книги_полное: &Text_Changer::Умная_Строка,
    расширение: &Text_Changer::Расширение_полное,
) {
    use Text_Changer::ПУТИ_ОБЩИЕ;
    //let пути_общие: Text_Changer::Пути_Общие = Default::default();
    //
    let путь_папки_вывода_пропусков: Text_Changer::Умная_Строка =
        Text_Changer::Умная_Строка::создать_значение(format!(
            "{}{}/",
            &ПУТИ_ОБЩИЕ.вывод_книги_пропуски, &имя_книги_полное
        ));
    //
    let удалить: Text_Changer::Умная_Строка =
        Text_Changer::Умная_Строка::создать_значение(
            format!(".{}", расширение.вид),
        );
    let путь_папки_вывода_пропусков =
        путь_папки_вывода_пропусков.replace(удалить.получить_ссылку(), "");
    crate::output::dir::проверка_наличия_папки_умная_строка(
        &путь_папки_вывода_пропусков,
    );
    crate::output::functions::проверка_наличия_папок_в_случае_их_отсутствия_создать_папки_по_умной_строке(&путь_папки_вывода_пропусков);
}
