use std::fs::{
    self,
    //metadata,
    //   File,
};
/*use std::io::{
    //self,
    BufRead,
    BufReader,
    Error,
    Read, //Write
};*/
use std::path::Path;
//use std::{str, time::Instant};

pub fn проверка_наличия_папок_в_случае_их_отсутствия_создать_папки_по_умной_строке(
    путь: &Text_Changer::Умная_Строка,
) {
    //проверка наличия папок
    if !Path::new(путь.as_str()).exists() {
        println!("Папка не существует: {}", путь);
        match fs::create_dir(путь.as_str()) {
            // создаем папку
            Ok(_) => (),
            Err(ошибка) => {
                println!("Не удалось создать папку: |{путь}| по причине: {}", ошибка)
            }
        }
    }
    //чтение содержимого папки
    match fs::read_dir(путь.as_str()) {
        //если ошибка - вывод почему
        Err(причина) => println!("! {:?}", причина.kind()),
        //если успех - получение списка содержимого
        Ok(_пути) => (), //for путь2 in пути {},
    }
}
pub fn проверка_наличия_папок_в_случае_их_отсутствия_создать_папки_по_срезу(
    путь: &str,
) -> Result<Text_Changer::Итог_Сохранения, Text_Changer::Ошибка_Сохранения> {
    //проверка наличия папок
    if !Path::new(путь).exists() {
        println!("Папка не существует |{}|", путь);
        match fs::create_dir(путь) {
            // создаем папку
            Ok(_) => (),
            Err(ошибка) => {
                println!("Не удалось создать папку: |{путь}| по причине |{}|", ошибка);
                return Err(Text_Changer::Ошибка_Сохранения::Создание_папки);
            }
        }
    }
    //чтение содержимого папки
    match fs::read_dir(путь) {
        //если ошибка - вывод почему
        Err(причина) => {
            println!("! |{:?}|", причина.kind());
            return Err(Text_Changer::Ошибка_Сохранения::Чтение_Диска);
        }
        //если успех - получение списка содержимого
        Ok(_пути) => return Ok(Text_Changer::Итог_Сохранения::Создано), //for путь2 in пути {},
    }
}
