use Text_Changer::{
    Вид_Окончания, Вид_ошибки_при_поиске_в_торжке
};
use console::style;
//use rapidhash::RapidHashMap;
//use rayon::prelude::*;
use regex::Regex;
use std::sync::LazyLock;
use std::sync::atomic::{AtomicBool, Ordering};

pub struct Ложные_окончания_с_исключениями {
    pub ряд_re: &'static [Regex],
    pub ряд_исключений: &'static rapidhash::fast::RapidHashSet<&'static str>,
}
pub static СТОПКА_ЛОЖНЫХ_ОКОНЧАНИЙ: LazyLock<
    [Ложные_окончания_с_исключениями; 16],
> = LazyLock::new(|| {
    [
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ВАН,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ВАН,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕН,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЕН,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОН,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ОН,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЁН,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЁН,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Н,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_Н,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_СТ,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_СТ,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_АС,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_АС,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_АН,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_АН,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Щ,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_Щ,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_И,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_И,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЫИ,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЫИ,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОМ,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ОМ,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕМ,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЕМ,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Ц,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_Ц,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Л,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_Л,
        },
        Ложные_окончания_с_исключениями {
            ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Ю,
            ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_Ю,
        },
    ]
});
pub static RE_ИСКЛЮЧЕНИЯ_Ю: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Ю: LazyLock<[Regex; 1]> = LazyLock::new(|| {
    [Regex::new(r"(?i)юися").unwrap()]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_Л: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Л: LazyLock<[Regex; 15]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)льнная").unwrap(),
        Regex::new(r"(?i)льнную").unwrap(),
        Regex::new(r"(?i)льнна").unwrap(),
        Regex::new(r"(?i)льнно").unwrap(),
        Regex::new(r"(?i)льнны").unwrap(),
        Regex::new(r"(?i)льнные").unwrap(),
        Regex::new(r"(?i)льнным").unwrap(),
        Regex::new(r"(?i)льнными").unwrap(),
        Regex::new(r"(?i)льнных").unwrap(),
        Regex::new(r"(?i)льнный").unwrap(),
        Regex::new(r"(?i)льнном").unwrap(),
        Regex::new(r"(?i)льнное").unwrap(),
        Regex::new(r"(?i)льнного").unwrap(),
        Regex::new(r"(?i)льнной").unwrap(),
        Regex::new(r"(?i)льнному").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_Ц: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Ц: LazyLock<[Regex; 2]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)цеяев").unwrap(),
        Regex::new(r"(?i)цеяем").unwrap(),
    ]
    //----------------------------------
});

//
pub static RE_ИСКЛЮЧЕНИЯ_ЕМ: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕМ: LazyLock<[Regex; 7]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)емуемся").unwrap(),
        Regex::new(r"(?i)емует").unwrap(),
        Regex::new(r"(?i)емуетя").unwrap(),
        Regex::new(r"(?i)емуй").unwrap(),
        Regex::new(r"(?i)емуюсь").unwrap(),
        Regex::new(r"(?i)емуют").unwrap(),
        Regex::new(r"(?i)емуются").unwrap(),
    ]
    //----------------------------------
});
//

pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЫИ: LazyLock<[Regex; 23]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)ыванно").unwrap(),
        Regex::new(r"(?i)ыванными").unwrap(),
        Regex::new(r"(?i)ыванных").unwrap(),
        Regex::new(r"(?i)ыванным").unwrap(),
        Regex::new(r"(?i)ыванный").unwrap(),
        Regex::new(r"(?i)ыванные").unwrap(),
        Regex::new(r"(?i)ыванную").unwrap(),
        Regex::new(r"(?i)ыванностям").unwrap(),
        Regex::new(r"(?i)ыванностями").unwrap(),
        Regex::new(r"(?i)ыванностях").unwrap(),
        Regex::new(r"(?i)ыванностью").unwrap(),
        Regex::new(r"(?i)ыванность").unwrap(),
        Regex::new(r"(?i)ыванности").unwrap(),
        Regex::new(r"(?i)ыванностей").unwrap(),
        Regex::new(r"(?i)ыванной").unwrap(),
        Regex::new(r"(?i)ыванное").unwrap(),
        Regex::new(r"(?i)ыванного").unwrap(),
        Regex::new(r"(?i)ыванная").unwrap(),
        Regex::new(r"(?i)ыго$").unwrap(),
        Regex::new(r"(?i)ыого$").unwrap(),
        Regex::new(r"(?i)ыи$").unwrap(),
        Regex::new(r"(?i)ымм$").unwrap(),
        Regex::new(r"(?i)уый$").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_ЫИ: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОМ: LazyLock<[Regex; 3]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)омю").unwrap(),
        Regex::new(r"(?i)оу$").unwrap(),
        Regex::new(r"(?i)ою$").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_ОМ: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| {
        rapidhash::fast::RapidHashSet::from_iter([
            "шоу",
            "конвою",
            "супергерою",
            "герою",
            "главгерою",
            "антигерою",
            "строю",
            "сбою",
            "застою",
            "сухостою",
        ])
    });
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_И: LazyLock<[Regex; 1]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)иев$").unwrap(),
        //Regex::new(r"(?i)ичн\w{0,2}$").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_И: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| {
        rapidhash::fast::RapidHashSet::from_iter([
            "гениев",
            "кафетериев",
            "колумбариев",
            "комментариев",
            "критериев",
            "соляриев",
            "сценариев",
            "пассионариев",
            "санаториев",
            "глоссариев",
            "репозиториев",
            "париев",
        ])
    });
//
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Щ: LazyLock<[Regex; 3]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)щею$").unwrap(),
        Regex::new(r"(?i)щюю$").unwrap(),
        Regex::new(r"(?i)щни\w+$").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_Щ: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_АН: LazyLock<[Regex; 3]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)аности$").unwrap(),
        Regex::new(r"(?i)анны$").unwrap(),
        Regex::new(r"(?i)аыми").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_АН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_АС: LazyLock<[Regex; 1]> = LazyLock::new(|| {
    [Regex::new(r"(?i)ася$").unwrap()]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_АС: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_Н: LazyLock<[Regex; 12]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)наыми").unwrap(),
        Regex::new(r"(?i)нкю").unwrap(),
        Regex::new(r"(?i)наую").unwrap(),
        Regex::new(r"(?i)ныую").unwrap(),
        Regex::new(r"(?i)нныого").unwrap(),
        Regex::new(r"(?i)нныо").unwrap(),
        Regex::new(r"(?i)ннн").unwrap(),
        Regex::new(r"(?i)ныи").unwrap(),
        Regex::new(r"(?i)нм$").unwrap(),
        Regex::new(r"(?i)ни$").unwrap(),
        Regex::new(r"(?i)нвми").unwrap(),
        Regex::new(r"(?i)ностех").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_Н: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| {
        rapidhash::fast::RapidHashSet::from_iter([
            "героини",
            "мишени",
            "кухни",
            "барышни",
            "болезни",
            "песни",
            "гортани",
            "ровни",
            "знамени",
            "дни",
            "ткани",
            "времени",
            "камни",
            "купальни",
            "харчёвни",
            "огни",
            "отмени",
            "парни",
            "святыни",
            "стеклоткани",
            "уровни",
            "степени",
            "ступени",
            "семени",
            "сходни",
            "раздевальни",
            "перечни",
            "гавани",
            "деревни",
            "бойни",
            "брильни",
            "древни",
            "поварни",
            "дву-сторонни",
            "потусторонни",
            "одно-сторонни",
        ])
    });
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_СТ: LazyLock<[Regex; 5]> = LazyLock::new(|| {
    [
        Regex::new(r"(?i)си$").unwrap(),
        Regex::new(r"(?i)стй").unwrap(),
        Regex::new(r"(?i)стю$").unwrap(),
        Regex::new(r"(?i)стяях").unwrap(),
        Regex::new(r"(?i)стех").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_СТ: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| {
        rapidhash::fast::RapidHashSet::from_iter([
            "аудиозаписи",
            "гостю",
            "ипостаси",
            "пси",
            "такси",
            "шасси",
            "ереси",
            "записи",
            "летописи",
            "лжелетописи",
            "надписи",
            "рукописи",
            "описи",
            "живописи",
            "смеси",
            "помеси",
            "росписи",
            "писи",
            "искоси",
        ])
    });
//
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Regex; 33]> = LazyLock::new(|| {
    [
        //----------------------------------
        //ван
        //
        Regex::new(r"(?i)авыван$").unwrap(),
        //
        //а
        Regex::new(r"(?i)ваная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)ванн$").unwrap(),
        Regex::new(r"(?i)ванние$").unwrap(),
        Regex::new(r"(?i)ваннием$").unwrap(),
        Regex::new(r"(?i)ванния$").unwrap(),
        Regex::new(r"(?i)ваннию$").unwrap(),
        Regex::new(r"(?i)ваннии$").unwrap(),
        Regex::new(r"(?i)ванний$").unwrap(),
        Regex::new(r"(?i)ванниям$").unwrap(),
        Regex::new(r"(?i)ванниями$").unwrap(),
        Regex::new(r"(?i)ванниях$").unwrap(),
        //
        Regex::new(r"(?i)ванна$").unwrap(),
        Regex::new(r"(?i)ванно$").unwrap(),
        Regex::new(r"(?i)ванны$").unwrap(),
        //ую
        Regex::new(r"(?i)ваную$").unwrap(),
        //о
        Regex::new(r"(?i)ваное$").unwrap(),
        Regex::new(r"(?i)ваного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)ваною$").unwrap(),
        Regex::new(r"(?i)ваном$").unwrap(),
        Regex::new(r"(?i)ваному$").unwrap(),
        Regex::new(r"(?i)ваность$").unwrap(),
        Regex::new(r"(?i)ваностю$").unwrap(),
        Regex::new(r"(?i)ваности$").unwrap(),
        Regex::new(r"(?i)ваностей$").unwrap(),
        Regex::new(r"(?i)ваностям$").unwrap(),
        Regex::new(r"(?i)ваностями$").unwrap(),
        Regex::new(r"(?i)ваностях$").unwrap(),
        //ыа
        Regex::new(r"(?i)ваным$").unwrap(),
        Regex::new(r"(?i)ваными$").unwrap(),
        Regex::new(r"(?i)ваных$").unwrap(),
        Regex::new(r"(?i)ваные$").unwrap(),
        Regex::new(r"(?i)ваный$").unwrap(),
    ]
    //----------------------------------
});
pub static RE_ИСКЛЮЧЕНИЯ_ВАН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter(["диваном"]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕН: LazyLock<[Regex; 20]> = LazyLock::new(|| {
    [
        //ен
        //а
        Regex::new(r"(?i)еая$").unwrap(),
        Regex::new(r"(?i)еная$").unwrap(),
        //одиночн
        //Regex::new(r"(?i)енна$").unwrap(),
        //Regex::new(r"(?i)енно$").unwrap(),
        //Regex::new(r"(?i)енны$").unwrap(),
        Regex::new(r"(?i)енн$").unwrap(),
        //Regex::new(r"(?i)енна$").unwrap(),
        //Regex::new(r"(?i)енно$").unwrap(),
        //Regex::new(r"(?i)енны$").unwrap(),
        //ую
        Regex::new(r"(?i)еную$").unwrap(),
        //о
        Regex::new(r"(?i)еное$").unwrap(),
        Regex::new(r"(?i)еного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)еном$").unwrap(),
        Regex::new(r"(?i)еному$").unwrap(),
        Regex::new(r"(?i)еность$").unwrap(),
        Regex::new(r"(?i)еностью$").unwrap(),
        Regex::new(r"(?i)ености$").unwrap(),
        Regex::new(r"(?i)еностей$").unwrap(),
        Regex::new(r"(?i)еностям$").unwrap(),
        Regex::new(r"(?i)еностями$").unwrap(),
        Regex::new(r"(?i)еностях$").unwrap(),
        //ы
        Regex::new(r"(?i)еным$").unwrap(),
        Regex::new(r"(?i)еными$").unwrap(),
        Regex::new(r"(?i)еных$").unwrap(),
        Regex::new(r"(?i)еные$").unwrap(),
        Regex::new(r"(?i)енаж").unwrap(),
        //----------------------------------
    ]
});
pub static RE_ИСКЛЮЧЕНИЯ_ЕН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| {
        rapidhash::fast::RapidHashSet::from_iter([
            "рекордсмен",
            "манекен",
            "орден",
            "концераген",
            "геном",
            "бизнесмен",
            "бармен",
            "антенн",
            "суперменом",
            "феноменом",
            "шатеном",
            "экзаменом",
            "доменом",
            "джентльменом",
            "голоценом",
            "авиазвеном",
            "промоушеном",
            "военна",
            "военно",
            "гипоаллергенно",
            "аборигенна",
            "аборигенно",
            "аборигенны",
            "антивоенна",
            "бедственна",
            "бедственно",
        ])
    });

//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЁН: LazyLock<[Regex; 19]> = LazyLock::new(|| {
    [
        //ён
        //а
        Regex::new(r"(?i)ёная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)ённ$").unwrap(),
        //Regex::new(r"(?i)ённа$").unwrap(),
        //Regex::new(r"(?i)ённо$").unwrap(),
        //Regex::new(r"(?i)ённы$").unwrap(),
        //ую
        Regex::new(r"(?i)ёную$").unwrap(),
        //о
        Regex::new(r"(?i)ёное$").unwrap(),
        Regex::new(r"(?i)ёного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)ёном$").unwrap(),
        Regex::new(r"(?i)ёному$").unwrap(),
        Regex::new(r"(?i)ёность$").unwrap(),
        Regex::new(r"(?i)ёностью$").unwrap(),
        Regex::new(r"(?i)ёности$").unwrap(),
        Regex::new(r"(?i)ёностей$").unwrap(),
        Regex::new(r"(?i)ёностям$").unwrap(),
        Regex::new(r"(?i)ёностями$").unwrap(),
        Regex::new(r"(?i)ёностях$").unwrap(),
        //ы
        Regex::new(r"(?i)ёным$").unwrap(),
        Regex::new(r"(?i)ёными$").unwrap(),
        Regex::new(r"(?i)ёных$").unwrap(),
        Regex::new(r"(?i)ёные$").unwrap(),
        Regex::new(r"(?i)ёены").unwrap(),
        //----------------------------------
        //----------------------------------
    ]
});
//
pub static RE_ИСКЛЮЧЕНИЯ_ЁН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
//
pub static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОН: LazyLock<[Regex; 18]> = LazyLock::new(|| {
    [
        //он
        Regex::new(r"(?i)оеную$").unwrap(),
        Regex::new(r"(?i)оная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)онн$").unwrap(),
        //Regex::new(r"(?i)онна$").unwrap(),
        // Regex::new(r"(?i)онно$").unwrap(),
        //Regex::new(r"(?i)онны$").unwrap(),
        //ую
        Regex::new(r"(?i)оную$").unwrap(),
        //о
        Regex::new(r"(?i)оное$").unwrap(),
        Regex::new(r"(?i)оного$").unwrap(),
        //глаголы
        //Regex::new(r"(?i)оном$").unwrap(),
        Regex::new(r"(?i)оному$").unwrap(),
        Regex::new(r"(?i)оность$").unwrap(),
        Regex::new(r"(?i)оностью$").unwrap(),
        Regex::new(r"(?i)оности$").unwrap(),
        Regex::new(r"(?i)оностей$").unwrap(),
        Regex::new(r"(?i)оностям$").unwrap(),
        Regex::new(r"(?i)оностями$").unwrap(),
        Regex::new(r"(?i)оностях$").unwrap(),
        //ы
        Regex::new(r"(?i)оным$").unwrap(),
        Regex::new(r"(?i)оными$").unwrap(),
        Regex::new(r"(?i)оных$").unwrap(),
        Regex::new(r"(?i)оные$").unwrap(),
    ]
});
pub static RE_ИСКЛЮЧЕНИЯ_ОН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
    LazyLock::new(|| {
        rapidhash::fast::RapidHashSet::from_iter(["скомпоную", "астроному", "колонн"])
    });
//
pub static ИСКЛЮЧЕНИЯ_ПОИСКА_ВЫДЕРА: LazyLock<Исключения_поиска_выдера> =
    LazyLock::new(|| Исключения_поиска_выдера {
        ван: vec![Исключение_поиска_выдера {
            вид_окончания: Text_Changer::Вид_Окончания::Ван,
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["вано"]),
            куча_обрезков_слов: rapidhash::fast::RapidHashSet::from_iter(["нир"]),
        }],
    });
//

//
#[derive(Debug, Clone)]
pub struct Окончания_включающие {
    pub ячейка_re: &'static [Re_образцы],
    pub срез_окончаний: &'static [&'static str],
}
#[derive(Debug, Clone)]
pub struct RE_Окончания_Поиск {
    pub re_поиска: Regex,
    pub re_замена: Regex,
    pub окончание_строка: &'static str,
    pub вид_окончания: Вид_Окончания,
}

#[derive(Debug, Clone)]
pub struct Re_образцы {
    pub содержимое: RE_Окончания_Поиск,
    pub исключения_первой_очереди: &'static [RE_исключающее_окончание],
    pub исключения_второй_очереди: &'static [RE_исключающее_окончание],
}
#[derive(Debug, Clone)]
pub struct RE_исключающее_окончание {
    pub re_образец: Regex,
    pub окончание_строка: &'static str,
    pub вид_окончания: Вид_Окончания,
}

impl Default for RE_исключающее_окончание {
    fn default() -> Self {
        Self {
            re_образец: Regex::new(r"").unwrap(),
            окончание_строка: "",
            вид_окончания: Вид_Окончания::Не_определено, // какой-то дефолтный вариант
        }
    }
}
pub static ПУСТОЕ_RE_ИСКЛЮЧАЮЩЕЕ_ОКОНЧАНИЕ: LazyLock<
    [RE_исключающее_окончание; 0],
> = LazyLock::new(|| Default::default());
/*pub struct Regex_с_заменой {
    поиск: Regex,
    замена: Regex,
}*/

pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание; 88],
> = LazyLock::new(|| {
    [

//под конец уже идут исключения
//
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ш$").unwrap(),
          окончание_строка: "ш",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ша$").unwrap(),
          окончание_строка: "ша",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шая$").unwrap(),
          окончание_строка: "шая",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шую$").unwrap(),
          окончание_строка: "шую",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ше$").unwrap(),
          окончание_строка: "ше",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ши$").unwrap(),
          окончание_строка: "ши",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шем$").unwrap(),
          окончание_строка: "шем",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шею$").unwrap(),
          окончание_строка: "шею",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шему$").unwrap(),
          окончание_строка: "шему",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шего$").unwrap(),
          окончание_строка: "шего",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шее$").unwrap(),
          окончание_строка: "шее",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шей$").unwrap(),
          окончание_строка: "шей",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шесть$").unwrap(),
          окончание_строка: "шесть",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестью$").unwrap(),
          окончание_строка: "шестью",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шести$").unwrap(),
          окончание_строка: "шести",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестей$").unwrap(),
          окончание_строка: "шестей",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестям$").unwrap(),
          окончание_строка: "шестям",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестями$").unwrap(),
          окончание_строка: "шестями",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестях$").unwrap(),
          окончание_строка: "шестях",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шим$").unwrap(),
          окончание_строка: "шим",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шими$").unwrap(),
          окончание_строка: "шими",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ший$").unwrap(),
          окончание_строка: "ший",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шие$").unwrap(),
          окончание_строка: "шие",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ших$").unwrap(),
          окончание_строка: "ших",
          вид_окончания: Вид_Окончания::_Ш,
      },
      //-------------
// -------------------------Н
 RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)н$").unwrap(),
    окончание_строка: "н",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)на$").unwrap(),
    окончание_строка: "на",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ная$").unwrap(),
    окончание_строка: "ная",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ную$").unwrap(),
    окончание_строка: "ную",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)но$").unwrap(),
    окончание_строка: "но",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ны$").unwrap(),
    окончание_строка: "ны",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ном$").unwrap(),
    окончание_строка: "ном",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ному$").unwrap(),
    окончание_строка: "ному",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ного$").unwrap(),
    окончание_строка: "ного",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)но$").unwrap(),
    окончание_строка: "но",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)но$").unwrap(),
    окончание_строка: "но",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ное$").unwrap(),
    окончание_строка: "ное",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ной$").unwrap(),
    окончание_строка: "ной",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ность$").unwrap(),
    окончание_строка: "ность",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ного$").unwrap(),
    окончание_строка: "ного",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностью$").unwrap(),
    окончание_строка: "ностью",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ности$").unwrap(),
    окончание_строка: "ности",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностей$").unwrap(),
    окончание_строка: "ностей",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностям$").unwrap(),
    окончание_строка: "ностям",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностями$").unwrap(),
    окончание_строка: "ностями",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностях$").unwrap(),
    окончание_строка: "ностях",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ным$").unwrap(),
    окончание_строка: "ным",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ными$").unwrap(),
    окончание_строка: "ными",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ный$").unwrap(),
    окончание_строка: "ный",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ные$").unwrap(),
    окончание_строка: "ные",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ных$").unwrap(),
    окончание_строка: "ных",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ния$").unwrap(),
    окончание_строка: "ния",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ниям$").unwrap(),
    окончание_строка: "ниям",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ниями$").unwrap(),
    окончание_строка: "ниями",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ниях$").unwrap(),
    окончание_строка: "ниях",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)нию$").unwrap(),
    окончание_строка: "нию",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)нием$").unwrap(),
    окончание_строка: "нием",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ние$").unwrap(),
    окончание_строка: "ние",
      вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ний$").unwrap(),
    окончание_строка: "ний",
      вид_окончания: Вид_Окончания::_Н,
},
//------------------то
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)та$").unwrap(),
    окончание_строка: "та",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)т$").unwrap(),
    окончание_строка: "т",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тая$").unwrap(),
    окончание_строка: "тая",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тую$").unwrap(),
    окончание_строка: "тую",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ты$").unwrap(),
    окончание_строка: "ты",
    вид_окончания: Вид_Окончания::Ты,
},
//
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)том$").unwrap(),
    окончание_строка: "том",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тому$").unwrap(),
    окончание_строка: "тому",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)то$").unwrap(),
    окончание_строка: "то",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)того$").unwrap(),
    окончание_строка: "того",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)той$").unwrap(),
    окончание_строка: "той",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тость$").unwrap(),
    окончание_строка: "тость",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостью$").unwrap(),
    окончание_строка: "тостью",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тости$").unwrap(),
    окончание_строка: "тости",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостей$").unwrap(),
    окончание_строка: "тостей",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостям$").unwrap(),
    окончание_строка: "тостям",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостями$").unwrap(),
    окончание_строка: "тостями",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостях$").unwrap(),
    окончание_строка: "тостях",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тым$").unwrap(),
    окончание_строка: "тым",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тыми$").unwrap(),
    окончание_строка: "тыми",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тый$").unwrap(),
    окончание_строка: "тый",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тые$").unwrap(),
    окончание_строка: "тые",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тых$").unwrap(),
    окончание_строка: "тых",
    вид_окончания: Вид_Окончания::Ты,
},
//
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыю$").unwrap(),
   окончание_строка: "ыю",
   вид_окончания: Вид_Окончания::_Ы,
},
 RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ые$").unwrap(),
    окончание_строка: "ые",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ыт$").unwrap(),
    окончание_строка: "ыт",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ым$").unwrap(),
    окончание_строка: "ым",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ыми$").unwrap(),
    окончание_строка: "ыми",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ых$").unwrap(),
    окончание_строка: "ых",
    вид_окончания: Вид_Окончания::_Ы,
},
]
});
//
pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание; 294],
> = LazyLock::new(|| {
    [
    //----------------В
    //ем
           //----------------
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)в$").unwrap(),
               окончание_строка: "в",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)ве$").unwrap(),
               окончание_строка: "ве",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)ва$").unwrap(),
               окончание_строка: "ва",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вая$").unwrap(),
               окончание_строка: "вая",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вую$").unwrap(),
               окончание_строка: "вую",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)во$").unwrap(),
               окончание_строка: "во",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вы$").unwrap(),
               окончание_строка: "вы",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вом$").unwrap(),
               окончание_строка: "вом",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вому$").unwrap(),
               окончание_строка: "вому",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)во$").unwrap(),
               окончание_строка: "во",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вого$").unwrap(),
               окончание_строка: "вого",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вое$").unwrap(),
               окончание_строка: "вое",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вой$").unwrap(),
               окончание_строка: "вой",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вость$").unwrap(),
               окончание_строка: "вость",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востью$").unwrap(),
               окончание_строка: "востью",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вости$").unwrap(),
               окончание_строка: "вости",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востей$").unwrap(),
               окончание_строка: "востей",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востям$").unwrap(),
               окончание_строка: "востям",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востями$").unwrap(),
               окончание_строка: "востями",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востях$").unwrap(),
               окончание_строка: "востях",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вым$").unwrap(),
               окончание_строка: "вым",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)выми$").unwrap(),
               окончание_строка: "выми",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вый$").unwrap(),
               окончание_строка: "вый",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вые$").unwrap(),
               окончание_строка: "вые",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вых$").unwrap(),
               окончание_строка: "вых",
               вид_окончания: Вид_Окончания::_В,
           },
           //--------------------
    //---------------Щ
    //
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щ$").unwrap(),
              окончание_строка: "щ",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)ща$").unwrap(),
              окончание_строка: "ща",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щая$").unwrap(),
              окончание_строка: "щая",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щую$").unwrap(),
              окончание_строка: "щую",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)ще$").unwrap(),
              окончание_строка: "ще",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щи$").unwrap(),
              окончание_строка: "щи",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щем$").unwrap(),
              окончание_строка: "щем",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щему$").unwrap(),
              окончание_строка: "щему",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щего$").unwrap(),
              окончание_строка: "щего",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щее$").unwrap(),
              окончание_строка: "щее",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щей$").unwrap(),
              окончание_строка: "щей",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щесть$").unwrap(),
              окончание_строка: "щесть",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестью$").unwrap(),
              окончание_строка: "щестью",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щести$").unwrap(),
              окончание_строка: "щести",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестей$").unwrap(),
              окончание_строка: "щестей",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестям$").unwrap(),
              окончание_строка: "щестям",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестями$").unwrap(),
              окончание_строка: "щестями",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестях$").unwrap(),
              окончание_строка: "щестях",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щим$").unwrap(),
              окончание_строка: "щим",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щими$").unwrap(),
              окончание_строка: "щими",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щий$").unwrap(),
              окончание_строка: "щий",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щие$").unwrap(),
              окончание_строка: "щие",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щих$").unwrap(),
              окончание_строка: "щих",
              вид_окончания: Вид_Окончания::_Щ,
          },
          //-------------
    //-----------------СТ
    //
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стая$").unwrap(),
              окончание_строка: "стая",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стую$").unwrap(),
              окончание_строка: "стую",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)сте$").unwrap(),
              окончание_строка: "сте",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)сти$").unwrap(),
              окончание_строка: "сти",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стем$").unwrap(),
              окончание_строка: "стем",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стему$").unwrap(),
              окончание_строка: "стему",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стей$").unwrap(),
              окончание_строка: "стей",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)сть$").unwrap(),
              окончание_строка: "сть",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стью$").unwrap(),
              окончание_строка: "стью",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)сти$").unwrap(),
              окончание_строка: "сти",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стей$").unwrap(),
              окончание_строка: "стей",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стям$").unwrap(),
              окончание_строка: "стям",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стями$").unwrap(),
              окончание_строка: "стями",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стях$").unwrap(),
              окончание_строка: "стях",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стим$").unwrap(),
              окончание_строка: "стим",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стими$").unwrap(),
              окончание_строка: "стими",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стий$").unwrap(),
              окончание_строка: "стий",
              вид_окончания: Вид_Окончания::Ст,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)стях$").unwrap(),
              окончание_строка: "стях",
              вид_окончания: Вид_Окончания::Ст,
          },
          //-------------
        //----------------Л
        //Л
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)л$").unwrap(),
            окончание_строка: "л",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лся$").unwrap(),
            окончание_строка: "лся",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ло$").unwrap(),
            окончание_строка: "ло",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лось$").unwrap(),
            окончание_строка: "лось",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ли$").unwrap(),
            окончание_строка: "ли",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лись$").unwrap(),
            окончание_строка: "лись",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лью$").unwrap(),
            окончание_строка: "лью",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лей$").unwrap(),
            окончание_строка: "лей",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ли$").unwrap(),
            окончание_строка: "ли",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лям$").unwrap(),
            окончание_строка: "лям",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лями$").unwrap(),
            окончание_строка: "лями",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лях$").unwrap(),
            окончание_строка: "лях",
            вид_окончания: Вид_Окончания::_Л,
        },
        //
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ав$").unwrap(),
            окончание_строка: "ав",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авша$").unwrap(),
            окончание_строка: "авша",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшая$").unwrap(),
            окончание_строка: "авшая",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшую$").unwrap(),
            окончание_строка: "авшую",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авше$").unwrap(),
            окончание_строка: "авше",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшее$").unwrap(),
            окончание_строка: "авшее",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авши$").unwrap(),
            окончание_строка: "авши",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшем$").unwrap(),
            окончание_строка: "авшем",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшему$").unwrap(),
            окончание_строка: "авшему",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшего$").unwrap(),
            окончание_строка: "авшего",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшее$").unwrap(),
            окончание_строка: "авшее",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшей$").unwrap(),
            окончание_строка: "авшей",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшесть$").unwrap(),
            окончание_строка: "авшесть",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшестью$").unwrap(),
            окончание_строка: "авшестью",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшести$").unwrap(),
            окончание_строка: "авшести",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшестей$").unwrap(),
            окончание_строка: "авшестей",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшестям$").unwrap(),
            окончание_строка: "авшестям",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшестями$").unwrap(),
            окончание_строка: "авшестями",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшестях$").unwrap(),
            окончание_строка: "авшестях",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшим$").unwrap(),
            окончание_строка: "авшим",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшими$").unwrap(),
            окончание_строка: "авшими",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авший$").unwrap(),
            окончание_строка: "авший",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авшие$").unwrap(),
            окончание_строка: "авшие",
            вид_окончания: Вид_Окончания::Авш,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)авших$").unwrap(),
            окончание_строка: "авших",
            вид_окончания: Вид_Окончания::Авш,
        },
        //-------------
        //Ан
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ан$").unwrap(),
            окончание_строка: "ан",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ана$").unwrap(),
            окончание_строка: "ана",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анная$").unwrap(),
            окончание_строка: "анная",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анную$").unwrap(),
            окончание_строка: "анную",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ано$").unwrap(),
            окончание_строка: "ано",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)аны$").unwrap(),
            окончание_строка: "аны",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анном$").unwrap(),
            окончание_строка: "анном",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анному$").unwrap(),
            окончание_строка: "анному",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анно$").unwrap(),
            окончание_строка: "анно",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анного$").unwrap(),
            окончание_строка: "анного",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анное$").unwrap(),
            окончание_строка: "анное",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анной$").unwrap(),
            окончание_строка: "анной",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анность$").unwrap(),
            окончание_строка: "анность",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностью$").unwrap(),
            окончание_строка: "анностью",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анности$").unwrap(),
            окончание_строка: "анности",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностей$").unwrap(),
            окончание_строка: "анностей",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностям$").unwrap(),
            окончание_строка: "анностям",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностями$").unwrap(),
            окончание_строка: "анностями",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностях$").unwrap(),
            окончание_строка: "анностях",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анным$").unwrap(),
            окончание_строка: "анным",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анными$").unwrap(),
            окончание_строка: "анными",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анный$").unwrap(),
            окончание_строка: "анный",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анные$").unwrap(),
            окончание_строка: "анные",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анных$").unwrap(),
            окончание_строка: "анных",
            вид_окончания: Вид_Окончания::Ан,
        },
        //-------------------------------------ён
        //ён
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ён$").unwrap(),
            окончание_строка: "ён",
            вид_окончания: Вид_Окончания::Ён,
        },
        //ёна
        /*RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёна$").unwrap(),
            окончание_строка: "ёна",
            вид_окончания: Вид_Окончания::Ён,
        },*/
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённая$").unwrap(),
            окончание_строка: "ённая",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённую$").unwrap(),
            окончание_строка: "ённую",
            вид_окончания: Вид_Окончания::Ён,
        },
       /* RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёно$").unwrap(),
            окончание_строка: "ёно",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёны$").unwrap(),
            окончание_строка: "ёны",
            вид_окончания: Вид_Окончания::Ён,
        },*/
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённом$").unwrap(),
            окончание_строка: "ённом",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённому$").unwrap(),
            окончание_строка: "ённому",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённого$").unwrap(),
            окончание_строка: "ённого",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённо$").unwrap(),
            окончание_строка: "ённо",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённое$").unwrap(),
            окончание_строка: "ённое",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённой$").unwrap(),
            окончание_строка: "ённой",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённость$").unwrap(),
            окончание_строка: "ённость",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостью$").unwrap(),
            окончание_строка: "ённостью",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённости$").unwrap(),
            окончание_строка: "ённости",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостей$").unwrap(),
            окончание_строка: "ённостей",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостям$").unwrap(),
            окончание_строка: "ённостям",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостями$").unwrap(),
            окончание_строка: "ённостями",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостях$").unwrap(),
            окончание_строка: "ённостях",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённым$").unwrap(),
            окончание_строка: "ённым",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёнными$").unwrap(),
            окончание_строка: "ёнными",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённый$").unwrap(),
            окончание_строка: "ённый",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённые$").unwrap(),
            окончание_строка: "ённые",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённых$").unwrap(),
            окончание_строка: "ённых",
            вид_окончания: Вид_Окончания::Ён,
        },
        //ен
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ен$").unwrap(),
            окончание_строка: "ен",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ена$").unwrap(),
            окончание_строка: "ена",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енная$").unwrap(),
            окончание_строка: "енная",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енную$").unwrap(),
            окончание_строка: "енную",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ено$").unwrap(),
            окончание_строка: "ено",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ены$").unwrap(),
            окончание_строка: "ены",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енном$").unwrap(),
            окончание_строка: "енном",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енному$").unwrap(),
            окончание_строка: "енному",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енного$").unwrap(),
            окончание_строка: "енного",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енно$").unwrap(),
            окончание_строка: "енно",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енное$").unwrap(),
            окончание_строка: "енное",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енной$").unwrap(),
            окончание_строка: "енной",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енность$").unwrap(),
            окончание_строка: "енность",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностью$").unwrap(),
            окончание_строка: "енностью",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енности$").unwrap(),
            окончание_строка: "енности",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностей$").unwrap(),
            окончание_строка: "енностей",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностям$").unwrap(),
            окончание_строка: "енностям",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностями$").unwrap(),
            окончание_строка: "енностями",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностях$").unwrap(),
            окончание_строка: "енностях",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енным$").unwrap(),
            окончание_строка: "енным",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енными$").unwrap(),
            окончание_строка: "енными",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енный$").unwrap(),
            окончание_строка: "енный",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енные$").unwrap(),
            окончание_строка: "енные",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енных$").unwrap(),
            окончание_строка: "енных",
            вид_окончания: Вид_Окончания::Ен,
        },
        //онн
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)он$").unwrap(),
            окончание_строка: "он",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)она$").unwrap(),
            окончание_строка: "она",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онная$").unwrap(),
            окончание_строка: "онная",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онную$").unwrap(),
            окончание_строка: "онную",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)оно$").unwrap(),
            окончание_строка: "оно",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)оны$").unwrap(),
            окончание_строка: "оны",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онном$").unwrap(),
            окончание_строка: "онном",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онному$").unwrap(),
            окончание_строка: "онному",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онно$").unwrap(),
            окончание_строка: "онно",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онного$").unwrap(),
            окончание_строка: "онного",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онное$").unwrap(),
            окончание_строка: "онное",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онной$").unwrap(),
            окончание_строка: "онной",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онность$").unwrap(),
            окончание_строка: "онность",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностью$").unwrap(),
            окончание_строка: "онностью",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онности$").unwrap(),
            окончание_строка: "онности",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностей$").unwrap(),
            окончание_строка: "онностей",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностям$").unwrap(),
            окончание_строка: "онностям",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностями$").unwrap(),
            окончание_строка: "онностями",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностях$").unwrap(),
            окончание_строка: "онностях",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онным$").unwrap(),
            окончание_строка: "онным",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онными$").unwrap(),
            окончание_строка: "онными",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онный$").unwrap(),
            окончание_строка: "онный",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онные$").unwrap(),
            окончание_строка: "онные",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онных$").unwrap(),
            окончание_строка: "онных",
            вид_окончания: Вид_Окончания::Он,
        },
        //------------------ит
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ит$").unwrap(),
            окончание_строка: "ит",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ита$").unwrap(),
            окончание_строка: "ита",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итая$").unwrap(),
            окончание_строка: "итая",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итую$").unwrap(),
            окончание_строка: "итую",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ито$").unwrap(),
            окончание_строка: "ито",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)иты$").unwrap(),
            окончание_строка: "иты",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итом$").unwrap(),
            окончание_строка: "итом",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итому$").unwrap(),
            окончание_строка: "итому",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ито$").unwrap(),
            окончание_строка: "ито",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итого$").unwrap(),
            окончание_строка: "итого",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итое$").unwrap(),
            окончание_строка: "итое",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итой$").unwrap(),
            окончание_строка: "итой",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итость$").unwrap(),
            окончание_строка: "итость",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостью$").unwrap(),
            окончание_строка: "итостью",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итости$").unwrap(),
            окончание_строка: "итости",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостей$").unwrap(),
            окончание_строка: "итостей",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостям$").unwrap(),
            окончание_строка: "итостям",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостями$").unwrap(),
            окончание_строка: "итостями",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостях$").unwrap(),
            окончание_строка: "итостях",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итым$").unwrap(),
            окончание_строка: "итым",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итыми$").unwrap(),
            окончание_строка: "итыми",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итый$").unwrap(),
            окончание_строка: "итый",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итые$").unwrap(),
            окончание_строка: "итые",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итых$").unwrap(),
            окончание_строка: "итых",
            вид_окончания: Вид_Окончания::Ит,
        },
        //ем
        //----------------
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ем$").unwrap(),
            окончание_строка: "ем",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ема$").unwrap(),
            окончание_строка: "ема",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емая$").unwrap(),
            окончание_строка: "емая",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емую$").unwrap(),
            окончание_строка: "емую",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емо$").unwrap(),
            окончание_строка: "емо",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емы$").unwrap(),
            окончание_строка: "емы",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емом$").unwrap(),
            окончание_строка: "емом",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емому$").unwrap(),
            окончание_строка: "емому",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емо$").unwrap(),
            окончание_строка: "емо",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емого$").unwrap(),
            окончание_строка: "емого",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емое$").unwrap(),
            окончание_строка: "емое",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емой$").unwrap(),
            окончание_строка: "емой",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емость$").unwrap(),
            окончание_строка: "емость",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостью$").unwrap(),
            окончание_строка: "емостью",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емости$").unwrap(),
            окончание_строка: "емости",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостей$").unwrap(),
            окончание_строка: "емостей",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостям$").unwrap(),
            окончание_строка: "емостям",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостями$").unwrap(),
            окончание_строка: "емостями",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостях$").unwrap(),
            окончание_строка: "емостях",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емым$").unwrap(),
            окончание_строка: "емым",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емыми$").unwrap(),
            окончание_строка: "емыми",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емый$").unwrap(),
            окончание_строка: "емый",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емые$").unwrap(),
            окончание_строка: "емые",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емых$").unwrap(),
            окончание_строка: "емых",
            вид_окончания: Вид_Окончания::Ем,
        },
        //-ом
        //ем
               //----------------
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)ом$").unwrap(),
                   окончание_строка: "ом",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)ома$").unwrap(),
                   окончание_строка: "ома",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омая$").unwrap(),
                   окончание_строка: "омая",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омую$").unwrap(),
                   окончание_строка: "омую",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омо$").unwrap(),
                   окончание_строка: "омо",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омы$").unwrap(),
                   окончание_строка: "омы",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омом$").unwrap(),
                   окончание_строка: "омом",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омому$").unwrap(),
                   окончание_строка: "омому",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омо$").unwrap(),
                   окончание_строка: "омо",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омого$").unwrap(),
                   окончание_строка: "омого",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омое$").unwrap(),
                   окончание_строка: "омое",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омой$").unwrap(),
                   окончание_строка: "омой",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омость$").unwrap(),
                   окончание_строка: "омость",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омостью$").unwrap(),
                   окончание_строка: "омостью",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омости$").unwrap(),
                   окончание_строка: "омости",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омостей$").unwrap(),
                   окончание_строка: "омостей",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омостям$").unwrap(),
                   окончание_строка: "омостям",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омостями$").unwrap(),
                   окончание_строка: "омостями",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омостях$").unwrap(),
                   окончание_строка: "омостях",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омым$").unwrap(),
                   окончание_строка: "омым",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омыми$").unwrap(),
                   окончание_строка: "омыми",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омый$").unwrap(),
                   окончание_строка: "омый",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омые$").unwrap(),
                   окончание_строка: "омые",
                   вид_окончания: Вид_Окончания::Ом,
               },
               RE_исключающее_окончание {
                   re_образец: Regex::new(r"(?i)омых$").unwrap(),
                   окончание_строка: "омых",
                   вид_окончания: Вид_Окончания::Ом,
               },
               //--------------------
        //--------------------
        // ван
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ван$").unwrap(),
            окончание_строка: "ван",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)вана$").unwrap(),
            окончание_строка: "вана",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванная$").unwrap(),
            окончание_строка: "ванная",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванную$").unwrap(),
            окончание_строка: "ванную",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)вано$").unwrap(),
            окончание_строка: "вано",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ваны$").unwrap(),
            окончание_строка: "ваны",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванном$").unwrap(),
            окончание_строка: "ванном",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванному$").unwrap(),
            окончание_строка: "ванному",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванного$").unwrap(),
            окончание_строка: "ванного",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванно$").unwrap(),
            окончание_строка: "ванно",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванное$").unwrap(),
            окончание_строка: "ванное",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванной$").unwrap(),
            окончание_строка: "ванной",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванность$").unwrap(),
            окончание_строка: "ванность",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностью$").unwrap(),
            окончание_строка: "ванностью",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванности$").unwrap(),
            окончание_строка: "ванности",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностей$").unwrap(),
            окончание_строка: "ванностей",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностям$").unwrap(),
            окончание_строка: "ванностям",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностями$").unwrap(),
            окончание_строка: "ванностями",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностях$").unwrap(),
            окончание_строка: "ванностях",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванным$").unwrap(),
            окончание_строка: "ванным",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванными$").unwrap(),
            окончание_строка: "ванными",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванный$").unwrap(),
            окончание_строка: "ванный",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванные$").unwrap(),
            окончание_строка: "ванные",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванных$").unwrap(),
            окончание_строка: "ванных",
            вид_окончания: Вид_Окончания::Ван,
        },
        //
    ]
});

//
pub static ПУСТОЙ_РЯД_RE: LazyLock<[Regex; 0]> = LazyLock::new(|| Default::default());
//
pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН: LazyLock<[Regex; 42]> = LazyLock::new(|| {
    [
        //ен
        //а
        Regex::new(r"(?i)еная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)енн$").unwrap(),
        Regex::new(r"(?i)енна$").unwrap(),
        Regex::new(r"(?i)енно$").unwrap(),
        Regex::new(r"(?i)енны$").unwrap(),
        //ую
        Regex::new(r"(?i)еную$").unwrap(),
        //о
        Regex::new(r"(?i)еное$").unwrap(),
        Regex::new(r"(?i)еного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)еном$").unwrap(),
        Regex::new(r"(?i)еному$").unwrap(),
        Regex::new(r"(?i)еность$").unwrap(),
        Regex::new(r"(?i)еностью$").unwrap(),
        Regex::new(r"(?i)ености$").unwrap(),
        Regex::new(r"(?i)еностей$").unwrap(),
        Regex::new(r"(?i)еностям$").unwrap(),
        Regex::new(r"(?i)еностями$").unwrap(),
        Regex::new(r"(?i)еностях$").unwrap(),
        //ы
        Regex::new(r"(?i)еным$").unwrap(),
        Regex::new(r"(?i)еными$").unwrap(),
        Regex::new(r"(?i)еных$").unwrap(),
        Regex::new(r"(?i)еные$").unwrap(),
        //----------------------------------);
        //ён
        //а
        Regex::new(r"(?i)ёная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)ённ$").unwrap(),
        Regex::new(r"(?i)ённа$").unwrap(),
        Regex::new(r"(?i)ённо$").unwrap(),
        Regex::new(r"(?i)ённы$").unwrap(),
        //ую
        Regex::new(r"(?i)ёную$").unwrap(),
        //о
        Regex::new(r"(?i)ёное$").unwrap(),
        Regex::new(r"(?i)ёного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)ёном$").unwrap(),
        Regex::new(r"(?i)ёному$").unwrap(),
        Regex::new(r"(?i)ёность$").unwrap(),
        Regex::new(r"(?i)ёностью$").unwrap(),
        Regex::new(r"(?i)ёности$").unwrap(),
        Regex::new(r"(?i)ёностей$").unwrap(),
        Regex::new(r"(?i)ёностям$").unwrap(),
        Regex::new(r"(?i)ёностями$").unwrap(),
        Regex::new(r"(?i)ёностях$").unwrap(),
        //ы
        Regex::new(r"(?i)ёным$").unwrap(),
        Regex::new(r"(?i)ёными$").unwrap(),
        Regex::new(r"(?i)ёных$").unwrap(),
        Regex::new(r"(?i)ёные$").unwrap(),
        //----------------------------------);
        //
    ]
});
//
pub static RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Re_образцы; 23]> = LazyLock::new(|| {
    [
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ван)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ван)$").unwrap(),
                окончание_строка: "ван",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вана)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вана)$").unwrap(),
                окончание_строка: "вана",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вано)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вано)$").unwrap(),
                окончание_строка: "вано",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ваны)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ваны)$").unwrap(),
                окончание_строка: "ваны",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванная)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванная)$").unwrap(),
                окончание_строка: "ванная",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванную)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванную)$").unwrap(),
                окончание_строка: "ванную",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванной)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванной)$").unwrap(),
                окончание_строка: "ванной",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванное)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванное)$").unwrap(),
                окончание_строка: "ванное",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванного)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванного)$").unwrap(),
                окончание_строка: "ванного",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванном)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванном)$").unwrap(),
                окончание_строка: "ванном",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванному)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванному)$").unwrap(),
                окончание_строка: "ванному",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванность)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванность)$").unwrap(),
                окончание_строка: "ванность",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностью)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностью)$").unwrap(),
                окончание_строка: "ванностью",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванности)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванности)$").unwrap(),
                окончание_строка: "ванности",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностей)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностей)$").unwrap(),
                окончание_строка: "ванностей",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностям)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностям)$").unwrap(),
                окончание_строка: "ванностям",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностями)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностями)$").unwrap(),
                окончание_строка: "ванностями",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностях)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностях)$").unwrap(),
                окончание_строка: "ванностях",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванным)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванным)$").unwrap(),
                окончание_строка: "ванным",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванными)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванными)$").unwrap(),
                окончание_строка: "ванными",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванных)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванных)$").unwrap(),
                окончание_строка: "ванных",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванные)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванные)$").unwrap(),
                окончание_строка: "ванные",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванный)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванный)$").unwrap(),
                окончание_строка: "ванный",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
    ]
});
//
pub const КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН: [&'static str; 23] = [
    "ван",
    "вана",
    "вано",
    "ваны",
    //
    "ванная",
    "ванную",
    //о
    "ванной",
    "ванное",
    "ванного",
    //глаголы
    "ванном",
    "ванному",
    //ст
    "ванность",
    "ванностью",
    "ванности",
    "ванностей",
    "ванностям",
    "ванностями",
    "ванностях",
    //ы
    "ванными",
    "ванным",
    "ванных",
    "ванные",
    "ванный",
];
//
pub static ТОРЖОК_ОКОНЧАНИЙ: LazyLock<[Виды_Окончаний_сборные; 24]> = LazyLock::new(|| {
    [
        //
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ван", "ен", "ён", "он", "ан", "ит", "ем", "ыт", "т", "н", "в",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "в",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(в)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ван",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ван)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ен",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ем",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ем)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ён",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ён)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "он",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(он)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ан",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ан)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ит",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ит)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыт",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыт)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "т",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)()$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "н",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(н)$").unwrap(),
                },
            ],
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
        },
        //вана
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вана", "ена", "ема", "ёна", "она", "ана", "на", "ита", "ыта", "та", "ва",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ва",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "вана",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вана)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ема",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ема)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "она",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(она)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ана",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ана)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ита",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ита)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыта",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыта)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "на",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                },
            ],
        },
        //
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вано", "ено", "емо", "ёно", "оно", "ано", "но", "ито", "ыто", "то",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "вано",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вано)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ен,

                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емо",
                    вид_окончания: Вид_Окончания::Ем,

                    re_выдер: Regex::new(r"(?i)(емо)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "оно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оно)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ано",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ано)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ито",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ито)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыто",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыто)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "то",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "то",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "но",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(но)$").unwrap(),
                },
            ],
        },
        //оны
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваны", "ены", "емы", "ёны", "оны", "аны", "ны", "иты", "ыты", "те", "ва",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ва",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ваны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емы",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емы)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "оны",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "аны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "иты",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(иты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыты",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "те",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(те)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ты",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(ты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ны",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ны)$").unwrap(),
                },
            ],
        },
        //ванный
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванный",
                "енный",
                "емый",
                "ённый",
                "онный",
                "анный",
                "ный",
                "итый",
                "ытый",
                "авший",
                "той",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авший",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авший)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                },
            ],
        },
        //ванных
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванных",
                "венных",
                "енных",
                "емых",
                "ённых",
                "онных",
                "анных",
                "ных",
                "итых",
                "ваших",
                "ытых",
                "тех",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емых",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итых",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытых",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авших",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авших)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тех",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тех)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венных",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венных)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ённых",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тых",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ных",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ных)$").unwrap(),
                },
            ],
        },
        //ванным
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванным",
                "венным",
                "енным",
                "емым",
                "ённым",
                "онным",
                "анным",
                "ным",
                "итым",
                "авшим",
                "ытым",
                "том",
                "тым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емым",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ным",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итым",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшим",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшим)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытым",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "том",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венным",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венным)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённым",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },
            ],
        },
        //ванными
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванными",
                "dенными",
                "енными",
                "емыми",
                "ёнными",
                "онными",
                "анными",
                "ными",
                "итыми",
                "авшими",
                "ытыми",
                "тыми",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ёнными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итыми",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшими",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшими)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытыми",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венными",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венными)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емыми",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ными",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ными)$").unwrap(),
                },
            ],
        },
        //ванный
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванный",
                "енный",
                "венный",
                "емый",
                "ённый",
                "онный",
                "анный",
                "ный",
                "итый",
                "авший",
                "ытый",
                "тый",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авший",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авший)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венный",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венный)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                },
            ],
        },
        //ванная
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванная",
                "енная",
                "емая",
                "ённая",
                "онная",
                "анная",
                "ная",
                "итая",
                "авшая",
                "ытая",
                "тая",
                "венная",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венная",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емая",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итая",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшая",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытая",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытая)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённая",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тая",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тая",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ная",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ная)$").unwrap(),
                },
            ],
        },
        //ванную
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванную",
                "енную",
                "емую",
                "ённую",
                "онную",
                "анную",
                "ную",
                "итую",
                "авшую",
                "ытую",
                "тую",
                "венную",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "венную",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ванную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емую",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итую",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшую",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытую",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытую)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённую",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тую",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тую",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ную",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ную)$").unwrap(),
                },
            ],
        },
        //ванном
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванном",
                "венном",
                "енном",
                "емом",
                "ённом",
                "онном",
                "анном",
                "ном",
                "итом",
                "авшем",
                "ытом",
                "том",
                "тым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емом",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итом",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшем",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшем)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытом",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венном",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венном)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённом",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "том",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ном",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ном)$").unwrap(),
                },
            ],
        },
        //ванному
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванному",
                "венному",
                "енному",
                "емому",
                "ённому",
                "онному",
                "анному",
                "ному",
                "итому",
                "авшему",
                "ытому",
                "тому",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емому",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итому",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшему",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшему)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытому",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венному",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венному)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённому",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тому",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тому",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ному",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ному)$").unwrap(),
                },
            ],
        },
        //ванного
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванного",
                "венного",
                "енного",
                "емого",
                "ённого",
                "онного",
                "анного",
                "ного",
                "итого",
                "авшего",
                "ытого",
                "того",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емого",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итого",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшего",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшего)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытого",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венного",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венного)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённого",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "того",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "того",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ного",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ного)$").unwrap(),
                },
            ],
        },
        //ванное
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванное",
                "венное",
                "енное",
                "емое",
                "ённое",
                "онное",
                "анное",
                "ное",
                "итое",
                "авшее",
                "ытое",
                "тое",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емое",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итое",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшее",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытое",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венное",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венное)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённое",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тое",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тое",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ное",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ное)$").unwrap(),
                },
            ],
        },
        //ванные
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванные",
                "венные",
                "енные",
                "емые",
                "ённые",
                "онные",
                "анные",
                "ные",
                "итые",
                "авшие",
                "ытые",
                "тые",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емые",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итые",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшие",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшие)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытые",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венные",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венные)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённые",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ные",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тые",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тые",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                },
            ],
        },
        //ванной
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванной",
                "венной",
                "енной",
                "емой",
                "ённой",
                "онной",
                "анной",
                "ной",
                "итой",
                "авшей",
                "ытой",
                "той",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "венной",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ванной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емой",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итой",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшей",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытой",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытой)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённой",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ной",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ной)$").unwrap(),
                },
            ],
        },
        //ванность
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванность",
                "венность",
                "енность",
                "емость",
                "ённость",
                "онность",
                "анность",
                "ность",
                "итость",
                "авшесть",
                "ытость",
                "тость",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емость",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итость",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшесть",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшесть)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытость",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венность",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венность)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённость",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тость",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тость",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ность",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ность)$").unwrap(),
                },
            ],
        },
        //ванностью
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностью",
                "венностью",
                "енностью",
                "емостью",
                "ённостью",
                "онностью",
                "анностью",
                "ностью",
                "итостью",
                "авшестью",
                "ытостью",
                "тостью",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостью",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостью",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестью",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостью",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венностью",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностью)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностью",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностью)$").unwrap(),
                },
            ],
        },
        //ванности
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванности",
                "емости",
                "венности",
                "енности",
                "ённости",
                "онности",
                "анности",
                "ности",
                "итости",
                "авшести",
                "ытости",
                "тости",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емости",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онности",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анности",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итости",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшести",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшести)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытости",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венности",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венности)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енности",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённости",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тости",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тости",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ности",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ности)$").unwrap(),
                },
            ],
        },
        //ванностей
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностей",
                "венностей",
                "енностей",
                "емостей",
                "ённостей",
                "онностей",
                "анностей",
                "ностей",
                "итостей",
                "авшестей",
                "ытостей",
                "тостей",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостей",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостей",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестей",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостей",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венностей",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностей)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностей",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностей)$").unwrap(),
                },
            ],
        },
        //ванностям
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностям",
                "венностям",
                "енностям",
                "емостям",
                "ённостям",
                "онностям",
                "анностям",
                "ностям",
                "итостям",
                "авшестям",
                "ытостям",
                "тостям",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостям",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостям",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестям",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостям",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венностям",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностям)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностям",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностям)$").unwrap(),
                },
            ],
        },
        //ванностями
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностями",
                "енностями",
                "венностями",
                "емостями",
                "ённостями",
                "онностями",
                "анностями",
                "ностями",
                "итостями",
                "авшестями",
                "ытостями",
                "тостями",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостями",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостями",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестями",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостями",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венностями",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностями)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностями",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностями)$").unwrap(),
                },
            ],
        },
        //ванностях
        Виды_Окончаний_сборные {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностях",
                "венностях",
                "енностях",
                "емостях",
                "ённостях",
                "онностях",
                "анностях",
                "ностях",
                "итостях",
                "авшестях",
                "ытостях",
                "тостях",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостях",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "венностях",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостях",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестях",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостях",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостях)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "енностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностях",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностях)$").unwrap(),
                },
            ],
        },
    ]
});
#[derive(Debug)]
pub struct Вид_Окончания_со_строкой {
    pub строка: &'static str,
    pub re_выдер: Regex,
    pub вид_окончания: Вид_Окончания,
}
impl Default for Вид_Окончания_со_строкой {
    fn default() -> Self {
        Self {
            строка: "",
            re_выдер: Regex::new(r"").unwrap(),
            вид_окончания: Вид_Окончания::Не_определено,
        }
    }
}

#[derive(Debug)]
pub struct Виды_Окончаний_сборные {
    pub первая_очередь: Vec<Вид_Окончания_со_строкой>,
    pub вторая_очередь: Vec<Вид_Окончания_со_строкой>,
    pub куча_окончаний: rapidhash::fast::RapidHashSet<&'static str>,
    pub окончания_исключения: rapidhash::fast::RapidHashSet<Вид_Окончания>,
}
pub trait Возможности_торжка {
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_исключающее_окончание,
        изначальное_окончание: &RE_Окончания_Поиск,
    ) -> Result<&Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>;
    //
    fn найти_окончание_к_слову_замене(
        &self,
        искомое_окончание: &str,
        ячейка_выдера: &Вид_Окончания_со_строкой,
    ) -> Result<&Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_в_торжке>;
    //
}
impl Возможности_торжка for [Виды_Окончаний_сборные] {
    //
    fn найти_окончание_к_слову_замене(
        &self,
        искомое_окончание: &str,
        ячейка_выдера: &Вид_Окончания_со_строкой,
    ) -> Result<&Вид_Окончания_со_строкой, Вид_ошибки_при_поиске_в_торжке> {
        //let mut найден_в_куче_окончаий: bool = false;
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел.куча_окончаний.contains(искомое_окончание)
            {
                //    найден_в_куче_окончаий = true;
                //если исключение
                if раздел
                    .окончания_исключения
                    .contains(&ячейка_выдера.вид_окончания)
                {
                    return Err(Вид_ошибки_при_поиске_в_торжке::Исключение);
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            /*println!(
                "найти_окончание_к_слову_замене -ищем окончание |{}|  в разделе |{:?}|",
                искомое_окончание,
                // искомое_окончание.as_bytes(),
                раздел.куча_окончаний,
            );*/
            /*for ячейка in раздел.куча_окончаний.iter() {
                println!("окончание |{}| побайтово |{:?}|", ячейка, ячейка.as_bytes());
            }*/
            if раздел.куча_окончаний.contains(искомое_окончание)
            {
                //
                println!(
                    "{}{}{}{}",
                    style(format!("найти_окончание_к_слову_замене - окончание ",)),
                    style(format!("|{}|", искомое_окончание)).cyan(),
                    style(format!(" найдено в разделе ",)),
                    style(format!("|{:?}|", раздел.куча_окончаний)).blue(),
                    /*"найти_окончание_к_слову_замене - окончание |{}| найдено в разделе |{:?}|",
                    искомое_окончание, раздел.куча_окончаний*/
                );
                let mut строка: String = String::new();
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                    строка = format!("{}+{}", строка, ячейка.вид_окончания.to_string());
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                    строка = format!("{}+{}", строка, ячейка.вид_окончания.to_string());
                }
                //
                println!(
                    "{}{}{}{}",
                    style(format!("не нашло  вид исходного окончания ",)),
                    style(format!("|{}|", ячейка_выдера.вид_окончания)).cyan(),
                    style(format!(" в ряде ",)),
                    style(format!("|{}|", строка)).blue(),
                    /*"не нашло  вид исходного окончания |{}| в ряде |{}|",
                    ячейка_выдера.вид_окончания,
                    строка*/
                );
                return Err(
                    Text_Changer::Вид_ошибки_при_поиске_в_торжке::Ошибка(format!(
                        "{}{}",
                        style(format!(
                            "найти_окончание_к_слову_замене - не нашло окончание для ",
                        )),
                        style(format!("|{}|", искомое_окончание)).cyan(),
                    )),
                );
            }
        }
        Err(
            Text_Changer::Вид_ошибки_при_поиске_в_торжке::Ошибка(
                format!(
                    "{}{}",
                    style(format!(
                        "найти_окончание_к_слову_замене - не нашло окончание для ",
                    )),
                    style(format!("|{}|", искомое_окончание)).cyan(),
                ),
            ),
        )
        //
    }
    //
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_исключающее_окончание,
        изначальное_окончание: &RE_Окончания_Поиск,
    ) -> Result<&Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>
    {
        let mut найден_в_куче_окончаий: bool = false;
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&изначальное_окончание.окончание_строка)
            {
                найден_в_куче_окончаий = true;
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        //перебор внутри
        for раздел in self.iter() {
            /*println!(
                "найти_окончание_выдера - ищем окончание |{}| в разделе |{:?}|",
                изначальное_окончание.окончание_строка, раздел.куча_окончаний,
            );*/
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&изначальное_окончание.окончание_строка)
            {
                //
                /*println!(
                    "найти_окончание_выдера - окончание |{}| найдено в разделе |{:?}|",
                    изначальное_окончание.окончание_строка, раздел.куча_окончаний
                );*/
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        return match найден_в_куче_окончаий{
            true=>  Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найдено_окончание_в_разделе) ,
            false=> Err( Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найдено_окончание_в_разделе)
        };
        /* Err(format!(
            "Найти окончание выдера - не нашло окончание для |{}|",
            изначальное_окончание.re_поиска
        ))*/
    }
}

// счётчик_входа.fetch_add(1, Ordering::Relaxed);

pub fn проверка_конечных_окончаний_re_образцов() {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        проверка_среза_строк_на_неповтор(
            &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
            "КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН",
        );
    }

    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}
pub fn проверка_среза_строк_на_неповтор(
    срез: &[&'static str],
    имя_кучи: &str,
) {
    let mut куча: rapidhash::fast::RapidHashSet<&str> = rapidhash::fast::RapidHashSet::default();
    //сама проверка
    for ячейка in срез.iter() {
        if !куча.contains(ячейка) {
            куча.insert(ячейка);
        } else {
            println!("Куча |{}| повторно содержит образец |{}|", имя_кучи, ячейка)
        }
    }
}

#[derive(Debug, Clone)]
pub struct Исключение_поиска_выдера {
    pub вид_окончания: Вид_Окончания,
    pub куча_окончаний: rapidhash::fast::RapidHashSet<&'static str>,
    pub куча_обрезков_слов: rapidhash::fast::RapidHashSet<&'static str>,
}
#[derive(Debug, Clone)]
pub struct Исключения_поиска_выдера {
    pub ван: Vec<Исключение_поиска_выдера>,
}
impl Исключения_поиска_выдера {
    pub fn есть_ли_в_исключениях(
        &self,
        обрезок_слова: &str,
        образец_окончания: &str,
    ) -> bool {
        let вид_окончания: Text_Changer::Вид_Окончания =
            Text_Changer::Вид_Окончания::из_среза(образец_окончания).unwrap();
        //
        match вид_окончания {
            Text_Changer::Вид_Окончания::Ван => {
                self.есть_ли_в_ван(обрезок_слова, образец_окончания)
            }
            _ => panic!(
                "ошибка при |{}| образец_окончания |{}|",
                обрезок_слова, образец_окончания
            ), //for раздел in self.iter() {}
        }
        //
    }
    pub fn есть_ли_в_ван(
        &self, обрезок_слова: &str, образец_окончания: &str
    ) -> bool {
        let вид_окончания: Text_Changer::Вид_Окончания =
            Text_Changer::Вид_Окончания::из_среза(образец_окончания).unwrap();
        //
        match вид_окончания {
            Text_Changer::Вид_Окончания::Ван => (),
            _ => panic!(
                "Ван = ошибка при |{}| образец_окончания |{}|",
                обрезок_слова, образец_окончания
            ), //for раздел in self.iter() {}
        };
        //перебор в ВАН
        for раздел in self.ван.iter() {
            //если есть обрезок слова и само окончания
            if раздел.куча_обрезков_слов.contains(обрезок_слова)
                && раздел.куча_окончаний.contains(образец_окончания)
            {
                return true;
            }
        }
        //
        false
    }
}
