use Text_Changer::{Вид_Окончания, *};
//use console::style;
//use gpui_kit::component::text::Text;
use rapidhash::RapidHashSet;
//use rayon::prelude::*;
use regex::Regex;
use std::sync::LazyLock;
//use std::sync::atomic::{AtomicBool, Ordering};

//
pub static ПУСТОЙ_РЯД_RE: LazyLock<[Regex; 0]> = LazyLock::new(|| Default::default());
//
pub static ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ: LazyLock<
    RapidHashSet<Вид_Окончания>,
> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // --- Личные (я, ты, мы, вы) ---
        Вид_Окончания::Г_сущ,
        Вид_Окончания::Ок_сущ,
        Вид_Окончания::Ж_сущ,
        Вид_Окончания::Р_сущ,
        Вид_Окончания::Ц_сущ,
        Вид_Окончания::Д_СУЩ,
        Вид_Окончания::Ют_сущ,
    ])
});
//
pub static ТОРЖОК_ОКОНЧАНИЙ: LazyLock<[Раздел_Торжка; 29]> = LazyLock::new(|| {
    [
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ко_ка,
                Text_Changer::Вид_Окончания::Ым,
                Text_Changer::Вид_Окончания::Ям,
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_Л,
                //Вид_Окончания::Ва_Во,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Ж_сущ,
                Text_Changer::Вид_Окончания::Ва_Во,
                Text_Changer::Вид_Окончания::Вш,
                Text_Changer::Вид_Окончания::_В,
                Вид_Окончания::_Е,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            //
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ван", "ен", "ён", "он", "ан", "ит", "ыт", "н", "ят", "т", "ив", "нят", "ут",
                "нут", "щ", "елен", "рен", "ель", "пен", "жен", "тен", "дан", "ат", "ем", "сён",
                "сен", "ин", "ян", "ъят", "чие", "ён", "ёс", "ес",
                "чен", //"в", //добавлен как устав поменять на диван и т.д.
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ъят",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъят)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ян",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(ян)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ин",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(ин)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "с",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(с)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "сен",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сен)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сён",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сён)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ес",
                    вид_окончания: Вид_Окончания::Сл,
                    re_выдер: Regex::new(r"(?i)(ес)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёс",
                    вид_окончания: Вид_Окончания::Сл,
                    re_выдер: Regex::new(r"(?i)(ёс)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чен",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чен)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ем",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ем)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чие",
                    вид_окончания: Вид_Окончания::Чи,
                    re_выдер: Regex::new(r"(?i)(чие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ат",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(ат)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тен",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жен",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пен",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рен",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "елен",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(елен)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щ",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щ)$").unwrap(),
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {

                    строка: "в",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(в)$").unwrap(),
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ив",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ив)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нят",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нят)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дан",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(дан)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ван",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ван)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ен",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                    особенности_образца:
                        Особенности_образца_Торжка {
                            возрат_повтор: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ен",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                    особенности_образца:
                        Особенности_образца_Торжка {
                            возрат_повтор: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ён",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ён)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "он",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(он)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ит",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ит)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ыт",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыт)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нут",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нут)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ут",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(ут)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "т",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ан",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ан)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ят",
                    вид_окончания: Вид_Окончания::Ят,
                    re_выдер: Regex::new(r"(?i)(ят)$").unwrap(),
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "т",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)()$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "н",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(н)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ель",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ель)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //вана
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::Ям,
                Text_Changer::Вид_Окончания::Сл,
                Text_Changer::Вид_Окончания::Ти,
                Text_Changer::Вид_Окончания::Чи,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::_Ш,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льна",
                "вана",
                "ванна",
                "дана",
                "данна",
                "пна",
                "ена",
                "ёна",
                "енна",
                "ённа",
                "ема",
                "она",
                "онна",
                "анна",
                "ана",
                "на",
                "ита",
                "ыта",
                "та",
                //"ва",
                "сенна",
                "сена",
                "сённа",
                "сёна",
                //"ка",
                "нята",
                "ельна",
                "ива",
                "ели",
                "тна",
                "жна",
                "ута",
                "нута",
                "ата",
                "ща",
                "ома",
                //"ама",
                "чна",
                "та",
                "рна",
                "ъята",
                "сна",
                "ина",
                "инна",
                "яна",
                "янна",
                //"га",
                "ова",
                "вша",
                //"жа",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янна",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янна)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яна",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инна",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инна)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ина",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(ина)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вша",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вша)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ова",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(ова)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "жа",
                    вид_окончания: Вид_Окончания::Ж_сущ,
                    re_выдер: Regex::new(r"(?i)(жа)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "сна",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "га",
                    вид_окончания: Вид_Окончания::Г_одиночн,
                    re_выдер: Regex::new(r"(?i)(га)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ъята",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъята)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рна",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "на",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "на",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "на",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "чна",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ама",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(ама)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ома",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(ома)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ща",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(ща)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льна",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ута",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(ута)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нута",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нута)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жна",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тна",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пна",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нята",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нята)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ва",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "сенна",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенна)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сена",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сена)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёна",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённа",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённа)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельна",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        обмен_на_двойную_согласную: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ива",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ива)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ата",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(ата)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вана",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вана)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванна",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дана",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(дана)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данна",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енна",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ема",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ема)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енна",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(енна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "она",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(она)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онна",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ана",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ана)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анна",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ита",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ита)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ыта",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыта)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ели",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ели)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Вид_Окончания::Ям,
                Вид_Окончания::Ко_ка,
                //Вид_Окончания::Ст,
                Вид_Окончания::Ом,
                Вид_Окончания::Ов,
                Вид_Окончания::_С,
                Вид_Окончания::Д_СУЩ,
                Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Вид_Окончания::Ва_Во,
                Вид_Окончания::_Ш,
                Вид_Окончания::Г_полн,
                Вид_Окончания::Ам,
                Вид_Окончания::Ти,
                Вид_Окончания::Чи,
                Вид_Окончания::_Н,
                Вид_Окончания::_В,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льнее",
                "ванее",
                "ваннее",
                "данее",
                "даннее",
                "пнее",
                "енее",
                "еннее",
                "сенее",
                "сеннее",
                "сёнее",
                "сённее",
                "емее",
                "ёнее",
                "ённее",
                "онее",
                "оннее",
                "анее",
                "аннее",
                "нее",
                "итее",
                "ытее",
                "тее",
                //"вшее",
                //"шее",
                "стее",
                "лее",
                "нятнее",
                "нятее",
                "ельнее",
                "ивее",
                "тнее",
                "жнее",
                "атее",
                "щее",
                "утее",
                "нутее",
                "ятее",
                "рнее",
                "снее",
                "инее",
                "иннее",
                "янее",
                "яннее",
                "ъятее",
                "чнее",
            ]),

            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янее",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яннее",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инее",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иннее",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "снее",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(снее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятее",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чнее",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рнее",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ятее",
                    вид_окончания: Вид_Окончания::Ят,
                    re_выдер: Regex::new(r"(?i)(ятее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутее",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утее",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щее",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льнее",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атее",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тнее",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жнее",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пнее",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "нятее",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятнее",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельнее",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивее",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данее",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даннее",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        обмен_на_двойную_согласную: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванее",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваннее",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенее",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеннее",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёнее",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённее",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енее",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еннее",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёнее",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённее",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емее",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онее",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оннее",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анее",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аннее",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итее",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытее",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "стее",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "лее",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "шее",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "тее",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нее",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(нее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Вид_Окончания::Ям,
                Вид_Окончания::Ст,
                Вид_Окончания::Ов,
                Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                //Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::_Ш,
                Text_Changer::Вид_Окончания::Ж_сущ,
                //Text_Changer::Вид_Окончания::_В,
                Вид_Окончания::Ти,
                Вид_Окончания::Чи,
                Вид_Окончания::Ам,
                Вид_Окончания::_Н,
                Вид_Окончания::_С,
                Вид_Окончания::_В,
                Вид_Окончания::_Л,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льно",
                "вано",
                "ванно",
                "дано",
                "данно",
                "пно",
                "ено",
                "емо",
                "оно",
                "ано",
                "но",
                "ито",
                "ыто",
                "то",
                "уто",
                "нуто",
                "ко",
                "иво",
                "нято",
                "ельно",
                "енно",
                "ено",
                "ённо",
                "ёно",
                "онно",
                "анно",
                "вше",
                "чно",
                "жно",
                "тно",
                "яно",
                "янно",
                "ато",
                "ще",
                "омо",
                "сено",
                "сёно",
                "сённо",
                "сенно",
                "рно",
                "ъято",
                "сно",
                "ино",
                "инно",
                "го",
                //"ло",
                "во",
                "есен",
                "есён",
                //"ло",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янно",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яно",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инно",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "во",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(во)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ино",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(ино)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сно",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "есен",
                    вид_окончания: Вид_Окончания::Сл,
                    re_выдер: Regex::new(r"(?i)(есен)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "есён",
                    вид_окончания: Вид_Окончания::Сл,
                    re_выдер: Regex::new(r"(?i)(есён)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ло",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(ло)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ло",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(ло)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "го",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(го)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъято",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъято)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ще",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(ще)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рно",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенно",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённо",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённо)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сено",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сено)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёно",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омо",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омо)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льно",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ато",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(ато)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тно",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жно",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пно",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чно",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нуто",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нуто)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "уто",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(уто)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нято",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нято)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иво",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(иво)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ко",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ко)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельно",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вано",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вано)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дано",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(дано)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сно",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "емо",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емо)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ито",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ито)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ыто",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыто)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данно",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванно",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анно",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ано",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ано)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вше",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вше)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енно",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённо",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённо)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "то",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "то",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "но",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(но)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "но",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(но)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ёно",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //оны
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_Ш,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::Ям,
                Text_Changer::Вид_Окончания::Чи,
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::Ым,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::Ва_Во,
                Вид_Окончания::Ти,
                Вид_Окончания::Ж_сущ,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваны",
                "ванны",
                "даны",
                "данны",
                "ены",
                "ёны",
                "енны",
                "ённы",
                "емы",
                "оны",
                "аны",
                "анны",
                "ны",
                "иты",
                "ыты",
                "те",
                "ты",
                "сены",
                "сёны",
                "няты",
                "ивы",
                "ельны",
                "ели",
                "чны",
                "пны",
                "жны",
                "тны",
                "уты",
                "нуты",
                "яны",
                "янны",
                "аты",
                "щи",
                "льны",
                "омы",
                "ны",
                "рны",
                "ъяты",
                "сны",
                "ины",
                "инны",
                //"ги",
                "вши",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янны",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яны",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инны",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ины",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(ины)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ги",
                    вид_окончания: Вид_Окончания::Г_одиночн,
                    re_выдер: Regex::new(r"(?i)(ги)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "вши",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вши)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сны",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъяты",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъяты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рны",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омы",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омы)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щи",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щи)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льны",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "уты",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(уты)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нуты",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нуты)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тны",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тны)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жны",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пны",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чны",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельны",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивы",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивы)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "няты",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(няты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сены",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сены)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёны",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аты",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(аты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даны",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данны",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енны",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енны",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(енны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емы",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емы)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оны",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оны)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иты",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(иты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ыты",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "те",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(те)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ты",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(ты)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ны",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ны",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ели",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ели)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванный
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ст,
                Вид_Окончания::Ц_сущ,
                Вид_Окончания::_В,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "атый",
                "льный",
                "ванный",
                "ваный",
                "данный",
                "даный",
                "ельный",
                "еный",
                "енный",
                "емый",
                "сенный",
                "сеный",
                "ённый",
                "ёный",
                "онный",
                "оный",
                "анный",
                "аный",
                "ный",
                "итый",
                "ытый",
                "вший",
                "сёный",
                "сённый",
                //"той",
                "тый",
                "кий",
                "нятый",
                "ивый",
                "чный",
                "пный",
                "жный",
                "утый",
                "нутый",
                "омый",
                "ъятый",
                "овой",
                "рный",
                "сный",
                "иный",
                "инный",
                "гий",
                "щий",
                "яный",
                "янный",
                "тный",
                //"амый",
                "ший",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янный",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яный",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инный",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иный",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сный",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рный",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тный",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амый",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "щий",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щий)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овой",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятый",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гий",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гий)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омый",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ший",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(ший)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льный",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутый",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утый",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жный",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пный",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чный",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятый",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивый",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённый",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённый)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёный",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенный",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеный",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кий",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кий)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельный",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атый",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данный",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даный",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёный",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вший",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вший)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ный",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванных
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Ва_Во,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_В,
                // Text_Changer::Вид_Окончания::_Ш,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "атых",
                "льных",
                "ванных",
                "ваных",
                "данных",
                "даных",
                "жных",
                //"венных",
                "енных",
                "еных",
                "сенных",
                "сеных",
                "сённых",
                "сёных",
                "емых",
                "ённых",
                "ёных",
                "онных",
                "оных",
                "анных",
                "аных",
                "ных",
                "итых",
                "вших",
                "ытых",
                //"тех",
                "тых",
                "ких",
                "нятых",
                "нятных",
                "ивых",
                "утых",
                "нутых",
                "чных",
                "ших",
                "ельных",
                "пных",
                "тных",
                "утых",
                "янных",
                "яных",
                "рных",
                "ъятых",
                "сных",
                "иных",
                "инных",
                "гих",
                "овых",
                "щих",
                //"амых",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "инных",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иных",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сных",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амых",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ъятых",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гих",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гих)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щих",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щих)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овых",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рных",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льных",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яных",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янных",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тных",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жных",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пных",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельных",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чных",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ших",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(ших)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утых",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутых",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ких",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ких)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятных",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятых",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивых",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атых",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данных",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даных",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенных",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеных",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённых",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённых)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёных",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емых",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итых",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытых",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вших",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вших)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тех",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тех)$").unwrap(),
                    ..Default::default()
                },*/
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венных",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венных)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ённых",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённых)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёных",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тых",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ных",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ных",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванным
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Ям,
                Вид_Окончания::_Л,
                Вид_Окончания::_В,
                Вид_Окончания::Ст,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льным",
                "ванным",
                "ваным",
                "атым",
                "данным",
                "даным",
                "ельным",
                // "венным",
                "енным",
                "еным",
                "сенным",
                "сеным",
                "сённым",
                "сёным",
                "емым",
                "ённым",
                "ёным",
                "онным",
                "оным",
                "анным",
                "аным",
                "ным",
                "итым",
                "вшим",
                "ытым",
                //"том",
                "тым",
                "ким",
                "нятым",
                "ым",
                "ивым",
                "чным",
                "пным",
                "жным",
                "тным",
                "утым",
                "нутым",
                "овым",
                "рным",
                "шим",
                "сным",
                "иным",
                "инным",
                "янным",
                "яным",
                "щим",
                "ъятым",
                "гим",
                //"амым",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янным",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яным",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инным",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иным",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сным",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гим",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гим)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амым",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "шим",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шим)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятым",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щим",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щим)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рным",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овым",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льным",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутым",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утым",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тным",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жным",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пным",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельным",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чным",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ким",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ким)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятым",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивым",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атым",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данным",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даным",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенным",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеным",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённым",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённым)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёным",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емым",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ным",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ным",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "итым",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшим",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшим)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытым",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "том",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                    ..Default::default()
                },*/
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венным",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венным)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённым",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённым)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёным",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ым",
                    вид_окончания: Вид_Окончания::Ым,
                    re_выдер: Regex::new(r"(?i)(ым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванными
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::Ям,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::Ом,
                Вид_Окончания::Ва_Во,
                Вид_Окончания::Ст,
                Вид_Окончания::_В,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льными",
                "ванными",
                "ваными",
                "данными",
                "даными",
                "ельными",
                "ыми",
                "атыми",
                //"венными",
                "сенными",
                "сеными",
                "сёнными",
                "сёными",
                "енными",
                "еными",
                "емыми",
                "ёнными",
                "ёными",
                "онными",
                "оными",
                "анными",
                "аными",
                "ными",
                "итыми",
                "вшими",
                "ытыми",
                "тыми",
                "кими",
                "нятыми",
                "нятными",
                "ивыми",
                "утыми",
                "нутыми",
                "чными",
                "пными",
                "жными",
                "овыми",
                "тными",
                "янными",
                "яными",
                "ъятыми",
                "рными",
                "шими",
                "щими",
                "сными",
                "иными",
                "инными",
                "гими",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "инными",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иными",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сными",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щими",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шими",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рными",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятыми",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льными",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яными",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янными",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тными",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овыми",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельными",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жными",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чными",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гими",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пными",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утыми",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутыми",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ыми",
                    вид_окончания: Вид_Окончания::Ым,
                    re_выдер: Regex::new(r"(?i)(ыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивыми",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атыми",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данными",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даными",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятыми",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятными",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кими",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенными",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеными",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёнными",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёнными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёными",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёнными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итыми",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшими",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытыми",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "венными",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венными)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емыми",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ными",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ными",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванная
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ва_Во,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::_С,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льная",
                "ваная",
                "ванная",
                "даная",
                "данная",
                "пная",
                "сенная",
                "сеная",
                "сённая",
                "сёная",
                "еная",
                "енная",
                "емая",
                "ённая",
                "ёная",
                "онная",
                "оная",
                "анная",
                "аная",
                "ная",
                "итая",
                "вшая",
                "ытая",
                "тая",
                "кая",
                "нятая",
                "нятная",
                "ельная",
                "ивая",
                "овая",
                "чная",
                "тная",
                "жная",
                "шая",
                "утая",
                "нутая",
                "атая",
                "омая",
                "рная",
                "щая",
                "сная",
                "иная",
                "инная",
                "гая",
                "янная",
                "яная",
                "стая",
                //"амая",
                "ъятая",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янная",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яная",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инная",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иная",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сная",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "стая",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шая",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амая",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ъятая",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щая",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рная",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омая",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льная",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атая",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутая",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утая",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жная",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гая",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тная",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чная",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пная",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овая",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кая",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенная",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеная",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённая",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённая)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёная",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельная",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивая",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даная",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данная",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятая",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятная",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венная",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венная)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "емая",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итая",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшая",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытая",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённая",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённая)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёная",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тая",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ная",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ная",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванную
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::Ям,
                Вид_Окончания::Ва_Во,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льную",
                "ванную",
                "ваную",
                "данную",
                "даную",
                "ельную",
                "сенную",
                "сеную",
                "енную",
                "сённую",
                "сёную",
                "еную",
                "емую",
                "ённую",
                "ёную",
                "онную",
                "оную",
                "анную",
                "аную",
                "ную",
                "итую",
                "вшую",
                "ытую",
                "тую",
                "кую",
                "нятую",
                "нятную",
                "ивую",
                "утую",
                "чную",
                "пную",
                "тную",
                "жную",
                "нутую",
                "атую",
                "омую",
                "щую",
                "шую",
                "рную",
                "сную",
                "янную",
                "яную",
                "иную",
                "инную",
                "овую",
                "гую",
                "ъятую", //"венную",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "инную",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иную",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янную",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яную",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сную",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гую",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятую",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шую",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овую",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рную",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щую",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омую",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льную",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атую",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утую",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутую",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жную",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тную",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пную",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чную",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельную",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенную",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеную",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённую",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённую)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёную",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венную",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венную)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "кую",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятную",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятую",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивую",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данную",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даную",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емую",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итую",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшую",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытую",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённую",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённую)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёную",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тую",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ную",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ную",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванном
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::_С,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванном",
                "ваном",
                "данном",
                "даном",
                //"венном",
                "енном",
                "еном",
                "ельном",
                "сенном",
                "сеном",
                "сённом",
                "сёном",
                "емом",
                "ённом",
                "ёном",
                "онном",
                "оном",
                "анном",
                "аном",
                "ном",
                "итом",
                "вшем",
                "ытом",
                "том",
                //"тым",
                "нятом",
                "нятном",
                "ивом",
                "жном",
                "ъятом",
                "янном",
                "яном",
                "тном",
                "утом",
                "нутом",
                "атом",
                "льном",
                "омом",
                "пном",
                "чном",
                "рном",
                "шем",
                "овом",
                "сном",
                "ином",
                "инном",
                //"гом",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "инном",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ином",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(ином)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сном",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овом",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шем",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шем)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рном",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чном",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "гом",
                    вид_окончания: Вид_Окончания::Г_одиночн,
                    re_выдер: Regex::new(r"(?i)(гом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "пном",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омом",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атом",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льном",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утом",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутом",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янном",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яном",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тном",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жном",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятом",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельном",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенном",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеном",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённом",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённом)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёном",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятном",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятом",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивом",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данном",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даном",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емом",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итом",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшем",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшем)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытом",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венном",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венном)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённом",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённом)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёном",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "том",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ном",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ном",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванному
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::_Н,
                Вид_Окончания::_Л,
                Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::Ям,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванному",
                "ваному",
                "данному",
                "даному",
                "ельному",
                //"венному",
                "енному",
                "еному",
                "сенному",
                "сеному",
                "сённому",
                "сёному",
                "емому",
                "ённому",
                "ёному",
                "онному",
                "оному",
                "анному",
                "аному",
                "ному",
                "итому",
                "вшему",
                "ытому",
                "тому",
                "кому",
                "нятому",
                "ивому",
                "пному",
                "тному",
                "жному",
                "утому",
                "нутому",
                "атому",
                "льному",
                "омому",
                "рному",
                "шему",
                "янному",
                "яному",
                "сному",
                "ъятому",
                "иному",
                "инному",
                "щему",
                "гому",
                "овому",
                //"амому",
                "чному",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "щему",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щему)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инному",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иному",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чному",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овому",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятому",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гому",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амому",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "сному",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янному",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яному",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шему",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шему)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рному",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омому",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льному",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атому",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутому",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утому",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тному",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жному",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельному",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кому",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятому",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивому",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(вому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данному",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даному",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенному",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеному",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённому",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённому)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёному",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емому",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итому",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшему",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшему)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытому",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пному",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венному",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венному)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённому",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённому)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёному",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тому",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ному",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ному",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванного
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Ств,
                Вид_Окончания::Ц_сущ,
                Вид_Окончания::_Л,
                Вид_Окончания::Д_СУЩ,
                Вид_Окончания::_Н,
                Вид_Окончания::_С,
                Вид_Окончания::_В,
                Вид_Окончания::Ст,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванного",
                "ваного",
                "данного",
                "даного",
                //"венного",
                "енного",
                "еного",
                "сенного",
                "сеного",
                "сённого",
                "сёного",
                "емого",
                "ённого",
                "ёного",
                "онного",
                "оного",
                "анного",
                "аного",
                "ного",
                "итого",
                "вшего",
                "ытого",
                "того",
                "кого",
                "нятого",
                "ельного",
                "ивого",
                "щего",
                "пного",
                "тного",
                "жного",
                "утого",
                "нутого",
                "атого",
                "льного",
                "омого",
                "рного",
                "шего",
                "сного",
                "чного",
                "иного",
                "инного",
                "гого",
                "ъятого",
                "яного",
                "янного",
                "вого",
                "ового",
                //"амого",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янного",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яного",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инного",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иного",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чного",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амого",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "вого",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(вого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ового",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(ового)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сного",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятого",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гого",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шего",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шего)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рного",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омого",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льного",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атого",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутого",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утого",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тного",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жного",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пного",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щего",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щего)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельного",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кого",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенного",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеного",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённого",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённого)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёного",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятого",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивого",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данного",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даного",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емого",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итого",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшего",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшего)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытого",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венного",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венного)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённого",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённого)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёного",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "того",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ного",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ного",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванное
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::Ст,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванное",
                "ваное",
                "данное",
                "даное",
                //"венное",
                "енное",
                "еное",
                "сенное",
                "сеное",
                "сённое",
                "сёное",
                "емое",
                "ённое",
                "ёное",
                "онное",
                "оное",
                "анное",
                "аное",
                "ное",
                "итое",
                //"вшее",
                "ытое",
                "тое",
                "ятое",
                "кое",
                "нятое",
                "ивое",
                "ельное",
                "щее",
                "пное",
                "нятное",
                "жное",
                "тное",
                "утое",
                "нутое",
                "атое",
                "льное",
                "омое",
                "рное",
                "шее",
                "чное",
                "сное",
                "иное",
                "инное",
                "яное",
                "янное",
                "гое",
                "ъятое",
                "вшее",
                "овое",
                //"амое",
                "вое",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "янное",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яное",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инное",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иное",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амое",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "вое",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(вое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятое",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сное",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овое",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гое",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чное",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шее",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шее)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рное",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        обмен_на_двойную_согласную: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омое",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        обмен_на_двойную_согласную: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льное",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        обмен_на_двойную_согласную: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атое",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутое",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утое",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жное",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тное",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пное",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щее",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кое",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятое",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятное",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельное",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивое",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данное",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даное",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенное",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеное",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённое",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённое)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёное",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емое",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емое)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итое",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ытое",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ятое",
                    вид_окончания: Вид_Окончания::Ят,
                    re_выдер: Regex::new(r"(?i)(ятое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венное",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венное)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённое",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённое)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёное",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тое",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ное",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ное",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванные
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_С,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ям,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            //
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льные",
                "ванные",
                "ваные",
                "данные",
                "даные",
                "ивые",
                "сенные",
                "сеные",
                "сённые",
                "сёные",
                //"венные",
                "енные",
                "еные",
                "емые",
                "ённые",
                "ёные",
                "онные",
                "оные",
                "анные",
                "аные",
                "ные",
                "итые",
                "вшие",
                "ытые",
                "тые",
                "кие",
                "нятые",
                "нятные",
                "жные",
                "пные",
                "тные",
                "янные",
                "яные",
                "утые",
                "нутые",
                "атые",
                "шие",
                "рные",
                "сные",
                "иные",
                "инные",
                "гие",
                //"амые",
                "ъятые",
                "чные",
                "щие",
                "ельные",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "инные",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иные",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сные",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рные",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельные",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чные",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "амые",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(амые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "щие",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятые",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шие",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гие",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атые",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льные",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутые",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утые",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тные",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жные",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пные",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивые",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятные",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятые",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кие",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенные",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеные",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённые",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённые)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёные",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янные",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яные",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данные",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даные",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емые",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итые",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшие",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытые",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венные",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венные)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённые",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённые)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёные",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ные",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ные",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "тые",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванной
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::Р_сущ,
                Text_Changer::Вид_Окончания::_Л,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::_В,
                Text_Changer::Вид_Окончания::_Н,
                Text_Changer::Вид_Окончания::Д_СУЩ,
                Text_Changer::Вид_Окончания::_С,
            ])
            .into_iter()
            .chain(ОКОНЧАНИЯ_ТОЛЬКО_СУЩЕСТВИТЕЛЬНЫЕ.iter().cloned())
            .collect(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванной",
                "ваной",
                "данной",
                "даной",
                //"венной",
                "енной",
                "еной",
                "сенной",
                "сеной",
                "сённой",
                "сёной",
                "емой",
                "ённой",
                "ёной",
                "онной",
                "аной",
                "анной",
                "ной",
                "итой",
                "вшей",
                "ытой",
                "той",
                "кой",
                "нятой",
                "нятной",
                "ельной",
                "ивой",
                "щей",
                "пной",
                "оной",
                "тной",
                "жной",
                "утой",
                "нутой",
                "атой",
                "льной",
                "омой",
                "ъятой",
                "чной",
                "янной",
                "яной",
                "рной",
                "сной",
                "иной",
                "инной",
                "гой",
                "шей",
                "вой",
                "овой",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "иной",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инной",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вой",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(вой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гой",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сной",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рной",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овой",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "шей",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яной",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янной",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чной",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятой",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "омой",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(омой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льной",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атой",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутой",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утой",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тной",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жной",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щей",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельной",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кой",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венной",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венной)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "нятной",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятой",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивой",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даной",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данной",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенной",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеной",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённой",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённой)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёной",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емой",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итой",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшей",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытой",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пной",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённой",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённой)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёной",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ной",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ной",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванность
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::_Ш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванность",
                "ваность",
                "данность",
                "даность",
                "пность",
                "ельность",
                "кость",
                //"венность",
                "енность",
                "еность",
                "емость",
                "ённость",
                "ёность",
                "онность",
                "оность",
                "анность",
                "аность",
                "ность",
                "итость",
                "вшесть",
                "ытость",
                "тость",
                "с",
                "нятость",
                "ивость",
                "утость",
                "нутость",
                "жность",
                "тность",
                "ство",
                "атость",
                "льность",
                "нятность",
                "р",
                "рность",
                "ъятость",
                "сность",
                "иность",
                "инность",
                "янность",
                "яность",
                "в",
                "щесть",
                "гость",
                "ние",
                "овость",
                "д",
                "чие",
                "чность",
                "ца",
                "ло",
                "тие",
                "г",
                "ок",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ок",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ок)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "г",
                    вид_окончания: Вид_Окончания::Г_сущ,
                    re_выдер: Regex::new(r"(?i)(г)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янность",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яность",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инность",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иность",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сность",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чие",
                    вид_окончания: Вид_Окончания::Чи,
                    re_выдер: Regex::new(r"(?i)(чие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тие",
                    вид_окончания: Вид_Окончания::Ти,
                    re_выдер: Regex::new(r"(?i)(тие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ца",
                    вид_окончания: Вид_Окончания::Ц_сущ,
                    re_выдер: Regex::new(r"(?i)(ца)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ло",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(ло)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "д",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(д)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чность",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овость",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гость",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ние",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ние)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щесть",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щесть)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятость",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рность",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "в",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(в)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "р",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(р)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льность",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атость",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ство",
                    вид_окончания: Вид_Окончания::Ств,
                    re_выдер: Regex::new(r"(?i)(ство)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тность",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жность",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пность",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утость",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутость",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельность",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятость",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятность",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кость",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивость",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данность",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даность",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емость",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емость)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итость",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшесть",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшесть)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытость",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венность",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венность)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "с",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(с)$").unwrap(),
                    особенности_образца:
                        Особенности_образца_Торжка {
                            может_быть_в_нескольких_разделах: true,
                            ..Default::default()
                        },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённость",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённость)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёность",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тость",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ность",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ность",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванностью
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::_Ш,
                Text_Changer::Вид_Окончания::Ам,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностью",
                "ваностью",
                "данностью",
                "даностью",
                "льностью",
                "ельностью",
                //"венностью",
                "енностью",
                "еностью",
                "сенностью",
                "сеностью",
                "сённостью",
                "сёностью",
                "емостью",
                "ённостью",
                "ёностью",
                "онностью",
                "оностью",
                "анностью",
                "аностью",
                "ностью",
                "итостью",
                "вшестью",
                "ытостью",
                "тостью",
                "сом",
                "утостью",
                "нутостью",
                "костью",
                "нятостью",
                "нятностью",
                "ивостью",
                "чностью",
                "пностью",
                "жностью",
                "тностью",
                "атостью",
                "ром",
                "янностью",
                "яностью",
                "рностью",
                "ъятостью",
                "сностью",
                "иностью",
                "инностью",
                "гостью",
                "лом",
                "нием",
                "вом",
                "щестью",
                "цей",
                "дом",
                "овостью",
                "ком",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ком",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ком)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "цей",
                    вид_окончания: Вид_Окончания::Ц_сущ,
                    re_выдер: Regex::new(r"(?i)(цей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инностью",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иностью",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сностью",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гостью",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дом",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(дом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "лом",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятостью",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "овостью",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рностью",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яностью",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янностью",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ром",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(ром)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льностью",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атостью",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нием",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(нием)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вом",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(вом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чностью",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тностью",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жностью",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пностью",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утостью",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутостью",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивостью",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятностью",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятостью",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "костью",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сом",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сом)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенностью",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеностью",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённостью",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёностью",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельностью",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щестью",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щестью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данностью",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даностью",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емостью",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итостью",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшестью",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостью",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностью",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностью)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёностью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ностью",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностью",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванности
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ам,
                Text_Changer::Вид_Окончания::_Ш,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Ов,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваности",
                "ванности",
                "льности",
                "даности",
                "данности",
                "кости",
                "сености",
                "сенности",
                "сёности",
                "сённости",
                "емости",
                //"венности",
                "енности",
                "ённости",
                "онности",
                "анности",
                "ности",
                "итости",
                "вшести",
                "ытости",
                "тости",
                "ельности",
                "нятости",
                "нятности",
                "ивости",
                "чности",
                "сти",
                "пности",
                "жности",
                "тности",
                "утости",
                "нутости",
                "атости",
                "ра",
                "цы",
                "да",
                "рности",
                "ъятости",
                "сности",
                "иности",
                "инности",
                "ния",
                "ства",
                "ла",
                "яности",
                "янности",
                "чия",
                "щести",
                "са",
                "гости",
                "ва",
                "тия",
                "га",
                "ка",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ка",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ка)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "га",
                    вид_окончания: Вид_Окончания::Г_сущ,
                    re_выдер: Regex::new(r"(?i)(га)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янности",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яности",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инности",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гости",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иности",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сности",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ва",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тия",
                    вид_окончания: Вид_Окончания::Ти,
                    re_выдер: Regex::new(r"(?i)(тия)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "са",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(са)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щести",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щести)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ла",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(ла)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чия",
                    вид_окончания: Вид_Окончания::Чи,
                    re_выдер: Regex::new(r"(?i)(чия)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятости",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рности",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ства",
                    вид_окончания: Вид_Окончания::Ств,
                    re_выдер: Regex::new(r"(?i)(ства)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "да",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(да)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "цы",
                    вид_окончания: Вид_Окончания::Ц_сущ,
                    re_выдер: Regex::new(r"(?i)(цы)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ния",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ния)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ра",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(ра)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льности",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атости",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутости",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утости",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чности",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельности",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "кости",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сености",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сености)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенности",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёности",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённости",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённости)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятности",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятости",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивости",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тности",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жности",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пности",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даности",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данности",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емости",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онности",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анности",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итости",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшести",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшести)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытости",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венности",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венности)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енности",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённости",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённости)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тости",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ности",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ности",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "сти",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(сти)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностей
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::_Ш,
                Text_Changer::Вид_Окончания::Ц_сущ,
                Text_Changer::Вид_Окончания::Ам,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льностей",
                "ванностей",
                "ваностей",
                "данностей",
                "даностей",
                //"венностей",
                "енностей",
                "еностей",
                "сенностей",
                "сеностей",
                "сённостей",
                "сёностей",
                "емостей",
                "ённостей",
                "ёностей",
                "онностей",
                "оностей",
                "анностей",
                "аностей",
                "ностей",
                "итостей",
                "вшестей",
                "ытостей",
                "тостей",
                "костей",
                "ельностей",
                "нятостей",
                "ивостей",
                "стей",
                "чностей",
                "нятностей",
                "пностей",
                "жностей",
                "тностей",
                "утостей",
                "нутостей",
                "атостей",
                "сов",
                "ров",
                "янностей",
                "яностей",
                "рностей",
                "ъятостей",
                "сностей",
                "иностей",
                "инностей",
                "вов",
                "ний",
                "дов",
                "гостей",
                "чий",
                "л",
                "тий",
                "гов",
                "ков",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ков",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ков)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гов",
                    вид_окончания: Вид_Окончания::Г_сущ,
                    re_выдер: Regex::new(r"(?i)(гов)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инностей",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иностей",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сностей",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятостей",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дов",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(дов)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тий",
                    вид_окончания: Вид_Окончания::Ти,
                    re_выдер: Regex::new(r"(?i)(тий)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чий",
                    вид_окончания: Вид_Окончания::Чи,
                    re_выдер: Regex::new(r"(?i)(чий)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гостей",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "л",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(л)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рностей",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янностей",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яностей",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ний",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ний)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вов",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(вов)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ров",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(ров)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сов",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сов)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льностей",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атостей",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутостей",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утостей",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тностей",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жностей",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чностей",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельностей",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "костей",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятостей",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятностей",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивостей",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пностей",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данностей",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даностей",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеностей",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенностей",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёностей",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённостей",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емостей",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итостей",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшестей",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостей",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностей",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностей)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёностей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ностей",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностей",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "стей",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностям
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::_Ш,
                // Text_Changer::Вид_Окончания::Ам,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льностям",
                "ванностям",
                "ваностям",
                "данностям",
                "даностям",
                //"венностям",
                "енностям",
                "еностям",
                "ельностям",
                "сенностям",
                "сеностям",
                "сённостям",
                "сёностям",
                "емостям",
                "ённостям",
                "ёностям",
                "онностям",
                "оностям",
                "анностям",
                "аностям",
                "ностям",
                "итостям",
                "вшестям",
                "ытостям",
                "тостям",
                "сам",
                "нятостям",
                "костям",
                "ивостям",
                "чностям",
                "пностям",
                "жностям",
                "тностям",
                "утостям",
                "нутостям",
                "атостям",
                "нятностям",
                //"ам",
                "ям",
                "рам",
                "цам",
                "тиям",
                "рностям",
                "ъятостям",
                "сностям",
                "иностям",
                "инностям",
                "вам",
                "гостям",
                "дам",
                "яностям",
                "янностям",
                "щестям",
                "ствам",
                "лам",
                "ниям",
                "востям",
                "гам",
                "кам",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "кам",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(кам)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гам",
                    вид_окончания: Вид_Окончания::Г_сущ,
                    re_выдер: Regex::new(r"(?i)(гам)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янностям",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яностям",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инностям",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иностям",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сностям",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "востям",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(востям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ниям",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ниям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ствам",
                    вид_окончания: Вид_Окончания::Ств,
                    re_выдер: Regex::new(r"(?i)(ствам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятостям",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "лам",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щестям",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щестям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рностям",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дам",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(дам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гостям",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тиям",
                    вид_окончания: Вид_Окончания::Ти,
                    re_выдер: Regex::new(r"(?i)(тиям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "цам",
                    вид_окончания: Вид_Окончания::Ц_сущ,
                    re_выдер: Regex::new(r"(?i)(цам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вам",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(вам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рам",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(рам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ам",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(ам)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                //
                Вид_Окончания_со_строкой {
                    строка: "ям",
                    вид_окончания: Вид_Окончания::Ям,
                    re_выдер: Regex::new(r"(?i)(ям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льностям",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атостям",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутостям",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утостям",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тностям",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жностям",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пностям",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чностям",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельностям",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "костям",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сам",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сам)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятностям",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятостям",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивостям",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данностям",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даностям",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емостям",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итостям",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшестям",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостям",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенностям",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеностям",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённостям",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёностям",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностям",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностям)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёностям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ностям",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностям",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
            ],
        },
        //ванностями
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::_Ш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льностями",
                "ванностями",
                "ваностями",
                "данностями",
                "даностями",
                "ельностями",
                "енностями",
                "еностями",
                "сенностями",
                "сеностями",
                "сённостями",
                "сёностями",
                //"венностями",
                "емостями",
                "ённостями",
                "ёностями",
                "онностями",
                "оностями",
                "анностями",
                "аностями",
                "ностями",
                "итостями",
                "вшестями",
                "ытостями",
                "тостями",
                "костями",
                "нятостями",
                "ивостями",
                "ями",
                "цами",
                "чностями",
                "пностями",
                "жностями",
                "тностями",
                "утостями",
                "нутостями",
                "атостями",
                "нятностями",
                "сами",
                "рами",
                "рностями",
                "сностями",
                "щестями",
                "иностями",
                "инностями",
                "вами",
                "ниями",
                "гостями",
                "дами",
                "ъятостями",
                "яностями",
                "янностями",
                "ствами",
                "лами",
                //"ами",
                "тиями",
                "гами",
                "ками",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ками",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ками)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гами",
                    вид_окончания: Вид_Окончания::Г_сущ,
                    re_выдер: Regex::new(r"(?i)(гами)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янностями",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яностями",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инностями",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иностями",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "щестями",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щестями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ами",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(ами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "тиями",
                    вид_окончания: Вид_Окончания::Ти,
                    re_выдер: Regex::new(r"(?i)(тиями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дами",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(дами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятостями",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ствами",
                    вид_окончания: Вид_Окончания::Ств,
                    re_выдер: Regex::new(r"(?i)(ствами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сностями",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рностями",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "лами",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гостями",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ниями",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ниями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рами",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(рами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сами",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льностями",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атостями",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутостями",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утостями",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тностями",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жностями",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пностями",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чностями",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "цами",
                    вид_окончания: Вид_Окончания::Ц_сущ,
                    re_выдер: Regex::new(r"(?i)(цами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельностями",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "костями",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятностями",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятостями",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивостями",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данностями",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даностями",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сенностями",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сеностями",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённостями",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёностями",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вами",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(вами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емостями",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "онностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итостями",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшестями",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостями",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностями",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностями)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "енностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёностями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ностями",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностями",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "ями",
                    вид_окончания: Вид_Окончания::Ям,
                    re_выдер: Regex::new(r"(?i)(ями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностях
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ям,
                //Text_Changer::Вид_Окончания::Ст,
                Text_Changer::Вид_Окончания::Ом,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::_Ш,
                Text_Changer::Вид_Окончания::_Щ,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "льностях",
                "ванностях",
                "ваностях",
                "данностях",
                "даностях",
                //"венностях",
                "ельностях",
                "енностях",
                "еностях",
                "емостях",
                "ённостях",
                "ёностях",
                "онностях",
                "оностях",
                "анностях",
                "аностях",
                "ностях",
                "стях",
                "итостях",
                "вшестях",
                "ытостях",
                "тостях",
                "сах",
                "рах",
                "костях",
                "нятостях",
                "нятностях",
                "ивостях",
                "чностях",
                "пностях",
                "жностях",
                "тностях",
                "утостях",
                "нутостях",
                "атостях",
                "ствах",
                "янностях",
                "яностях",
                "рностях",
                "сённостях",
                "сёностях",
                "сностях",
                "иностях",
                "инностях",
                "вах",
                "гостях",
                "дах",
                "цах",
                "ъятостях",
                "лах",
                "ниях",
                "гах",
                "ках",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ках",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ках)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гах",
                    вид_окончания: Вид_Окончания::Г_сущ,
                    re_выдер: Regex::new(r"(?i)(гах)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "инностях",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(инностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "иностях",
                    вид_окончания: Вид_Окончания::Ин,
                    re_выдер: Regex::new(r"(?i)(иностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "гостях",
                    вид_окончания: Вид_Окончания::Г_полн,
                    re_выдер: Regex::new(r"(?i)(гостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "дах",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(дах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ниях",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ниях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сностях",
                    вид_окончания: Вид_Окончания::Сн_длинное,
                    re_выдер: Regex::new(r"(?i)(сностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сённостях",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сёностях",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "лах",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рностях",
                    вид_окончания: Вид_Окончания::Рен,
                    re_выдер: Regex::new(r"(?i)(рностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "янностях",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "яностях",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "рах",
                    вид_окончания: Вид_Окончания::Р_сущ,
                    re_выдер: Regex::new(r"(?i)(рах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вах",
                    вид_окончания: Вид_Окончания::_В,
                    re_выдер: Regex::new(r"(?i)(вах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ъятостях",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ствах",
                    вид_окончания: Вид_Окончания::Ств,
                    re_выдер: Regex::new(r"(?i)(ствах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "льностях",
                    вид_окончания: Вид_Окончания::Льн,
                    re_выдер: Regex::new(r"(?i)(льностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "цах",
                    вид_окончания: Вид_Окончания::Ц_сущ,
                    re_выдер: Regex::new(r"(?i)(цах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "атостях",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутостях",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утостях",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тностях",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "жностях",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "пностях",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "чностях",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ельностях",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ивостях",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "костях",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятностях",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нятостях",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ванностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ваностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "данностях",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "даностях",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "сах",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "емостях",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностях",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностях)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    строка: "онностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "оностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "анностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "аностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "итостях",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "вшестях",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостях",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "енностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "еностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ёностях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ностях",
                    вид_окончания: Вид_Окончания::Ным_но,
                    re_выдер: Regex::new(r"(?i)(ностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностях",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    строка: "стях",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ам - ям
        /*Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ям", //"венностях",
                "ам", "ем",
            ]),
            первая_очередь: vec![
                //
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ям",
                    вид_окончания: Вид_Окончания::Ям,
                    re_выдер: Regex::new(r"(?i)(ям)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ам",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(ам)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ем",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ем)$").unwrap(),
                    ..Default::default()
                },
           ],
        },*/
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ом", //"венностях",
            ]),
            ряд: vec![
                //
                Вид_Окончания_со_строкой {
                    строка: "ом",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(ом)$").unwrap(),
                    ..Default::default()
                },
            ],
        },
        //р
        /* Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "р", //"венностях",
            ]),
            первая_очередь: vec![Вид_Окончания_со_строкой {
                часть_речи: Вид_части_речи::Не_определено,
                строка: "р",
                вид_окончания: Вид_Окончания::_Р,
                re_выдер: Regex::new(r"(?i)(р)$").unwrap(),
                ..Default::default()
            }],
            вторая_очередь: vec![],
        },*/
        //ся
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ся", //"венностях",
                "утся",
                "нутся",
            ]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ся",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(ся)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "утся",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утся)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "нутся",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутся)$").unwrap(),
                    ..Default::default()
                },
            ],
        },
        //множественные существительные
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["ки", "ды"]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ки",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ки)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ды",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(ды)$").unwrap(),
                    ..Default::default()
                },
            ],
        },
        // существительные - участке
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["ке", "де"]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ке",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ке)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "де",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(де)$").unwrap(),
                    ..Default::default()
                },
            ],
        },
        // существительные - участку
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["ку", "ду"]),
            ряд: vec![
                Вид_Окончания_со_строкой {
                    строка: "ку",
                    вид_окончания: Вид_Окончания::Ок_сущ,
                    re_выдер: Regex::new(r"(?i)(ку)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    строка: "ду",
                    вид_окончания: Вид_Окончания::Д_СУЩ,
                    re_выдер: Regex::new(r"(?i)(ду)$").unwrap(),
                    ..Default::default()
                },
            ],
        },
    ]
});
#[allow(non_camel_case_types)]
pub trait Возможности_торжка {
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_полное_окончание,
        изначальное_окончание: &RE_полное_окончание,
        неруское_слово_исходное: &String,
        слово_замена_исходное: &String,
        образец_окончания_неруского_слова: &str,
        слово_замена_из_ряда: &String,
    ) -> Result<Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>;
    //
    fn найти_окончание_к_слову_замене_с_условием_удвоенных_букв(
        &self,
        образец_окончания_неруского_слова: &str,
        образец_выдера_в_замене: &Вид_Окончания_со_строкой,
        полный_образец_окончания_неруского_слова: &RE_полное_окончание,
        неруское_слово_исходное: &String,
        слово_замена_из_ряда: &String,
        слово_замена_исходное: &String,
    ) -> Result<Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>;
    //
}
impl Возможности_торжка for [Раздел_Торжка] {
    /*fn проверить_на_соблюдение_правил(&self) -> Result<(), ()> {
        //прогон
        for раздел in self.iter() {}
    }*/
    //
    fn найти_окончание_к_слову_замене_с_условием_удвоенных_букв(
        &self,
        образец_окончания_неруского_слова: &str,
        образец_выдера_в_замене: &Вид_Окончания_со_строкой,
        полный_образец_окончания_неруского_слова: &RE_полное_окончание,
        неруское_слово_исходное: &String,
        слово_замена_из_ряда: &String,
        слово_замена_исходное: &String,
    ) -> Result<Вид_Окончания_со_строкой, Вид_ошибки_при_поиске_выдера_в_торжке> {
        use Text_Changer::Ошибка_в_торжке_исключение;
        //let условие_вывода
        //
        let mut найден_ли_образец: bool = false;
        let mut сам_образец: Вид_Окончания_со_строкой = Default::default();
        /*println!(
            "образец_окончания_неруского_слова |{}| образец_выдера_в_замене вид_окончания |{}|",
            образец_окончания_неруского_слова, образец_выдера_в_замене.вид_окончания
        );*/
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(образец_окончания_неруского_слова)
            {
                //если исключение
                if раздел
                    .окончания_исключения
                    .contains(&образец_выдера_в_замене.вид_окончания)
                {
                    //есть исключение - - возврат
                    return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Исключение(
                        Ошибка_в_торжке_исключение {
                            изначальный_выдер_неруси:образец_окончания_неруского_слова.to_string(),
                            вид_окончания:образец_выдера_в_замене.вид_окончания.clone(),
                            образец_окончания_неруского_слова:образец_окончания_неруского_слова.to_string(),
                            неруское_слово_исходное:неруское_слово_исходное.clone(),
                            слово_замена_из_ряда:слово_замена_из_ряда.clone(),
                            слово_замена_исходное:слово_замена_исходное.clone(),
                        }
                        ,));
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for (_указатель_1, ячейка) in раздел.ряд.iter().enumerate()
                {
                    //println!("1 - #|{}| строка ячейки |{}|", указатель_1, ячейка.строка);
                    if ячейка.вид_окончания == образец_выдера_в_замене.вид_окончания
                    {
                        /*println!(
                            "1-ячейка |{}| образец_выдера_в_замене |{}|",
                            ячейка.строка, полный_образец_окончания_неруского_слова.строка
                        );*/
                        найден_ли_образец = true;
                        //проверка на согласные и гласные
                        match Буквы_Слова::допустимость_согласных_и_гласных( &ячейка.правописание,&полный_образец_окончания_неруского_слова.правописание)
                        {

                            true=>  return Ok(ячейка.clone()),
                            false=>
                            //
                            {
                               // println!("Не сошлось ");
                                match ячейка.правописание.единственный_образец_в_разделе {
                                true=>return Ok(ячейка.clone()),
                                false=>сам_образец = ячейка.clone(),
                            }
                            }
                        }
                    }
                }
                //("2 ряд");
                //перебор ячеек в разделе на предмет соответствия вида окончания
                /*for (_указатель_2, ячейка) in раздел.вторая_очередь.iter().enumerate()
                {
                    /*println!(
                        "2 - указатель №2 |{}| строка |{}|",
                        указатель_2, ячейка.строка
                    );*/
                    if ячейка.вид_окончания == образец_выдера_в_замене.вид_окончания
                    {
                        /*println!(
                            "2-ячейка |{}| образец_выдера_в_замене |{}|",
                            ячейка.строка, полный_образец_окончания_неруского_слова.строка
                        );*/
                        найден_ли_образец = true;
                        //проверка на согласные и гласные
                        match Буквы_Слова::допустимость_согласных_и_гласных( &ячейка.правописание,&полный_образец_окончания_неруского_слова.правописание)
                        {

                            true=>  return Ok(ячейка.clone()),
                            false=> match ячейка.правописание.единственный_образец_в_разделе {
                                true=>return Ok(ячейка.clone()),
                                false=>сам_образец = ячейка.clone(),
                            }
                        }
                    }
                }*/
                //
                match найден_ли_образец {
                    true=>return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_образец_по_условиям_гласных_и_согласных(сам_образец.clone(), полный_образец_окончания_неруского_слова.clone())),
                    false=>return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_вид_окончания_в_разделе_торжка_но_есть_в_куче(образец_окончания_неруского_слова.to_string(),образец_выдера_в_замене.вид_окончания.clone())),
                }
            }
        }
        return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_в_кучах(образец_окончания_неруского_слова.to_string()));
    }
    //
    fn найти_окончание_выдера(
        &self,
        образец_re_для_замены: &RE_полное_окончание,
        образец_re_неруси_первичного_слова: &RE_полное_окончание,
        неруское_слово_исходное: &String,
        слово_замена_исходное: &String,
        образец_окончания_неруского_слова: &str,
        слово_замена_из_ряда: &String,
    ) -> Result<Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке> {
        use Text_Changer::{
            Возможноси_частей_речи, Ошибка_в_торжке_исключение,
            Ошибка_несоотвествия_части_речи_Торжок, РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ,
        };

        let часть_речи_слова_замены_из_ряда: &'static [Вид_части_речи] =
            match определено_ли_слову_часть_речи(&слово_замена_из_ряда)
            {
                Ok(успех) => успех,
                Err(_) => образец_re_для_замены.части_речи,
            };
        //
        let mut найден_в_куче_окончаний: bool = false;
        /*let mut вид_окончания_где_нашлось: Text_Changer::Вид_Окончания =
        Text_Changer::Вид_Окончания::Не_определено;*/
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&образец_re_неруси_первичного_слова.строка)
            {
                //на исключение проверяем
                if раздел
                    .окончания_исключения
                    .contains(&образец_re_для_замены.вид_окончания)
                {
                    return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Исключение(
                        Ошибка_в_торжке_исключение {
                            изначальный_выдер_неруси: образец_окончания_неруского_слова.to_string(),
                            слово_замена_исходное:слово_замена_исходное.clone(),
                            вид_окончания:образец_re_для_замены.вид_окончания.clone(),
                            слово_замена_из_ряда:слово_замена_из_ряда.clone(),
                            неруское_слово_исходное:неруское_слово_исходное.clone(),
                             образец_окончания_неруского_слова:образец_re_неруси_первичного_слова.строка.to_string(),
                        }
                       ));
                }
                //
                найден_в_куче_окончаний = true;
                //если несколько видов окончаний одного вида в разделе
                let количество_окончаний_в_разделе_данного_вида_окончания: usize = раздел
                    .много_ли_окончаний_в_разделе(
                        &образец_re_для_замены.вид_окончания,
                    );
                let mut текущий_счётчик_множества_окончаний_в_разделе: usize = 1;
                //перебор ячеек в разделе на предмет соответствия вида окончания
                'круговорот_первой_очереди: for (_, ячейка) in
                    раздел.ряд.iter().enumerate()
                {
                    if ячейка.вид_окончания == образец_re_для_замены.вид_окончания
                    {
                        //
                        let часть_речи_с_торжка = РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ
                            .определить_вид_части_речи_по_ячейке_торжка(
                                &ячейка,
                            )
                            .unwrap();
                        //
                        //

                        //проверка что несколько может быть окончаний
                        return match Возможноси_частей_речи::допустима_ли_покупка(часть_речи_слова_замены_из_ряда, часть_речи_с_торжка) {
                            true=> Ok(ячейка.clone()),
                            //
                            false=>
                                    //много образцов окончания может быть в разделе
                                    match ячейка.правописание.множество_образцов_в_разделе {
                                        //
                                        false=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                Ошибка_несоотвествия_части_речи_Торжок {
                                    выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                    выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                    часть_речи_торжка:&часть_речи_с_торжка,
                                    ячейка_торжка_купленная:ячейка.clone(),
                                    нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                    слово_замена_исходное:слово_замена_исходное.clone(),
                                    окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                }
                            )) ,
                                        //это последний повтор окончания в ряде
                                        true=> match количество_окончаний_в_разделе_данного_вида_окончания==текущий_счётчик_множества_окончаний_в_разделе {
                                            //
                                            true=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                    Ошибка_несоотвествия_части_речи_Торжок {
                                        выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                        выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                        часть_речи_торжка:&часть_речи_с_торжка,
                                        ячейка_торжка_купленная:ячейка.clone(),
                                        нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                        слово_замена_исходное:слово_замена_исходное.clone(),
                                        окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                    }
                                )) ,
                                            //
                                         false=> {текущий_счётчик_множества_окончаний_в_разделе+=1;continue 'круговорот_первой_очереди},
                                         }

                            },
                        };
                    }
                }
                //
                /*'круговорот_второй_очереди: for ячейка in
                    раздел.вторая_очередь.iter()
                {
                    if ячейка.вид_окончания == образец_re_для_замены.вид_окончания
                    {
                        //
                        let часть_речи_с_торжка = РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ
                            .определить_вид_части_речи_по_ячейке_торжка(
                                &ячейка,
                            )
                            .unwrap();
                        //
                        //проверка что несколько может быть окончаний
                        return match Возможноси_частей_речи::допустима_ли_покупка(часть_речи_слова_замены_из_ряда, часть_речи_с_торжка) {
                            true=> Ok(ячейка.clone()),
                            //
                            false=>
                            //много образцов окончания может быть в разделе
                                    match ячейка.правописание.множество_образцов_в_разделе {
                                        //
                                        false=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                Ошибка_несоотвествия_части_речи_Торжок {
                                    выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                    выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                    часть_речи_торжка:&часть_речи_с_торжка,
                                    ячейка_торжка_купленная:ячейка.clone(),
                                    нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                    слово_замена_исходное:слово_замена_исходное.clone(),
                                    окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                }
                            )) ,
                                          //это последний повтор окончания в ряде
                                        true=> match количество_окончаний_в_разделе_данного_вида_окончания==текущий_счётчик_множества_окончаний_в_разделе {
                                            //
                                            true=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                    Ошибка_несоотвествия_части_речи_Торжок {
                                        выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                        выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                        часть_речи_торжка:&часть_речи_с_торжка,
                                        ячейка_торжка_купленная:ячейка.clone(),
                                        нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                        слово_замена_исходное:слово_замена_исходное.clone(),
                                        окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                    }
                                )) ,
                                            //
                                         false=> {текущий_счётчик_множества_окончаний_в_разделе+=1;continue 'круговорот_второй_очереди},
                                         }

                            },
                        };
                    }
                }*/
            }
            //
        }
        //
        return match найден_в_куче_окончаний{
            //найден в куче
            true=> {
                //
                Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_вид_окончания_в_разделе_торжка_но_есть_в_куче(образец_re_неруси_первичного_слова.строка.to_string(),образец_re_для_замены.вид_окончания)) },
            //не найден
            false=> Err( Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_в_кучах(образец_re_неруси_первичного_слова.строка.to_string()))
        };
    }
}

// счётчик_входа.fetch_add(1, Ordering::Relaxed);

/*pub fn проверка_конечных_окончаний_re_образцов() {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        проверка_среза_строк_на_неповтор(
            &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
            "КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН",
        );
    }

    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}*/
pub fn проверка_среза_строк_на_неповтор(
    срез: &[&'static str],
    имя_кучи: &str,
) {
    let mut куча: rapidhash::fast::RapidHashSet<&str> = rapidhash::fast::RapidHashSet::default();
    //сама проверка
    for ячейка in срез.iter() {
        if !куча.contains(ячейка) {
            куча.insert(ячейка);
        } else {
            println!("Куча |{}| повторно содержит образец |{}|", имя_кучи, ячейка)
        }
    }
}
//
pub static МЕСТОИМЕНИЯ: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // --- Личные (я, ты, мы, вы) ---
        "я",
        "меня",
        "мне",
        "мной",
        "мною",
        "обо мне",
        "ты",
        "тебя",
        "тебе",
        "тобой",
        "тобою",
        "о тебе",
        "мы",
        "нас",
        "нам",
        "нами",
        "о нас",
        "вы",
        "вас",
        "вам",
        "вами",
        "о вас",
        // --- Личные 3-го лица (он, она, оно, они) ---
        "он",
        "его",
        "ему",
        "им",
        "нем",
        "о нем",
        "она",
        "ее",
        "ей",
        "ею",
        "ней",
        "о ней",
        "оно",
        "его",
        "ему",
        "им",
        "нем",
        "о нем",
        "они",
        "их",
        "им",
        "ими",
        "них",
        "о них",
        // --- Возвратное (себя) ---
        "себя",
        "себе",
        "собой",
        "собою",
        "о себе",
    ])
});
//
pub static ДОПЫ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> =
    LazyLock::new(|| RapidHashSet::from_iter(["не"]));
//
pub static НАРЕЧИЯ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // Возвратное (по-своему)
        "по-своему",
        // Личные (по-моему, по-твоему и т.д.)
        "по-моему",
        "по-твоему",
        "по-нашему",
        "по-вашему",
        // Местоимённые указательные
        "там",
        "тут",
        "сюда",
        "туда",
        "оттуда",
        "отсюда",
        "здесь",
        "так",
        "тогда",
        "потому",
        "поэтому",
        "затем",
        // Местоимённые определительные
        "всегда",
        "везде",
        "всюду",
        "повсюду",
        "по-иному",
        "по-всякому",
        "высоко",
        "низко",
        // Вопросительно-относительные
        "как",
        "где",
        "куда",
        "откуда",
        "когда",
        "почему",
        "зачем",
        "отчего",
        // Неопределённые
        "как-то",
        "как-нибудь",
        "кое-как",
        "где-то",
        "где-либо",
        "где-нибудь",
        "кое-где",
        "когда-то",
        "когда-нибудь",
        "когда-либо",
        "зачем-то",
        "почему-то",
        // Отрицательные
        "никак",
        "нигде",
        "негде",
        "ниоткуда",
        "неоткуда",
        "никуда",
        "некуда",
        "никогда",
        "некогда",
        "незачем",
        // Определительные: качественные
        "быстро",
        "медленно",
        "весело",
        "громко",
        "хорошо",
        "дружно",
        "внимательно",
        "грубо",
        "молча",
        "правильно",
        "страшно",
        "чудовищно",
        "ярко",
        "смело",
        "горько",
        // Определительные: количественные
        "много",
        "мало",
        "приблизительно",
        "почти",
        "дважды",
        "вдвое",
        "втрое",
        "чуть-чуть",
        "очень",
        "весьма",
        "гораздо",
        "совершенно",
        "вдоволь",
        "дотла",
        "досыта",
        "крайне",
        "чрезмерно",
        "трижды",
        "вшестером",
        "пополам",
        "втройне",
        // Определительные: образа и способа действия
        "вручную",
        "вполголоса",
        "наизнанку",
        "шагом",
        "вплотную",
        "назубок",
        "искоса",
        "ощупью",
        "вдребезги",
        "кувырком",
        "крест-накрест",
        "басом",
        "вразвалку",
        "вплавь",
        "бегом",
        "верхом",
        "пешком",
        "плашмя",
        "вброд",
        "вприпрыжку",
        // Сравнительно-уподобительные
        "по-весеннему",
        "по-летнему",
        "по-осеннему",
        "по-зимнему",
        "по-детски",
        "по-дружески",
        "по-лисьи",
        "по-медвежьи",
        "по-отцовски",
        "по-матерински",
        "по-братски",
        // Совместности
        "вдвоём",
        "втроём",
        "впятером",
        "по двое",
        "по трое",
        "поочерёдно",
        // Обстоятельственные: места
        "далеко",
        "близко",
        "вблизи",
        "вдали",
        "вдалеке",
        "вдаль",
        "назад",
        "вперёд",
        "впереди",
        "позади",
        "сзади",
        "спереди",
        "слева",
        "справа",
        "налево",
        "направо",
        "вверху",
        "внизу",
        "наверху",
        "вниз",
        "вверх",
        "вбок",
        "набок",
        "вокруг",
        "рядом",
        "около",
        "возле",
        "издали",
        "издалека",
        "отовсюду",
        "оттуда",
        "изнутри",
        "снаружи",
        "поверх",
        "вглубь",
        "вширь",
        "навстречу",
        "посередине",
        "посреди",
        "вдалеке",
        "поблизости",
        "дома",
        "до́ма",
        // Обстоятельственные: времени
        "вчера",
        "сегодня",
        "завтра",
        "утром",
        "днём",
        "вечером",
        "ночью",
        "весной",
        "летом",
        "осенью",
        "зимой",
        "сейчас",
        "теперь",
        "тогда",
        "давно",
        "недавно",
        "издавна",
        "смолоду",
        "раньше",
        "прежде",
        "сперва",
        "сначала",
        "затем",
        "потом",
        "вовремя",
        "иногда",
        "всегда",
        "никогда",
        "допоздна",
        "затемно",
        "досветла",
        "долго",
        "недолго",
        "подолгу",
        "тотчас",
        "сразу",
        "наконец",
        "вскоре",
        "нескоро",
        "засветло",
        "на днях",
        "поутру",
        "вечор",
        "нонече",
        // Обстоятельственные: причины
        "сгоряча",
        "сдуру",
        "спьяну",
        "сослепу",
        "поневоле",
        "недаром",
        "почему",
        "потому",
        "оттого",
        "отчего",
        "волей-неволей",
        "неспроста",
        "спросонья",
        "со зла",
        "сослепу",
        // Обстоятельственные: цели
        "нарочно",
        "специально",
        "назло",
        "наперекор",
        "в шутку",
        "умышленно",
        "неумышленно",
        "в насмешку",
        "насмех",
        "невзначай",
        "напоказ",
        "зря",
        "бесцельно",
        "безрезультатно",
        // Производные от деепричастий
        "лёжа",
        "сидя",
        "стоя",
        "молча",
        "шутя",
        "нехотя",
        // Производные от наречий (с суффиксами)
        "рановато",
        "поздновато",
        "сыровато",
        "хорошенечко",
        "ранёхонько",
        "тихонько",
        "давненько",
        "поближе",
        "покрепче",
        "поменьше",
        "давным-давно",
        "полным-полно",
        // Непроизводные
        "вдруг",
        "еле-еле",
        "едва",
        "прежде",
        "весьма",
    ])
});

//
pub static ПРЕДЛОГИ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // Непроизводные (первообразные) — ~25 единиц
        "без",
        "безо",
        "близ",
        "в",
        "во",
        "вне",
        "вопреки",
        "для",
        "до",
        "за",
        "из",
        "изо",
        "из-за",
        "из-под",
        "к",
        "ко",
        "кроме",
        "меж",
        "между",
        "на",
        "над",
        "надо",
        "о",
        "об",
        "обо",
        "от",
        "ото",
        "по",
        "под",
        "подо",
        "при",
        "про",
        "ради",
        "с",
        "со",
        "среди",
        "у",
        "через",
        "чрез",
        // Производные от наречий — наречные
        "вблизи",
        "вглубь",
        "вдоль",
        "взамен",
        "вместо",
        "внутри",
        "внутрь",
        "возле",
        "вокруг",
        "впереди",
        "навстречу",
        "напротив",
        "насквозь",
        "около",
        "поверх",
        "позади",
        "помимо",
        "поперёк",
        "после",
        "посреди",
        "посредине",
        "против",
        "сверх",
        "свыше",
        "сзади",
        "сквозь",
        "снизу",
        "согласно",
        "сообразно",
        "соответственно",
        "соразмерно",
        "спереди",
        "сродни",
        // Производные от существительных — отымённые
        "ввиду",
        "в виде",
        "в зависимости от",
        "в качестве",
        "в лице",
        "в отличие от",
        "в отношении",
        "в преддверии",
        "в продолжение",
        "в роли",
        "в силу",
        "в течение",
        "в целях",
        "вследствие",
        "за вычетом",
        "за исключением",
        "за счёт",
        "наподобие",
        "насчёт",
        "по мере",
        "по поводу",
        "по причине",
        "по случаю",
        "под видом",
        "посредством",
        "путём",
        "с помощью",
        "с точки зрения",
        // Производные от глаголов — отглагольные
        "благодаря",
        "включая",
        "исключая",
        "начиная с",
        "не считая",
        "несмотря на",
        "невзирая на",
        "спустя",
    ])
});
