use Text_Changer::{Вид_Окончания, *};
//use console::style;
//use gpui_kit::component::text::Text;
use rapidhash::RapidHashSet;
//use rayon::prelude::*;
use regex::Regex;
use std::sync::LazyLock;
//use std::sync::atomic::{AtomicBool, Ordering};

/*pub static ИСКЛЮЧЕНИЯ_ПОИСКА_ВЫДЕРА: LazyLock<Исключения_поиска_выдера> =
LazyLock::new(|| Исключения_поиска_выдера {
    ван: vec![Исключение_поиска_выдера {
        вид_окончания: Text_Changer::Вид_Окончания::Ван,
        куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["вано"]),
        куча_обрезков_слов: rapidhash::fast::RapidHashSet::from_iter(["нир"]),
    }],
});*/
//

//

/*pub struct Regex_с_заменой {
    поиск: Regex,
    замена: Regex,
}*/
/*
pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание;63],
> = LazyLock::new(|| {
    [

//под конец уже идут исключения
//
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ш$").unwrap(),
          окончание_строка: "ш",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ша$").unwrap(),
          окончание_строка: "ша",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шая$").unwrap(),
          окончание_строка: "шая",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шую$").unwrap(),
          окончание_строка: "шую",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ше$").unwrap(),
          окончание_строка: "ше",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ши$").unwrap(),
          окончание_строка: "ши",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шем$").unwrap(),
          окончание_строка: "шем",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шею$").unwrap(),
          окончание_строка: "шею",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шему$").unwrap(),
          окончание_строка: "шему",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шего$").unwrap(),
          окончание_строка: "шего",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шее$").unwrap(),
          окончание_строка: "шее",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шей$").unwrap(),
          окончание_строка: "шей",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шесть$").unwrap(),
          окончание_строка: "шесть",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестью$").unwrap(),
          окончание_строка: "шестью",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шести$").unwrap(),
          окончание_строка: "шести",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестей$").unwrap(),
          окончание_строка: "шестей",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестям$").unwrap(),
          окончание_строка: "шестям",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестями$").unwrap(),
          окончание_строка: "шестями",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестях$").unwrap(),
          окончание_строка: "шестях",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шим$").unwrap(),
          окончание_строка: "шим",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шими$").unwrap(),
          окончание_строка: "шими",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ший$").unwrap(),
          окончание_строка: "ший",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шие$").unwrap(),
          окончание_строка: "шие",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ших$").unwrap(),
          окончание_строка: "ших",
          вид_окончания: Вид_Окончания::_Ш,
      },
      //-------------

//------------------то
/*RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)та$").unwrap(),
    окончание_строка: "та",
    вид_окончания: Вид_Окончания::То,
},
/*RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)т$").unwrap(),
    окончание_строка: "т",
    вид_окончания: Вид_Окончания::То,
},*/
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тая$").unwrap(),
    окончание_строка: "тая",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тую$").unwrap(),
    окончание_строка: "тую",
    вид_окончания: Вид_Окончания::То,
},*/
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
/*RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ты$").unwrap(),
    окончание_строка: "ты",
    вид_окончания: Вид_Окончания::Ты,
},*/
//
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)том$").unwrap(),
    окончание_строка: "том",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тому$").unwrap(),
    окончание_строка: "тому",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)то$").unwrap(),
    окончание_строка: "то",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)того$").unwrap(),
    окончание_строка: "того",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)той$").unwrap(),
    окончание_строка: "той",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тость$").unwrap(),
    окончание_строка: "тость",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостью$").unwrap(),
    окончание_строка: "тостью",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тости$").unwrap(),
    окончание_строка: "тости",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостей$").unwrap(),
    окончание_строка: "тостей",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостям$").unwrap(),
    окончание_строка: "тостям",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостями$").unwrap(),
    окончание_строка: "тостями",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостях$").unwrap(),
    окончание_строка: "тостях",
    вид_окончания: Вид_Окончания::То,
},
//ыт
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыт$").unwrap(),
   окончание_строка: "ыт",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыта$").unwrap(),
   окончание_строка: "ыта",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытая$").unwrap(),
   окончание_строка: "ытая",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытую$").unwrap(),
   окончание_строка: "ытую",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыто$").unwrap(),
   окончание_строка: "ыто",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытое$").unwrap(),
   окончание_строка: "ытое",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытом$").unwrap(),
   окончание_строка: "ытом",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытому$").unwrap(),
   окончание_строка: "ытому",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытой$").unwrap(),
   окончание_строка: "ытой",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытого$").unwrap(),
   окончание_строка: "ытого",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытость$").unwrap(),
   окончание_строка: "ытость",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостью$").unwrap(),
   окончание_строка: "ытостью",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытости$").unwrap(),
   окончание_строка: "ытости",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостей$").unwrap(),
   окончание_строка: "ытостей",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостям$").unwrap(),
   окончание_строка: "ытостям",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостями$").unwrap(),
   окончание_строка: "ытостями",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостях$").unwrap(),
   окончание_строка: "ытостях",
   вид_окончания: Вид_Окончания::Ыт,
},
 RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ыты$").unwrap(),
    окончание_строка: "ыты",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытые$").unwrap(),
   окончание_строка: "ытые",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытым$").unwrap(),
   окончание_строка: "ытым",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытыми$").unwrap(),
   окончание_строка: "ытыми",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытых$").unwrap(),
   окончание_строка: "ытых",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ытый$").unwrap(),
    окончание_строка: "ытый",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ытые$").unwrap(),
    окончание_строка: "ытые",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ытее$").unwrap(),
    окончание_строка: "ытее",
    вид_окончания: Вид_Окончания::_Ы,
},
]
});*/
//
/*pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание; 306],
> = LazyLock::new(|| {
    [
    //----------------В
    //ем
           //----------------
         RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)в$").unwrap(),
               окончание_строка: "в",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)ве$").unwrap(),
               окончание_строка: "ве",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)ва$").unwrap(),
               окончание_строка: "ва",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вая$").unwrap(),
               окончание_строка: "вая",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вую$").unwrap(),
               окончание_строка: "вую",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)во$").unwrap(),
               окончание_строка: "во",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вы$").unwrap(),
               окончание_строка: "вы",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вом$").unwrap(),
               окончание_строка: "вом",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вому$").unwrap(),
               окончание_строка: "вому",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)во$").unwrap(),
               окончание_строка: "во",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вого$").unwrap(),
               окончание_строка: "вого",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вое$").unwrap(),
               окончание_строка: "вое",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вой$").unwrap(),
               окончание_строка: "вой",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вость$").unwrap(),
               окончание_строка: "вость",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востью$").unwrap(),
               окончание_строка: "востью",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вости$").unwrap(),
               окончание_строка: "вости",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востей$").unwrap(),
               окончание_строка: "востей",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востям$").unwrap(),
               окончание_строка: "востям",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востями$").unwrap(),
               окончание_строка: "востями",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востях$").unwrap(),
               окончание_строка: "востях",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вым$").unwrap(),
               окончание_строка: "вым",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)выми$").unwrap(),
               окончание_строка: "выми",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вый$").unwrap(),
               окончание_строка: "вый",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вые$").unwrap(),
               окончание_строка: "вые",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вых$").unwrap(),
               окончание_строка: "вых",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вее$").unwrap(),
               окончание_строка: "вее",
               вид_окончания: Вид_Окончания::_В,
           },
           //--------------------
    //---------------Щ
    //
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щ$").unwrap(),
              окончание_строка: "щ",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)ща$").unwrap(),
              окончание_строка: "ща",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щая$").unwrap(),
              окончание_строка: "щая",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щую$").unwrap(),
              окончание_строка: "щую",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)ще$").unwrap(),
              окончание_строка: "ще",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щи$").unwrap(),
              окончание_строка: "щи",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щем$").unwrap(),
              окончание_строка: "щем",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щему$").unwrap(),
              окончание_строка: "щему",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щее$").unwrap(),
              окончание_строка: "щее",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щего$").unwrap(),
              окончание_строка: "щего",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щее$").unwrap(),
              окончание_строка: "щее",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щей$").unwrap(),
              окончание_строка: "щей",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щесть$").unwrap(),
              окончание_строка: "щесть",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестью$").unwrap(),
              окончание_строка: "щестью",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щести$").unwrap(),
              окончание_строка: "щести",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестей$").unwrap(),
              окончание_строка: "щестей",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестям$").unwrap(),
              окончание_строка: "щестям",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестями$").unwrap(),
              окончание_строка: "щестями",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестях$").unwrap(),
              окончание_строка: "щестях",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щим$").unwrap(),
              окончание_строка: "щим",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щими$").unwrap(),
              окончание_строка: "щими",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щий$").unwrap(),
              окончание_строка: "щий",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щие$").unwrap(),
              окончание_строка: "щие",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щих$").unwrap(),
              окончание_строка: "щих",
              вид_окончания: Вид_Окончания::_Щ,
          },
          //-------------

        //----------------Л
        //Л
       /* RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)л$").unwrap(),
            окончание_строка: "л",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лся$").unwrap(),
            окончание_строка: "лся",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ло$").unwrap(),
            окончание_строка: "ло",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лось$").unwrap(),
            окончание_строка: "лось",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ли$").unwrap(),
            окончание_строка: "ли",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лись$").unwrap(),
            окончание_строка: "лись",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лью$").unwrap(),
            окончание_строка: "лью",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лей$").unwrap(),
            окончание_строка: "лей",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ли$").unwrap(),
            окончание_строка: "ли",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лям$").unwrap(),
            окончание_строка: "лям",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лями$").unwrap(),
            окончание_строка: "лями",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лях$").unwrap(),
            окончание_строка: "лях",
            вид_окончания: Вид_Окончания::_Л,
        },*/

        //-------------

        //-------------------------------------ён






        //--------------------

        //
    ]
});*/

//
pub static ПУСТОЙ_РЯД_RE: LazyLock<[Regex; 0]> = LazyLock::new(|| Default::default());
//
/*pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН: LazyLock<[Regex; 42]> = LazyLock::new(|| {
    [
        //ен
        //а
        Regex::new(r"(?i)еная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)енн$").unwrap(),
        Regex::new(r"(?i)енна$").unwrap(),
        Regex::new(r"(?i)енно$").unwrap(),
        Regex::new(r"(?i)енны$").unwrap(),
        //Regex::new(r"(?i)еннее$").unwrap(),
        //ую
        Regex::new(r"(?i)еную$").unwrap(),
        //о
        Regex::new(r"(?i)еное$").unwrap(),
        Regex::new(r"(?i)еного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)еном$").unwrap(),
        Regex::new(r"(?i)еному$").unwrap(),
        Regex::new(r"(?i)еность$").unwrap(),
        Regex::new(r"(?i)еностью$").unwrap(),
        Regex::new(r"(?i)ености$").unwrap(),
        Regex::new(r"(?i)еностей$").unwrap(),
        Regex::new(r"(?i)еностям$").unwrap(),
        Regex::new(r"(?i)еностями$").unwrap(),
        Regex::new(r"(?i)еностях$").unwrap(),
        //ы
        Regex::new(r"(?i)еным$").unwrap(),
        Regex::new(r"(?i)еными$").unwrap(),
        Regex::new(r"(?i)еных$").unwrap(),
        Regex::new(r"(?i)еные$").unwrap(),
        //----------------------------------);
        //ён
        //а
        Regex::new(r"(?i)ёная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)ённ$").unwrap(),
        Regex::new(r"(?i)ённа$").unwrap(),
        Regex::new(r"(?i)ённо$").unwrap(),
        Regex::new(r"(?i)ённы$").unwrap(),
        //ую
        Regex::new(r"(?i)ёную$").unwrap(),
        //о
        Regex::new(r"(?i)ёное$").unwrap(),
        Regex::new(r"(?i)ёного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)ёном$").unwrap(),
        Regex::new(r"(?i)ёному$").unwrap(),
        Regex::new(r"(?i)ёность$").unwrap(),
        Regex::new(r"(?i)ёностью$").unwrap(),
        Regex::new(r"(?i)ёности$").unwrap(),
        Regex::new(r"(?i)ёностей$").unwrap(),
        Regex::new(r"(?i)ёностям$").unwrap(),
        Regex::new(r"(?i)ёностями$").unwrap(),
        Regex::new(r"(?i)ёностях$").unwrap(),
        //ы
        Regex::new(r"(?i)ёным$").unwrap(),
        Regex::new(r"(?i)ёными$").unwrap(),
        Regex::new(r"(?i)ёных$").unwrap(),
        Regex::new(r"(?i)ёные$").unwrap(),
        //----------------------------------);
        //
    ]
});*/
//
/*pub static RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Re_образцы; 23]> = LazyLock::new(|| {
    [
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ван)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ван)$").unwrap(),
                окончание_строка: "ван",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вана)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вана)$").unwrap(),
                окончание_строка: "вана",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вано)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вано)$").unwrap(),
                окончание_строка: "вано",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ваны)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ваны)$").unwrap(),
                окончание_строка: "ваны",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванная)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванная)$").unwrap(),
                окончание_строка: "ванная",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванную)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванную)$").unwrap(),
                окончание_строка: "ванную",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванной)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванной)$").unwrap(),
                окончание_строка: "ванной",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванное)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванное)$").unwrap(),
                окончание_строка: "ванное",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванного)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванного)$").unwrap(),
                окончание_строка: "ванного",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванном)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванном)$").unwrap(),
                окончание_строка: "ванном",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванному)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванному)$").unwrap(),
                окончание_строка: "ванному",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванность)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванность)$").unwrap(),
                окончание_строка: "ванность",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностью)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностью)$").unwrap(),
                окончание_строка: "ванностью",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванности)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванности)$").unwrap(),
                окончание_строка: "ванности",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностей)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностей)$").unwrap(),
                окончание_строка: "ванностей",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностям)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностям)$").unwrap(),
                окончание_строка: "ванностям",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностями)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностями)$").unwrap(),
                окончание_строка: "ванностями",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностях)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностях)$").unwrap(),
                окончание_строка: "ванностях",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванным)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванным)$").unwrap(),
                окончание_строка: "ванным",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванными)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванными)$").unwrap(),
                окончание_строка: "ванными",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванных)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванных)$").unwrap(),
                окончание_строка: "ванных",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванные)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванные)$").unwrap(),
                окончание_строка: "ванные",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванный)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванный)$").unwrap(),
                окончание_строка: "ванный",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
    ]
});*/
//
/*pub const КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН: [&'static str; 24] = [
    "ван",
    "вана",
    "вано",
    "ваны",
    "ваннее",
    //
    "ванная",
    "ванную",
    //о
    "ванной",
    "ванное",
    "ванного",
    //глаголы
    "ванном",
    "ванному",
    //ст
    "ванность",
    "ванностью",
    "ванности",
    "ванностей",
    "ванностям",
    "ванностями",
    "ванностях",
    //ы
    "ванными",
    "ванным",
    "ванных",
    "ванные",
    "ванный",
];*/
//
pub static ТОРЖОК_ОКОНЧАНИЙ: LazyLock<[Раздел_Торжка; 29]> = LazyLock::new(|| {
    [
        //
        Раздел_Торжка {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ван", "ен", "ён", "он", "ан", "ит", "ыт", "н", "в", "ят", "т", "ив", "нят", "ут",
                "нут", "щ", "елен", "рен", "ель", "пен", "жен", "тен", "дан", "ат",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ат",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(ат)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тен",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жен",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пен",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "рен",
                    вид_окончания: Вид_Окончания::_Р,
                    re_выдер: Regex::new(r"(?i)(рен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "елен",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(елен)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "щ",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щ)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "в",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(в)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ив",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ив)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нят",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нят)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "дан",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(дан)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ван",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ван)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ен",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ён",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ён)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "он",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(он)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ит",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ит)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыт",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыт)$").unwrap(),
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,

                    строка: "нут",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нут)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,

                    строка: "ут",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(ут)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,

                    строка: "т",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ан",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ан)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ят",
                    вид_окончания: Вид_Окончания::Ят,
                    re_выдер: Regex::new(r"(?i)(ят)$").unwrap(),
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "т",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)()$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "н",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(н)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ель",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ель)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ко_ка,
                Text_Changer::Вид_Окончания::Ым,
                Text_Changer::Вид_Окончания::Ям,
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::_Ц,
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::_Д,
            ]),
        },
        //вана
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вана",
                "ванна",
                "дана",
                "данна",
                "пна",
                "ена",
                "енна",
                "ема",
                "она",
                "онна",
                "анна",
                "ана",
                "на",
                "ита",
                "ыта",
                "та",
                "ва",
                "сенна",
                "сена",
                "сённа",
                "сёна",
                "ка",
                "нята",
                "ельна",
                "ива",
                "ели",
                "тна",
                "жна",
                "ута",
                "нута",
                "янна",
                "яна",
                "ата",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яна",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янна",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янна)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ута",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(ута)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нута",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нута)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жна",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тна",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пна",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пна)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нята",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нята)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ка",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ка)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ва",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенна",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенна)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сена",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сена)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёна",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённа",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённа)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельна",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ива",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ива)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ата",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(ата)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вана",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вана)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванна",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "дана",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(дана)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данна",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енна",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ема",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ема)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енна",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(енна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "она",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(она)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онна",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ана",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ана)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анна",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анна)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ита",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ита)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыта",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыта)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "та",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "на",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ели",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ели)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Вид_Окончания::Ям,
                Вид_Окончания::Ко_ка,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванее",
                "ваннее",
                "данее",
                "даннее",
                "пнее",
                "енее",
                "еннее",
                "сенее",
                "сеннее",
                "сёнее",
                "сённее",
                "емее",
                "ёнее",
                "ённее",
                "онее",
                "оннее",
                "анее",
                "аннее",
                "нее",
                "итее",
                "ытее",
                "тее",
                //"щее",
                "вшее",
                "шее",
                "стее",
                "лее",
                "нятнее",
                "нятее",
                "ельнее",
                "ивее",
                "тнее",
                "жнее",
                "атее",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атее",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тнее",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жнее",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пнее",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "щее",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятее",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятнее",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельнее",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивее",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данее",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даннее",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванее",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваннее",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенее",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеннее",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёнее",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённее",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енее",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еннее",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёнее",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённее",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емее",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онее",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оннее",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анее",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аннее",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аннее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итее",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытее",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "стее",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "лее",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "шее",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тее",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нее",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(нее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Вид_Окончания::Ям,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вано",
                "ванно",
                "дано",
                "данно",
                "пно",
                "ено",
                "емо",
                "оно",
                "ано",
                "но",
                "ито",
                "ыто",
                "то",
                "уто",
                "нуто",
                "сно",
                "ко",
                "иво",
                "нято",
                "ельно",
                "енно",
                "ено",
                "ённо",
                "ёно",
                "онно",
                "анно",
                "вше",
                "чно",
                "жно",
                "тно",
                "яно",
                "янно",
                "ато",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ато",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(ато)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яно",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янно",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тно",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жно",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пно",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чно",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нуто",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нуто)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "уто",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(уто)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нято",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нято)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "иво",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(иво)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ко",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ко)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельно",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вано",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вано)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "дано",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(дано)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сно",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сно)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емо",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емо)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ито",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ито)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыто",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыто)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данно",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванно",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анно",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ано",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ано)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вше",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вше)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енно",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енно)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённо",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённо)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "то",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "то",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "но",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(но)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёно",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёно)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //оны
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваны",
                "ванны",
                "даны",
                "данны",
                "ены",
                "енны",
                "емы",
                "оны",
                "аны",
                "анны",
                "ны",
                "иты",
                "ыты",
                "те",
                "ты",
                "сены",
                "сёны",
                "ки",
                "няты",
                "ивы",
                "ельны",
                "ели",
                "чны",
                "пны",
                "жны",
                "тны",
                "уты",
                "нуты",
                "яны",
                "янны",
                "аты",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яны",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янны",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "уты",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(уты)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нуты",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нуты)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тны",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тны)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жны",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пны",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чны",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельны",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивы",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивы)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "няты",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(няты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ки",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ки)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сены",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сены)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёны",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аты",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(аты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даны",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данны",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енны",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енны",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(енны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емы",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емы)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оны",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оны)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аны)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анны)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "иты",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(иты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыты",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыты)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "те",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(те)$").unwrap(),
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ты",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(ты)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ны",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ны)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ели",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ели)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванный
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "атый",
                "ванный",
                "ваный",
                "данный",
                "даный",
                "ельный",
                "еный",
                "енный",
                "емый",
                "сенный",
                "сеный",
                "ённый",
                "ёный",
                "онный",
                "оный",
                "анный",
                "аный",
                "ный",
                "итый",
                "ытый",
                "вший",
                "сёный",
                "сённый",
                //"той",
                "тый",
                "кий",
                "нятый",
                "ивый",
                "чный",
                "пный",
                "жный",
                "утый",
                "нутый",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутый",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утый",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жный",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пный",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чный",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятый",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивый",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённый",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённый)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёный",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенный",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеный",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кий",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кий)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельный",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атый",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данный",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даный",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёный",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аный)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вший",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вший)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванных
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::_Р,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "атых",
                "ванных",
                "ваных",
                "данных",
                "даных",
                "жных",
                //"венных",
                "енных",
                "еных",
                "сенных",
                "сеных",
                "сённых",
                "сёных",
                "емых",
                "ённых",
                "ёных",
                "онных",
                "оных",
                "анных",
                "аных",
                "ных",
                "итых",
                "вших",
                "ытых",
                "тех",
                "тых",
                "ких",
                "нятых",
                "нятных",
                "ивых",
                "утых",
                "нутых",
                "чных",
                "ших",
                "ельных",
                "пных",
                "тных",
                "утых",
                "янных",
                "яных",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яных",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янных",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тных",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жных",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пных",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельных",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чных",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ших",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(ших)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утых",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутых",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ких",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ких)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятных",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятых",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивых",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атых",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данных",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даных",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенных",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеных",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённых",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённых)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёных",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емых",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итых",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытых",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вших",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вших)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тех",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тех)$").unwrap(),
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венных",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венных)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённых",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённых)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёных",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енных)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еных)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тых",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тых)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ных",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ных)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванным
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванным",
                "ваным",
                "атым",
                "данным",
                "даным",
                "ельным",
                // "венным",
                "енным",
                "еным",
                "сенным",
                "сеным",
                "сённым",
                "сёным",
                "емым",
                "ённым",
                "ёным",
                "онным",
                "оным",
                "анным",
                "аным",
                "ным",
                "итым",
                "вшим",
                "ытым",
                //"том",
                "тым",
                "ким",
                "нятым",
                "ым",
                "ивым",
                "чным",
                "пным",
                "жным",
                "тным",
                "утым",
                "нутым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутым",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утым",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тным",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жным",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пным",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельным",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чным",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ким",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ким)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятым",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивым",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атым",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данным",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даным",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенным",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеным",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённым",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённым)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёным",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емым",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ным",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ным)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итым",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшим",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшим)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытым",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "том",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                    ..Default::default()
                },*/
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венным",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венным)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енным)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённым",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённым)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёным",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёным)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ым",
                    вид_окончания: Вид_Окончания::Ым,
                    re_выдер: Regex::new(r"(?i)(ым)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванными
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::_Д,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванными",
                "ваными",
                "данными",
                "даными",
                "ельными",
                "ыми",
                "атыми",
                //"венными",
                "сенными",
                "сеными",
                "сёнными",
                "сёными",
                "енными",
                "еными",
                "емыми",
                "ёнными",
                "ёными",
                "онными",
                "оными",
                "анными",
                "аными",
                "ными",
                "итыми",
                "вшими",
                "ытыми",
                "тыми",
                "кими",
                "нятыми",
                "нятными",
                "ивыми",
                "утыми",
                "нутыми",
                "чными",
                "пными",
                "жными",
                "овыми",
                "тными",
                "янными",
                "яными",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яными",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янными",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тными",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "овыми",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельными",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жными",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чными",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пными",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утыми",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутыми",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыми",
                    вид_окончания: Вид_Окончания::Ым,
                    re_выдер: Regex::new(r"(?i)(ыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивыми",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атыми",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данными",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даными",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятыми",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятными",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кими",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенными",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеными",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёнными",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёнными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёными",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёнными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итыми",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшими",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшими)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытыми",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    строка: "венными",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венными)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енными)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еными)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емыми",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ными",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ными)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванная
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::_Д,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваная",
                "ванная",
                "даная",
                "данная",
                "пная",
                "сенная",
                "сеная",
                "сённая",
                "сёная",
                "еная",
                "енная",
                "емая",
                "ённая",
                "ёная",
                "онная",
                "оная",
                "анная",
                "аная",
                "ная",
                "итая",
                "вшая",
                "ытая",
                "тая",
                "кая",
                "нятая",
                "нятная",
                "ельная",
                "ивая",
                "овая",
                "чная",
                "тная",
                "жная",
                "шая",
                "утая",
                "нутая",
                "атая",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атая",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутая",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утая",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "шая",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жная",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тная",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чная",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пная",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "овая",
                    вид_окончания: Вид_Окончания::Ов,
                    re_выдер: Regex::new(r"(?i)(овая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кая",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенная",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеная",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённая",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённая)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёная",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельная",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивая",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даная",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данная",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятая",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятная",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венная",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венная)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емая",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итая",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшая",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытая",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енная)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённая",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённая)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёная",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёная)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тая",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ная",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ная)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванную
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ам,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванную",
                "ваную",
                "данную",
                "даную",
                "ельную",
                "сенную",
                "сеную",
                "енную",
                "сённую",
                "сёную",
                "еную",
                "емую",
                "ённую",
                "ёную",
                "онную",
                "оную",
                "анную",
                "аную",
                "ную",
                "итую",
                "вшую",
                "ытую",
                "тую",
                "кую",
                "нятую",
                "нятную",
                "ивую",
                "утую",
                "чную",
                "пную",
                "тную",
                "жную",
                "нутую",
                "атую",
                //"венную",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атую",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утую",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутую",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жную",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тную",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пную",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чную",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельную",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенную",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеную",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённую",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённую)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёную",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венную",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венную)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кую",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятную",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятую",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивую",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данную",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даную",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емую",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итую",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшую",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытую",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енную)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённую",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённую)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёную",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёную)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тую",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ную",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ную)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванном
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванном",
                "ваном",
                "данном",
                "даном",
                //"венном",
                "енном",
                "еном",
                "ельном",
                "сенном",
                "сеном",
                "сённом",
                "сёном",
                "емом",
                "ённом",
                "ёном",
                "онном",
                "оном",
                "анном",
                "аном",
                "ном",
                "итом",
                "вшем",
                "ытом",
                "том",
                "ком",
                //"тым",
                "нятом",
                "нятном",
                "ивом",
                "жном",
                "ъятом",
                "янном",
                "яном",
                "тном",
                "утом",
                "нутом",
                "атом",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атом",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утом",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутом",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янном",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яном",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тном",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жном",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ъятом",
                    вид_окончания: Вид_Окончания::Ъят,
                    re_выдер: Regex::new(r"(?i)(ъятом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельном",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенном",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеном",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённом",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённом)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёном",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ком",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(ком)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятном",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятом",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивом",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данном",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даном",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емом",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итом",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшем",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшем)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытом",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытом)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венном",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венном)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енном)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённом",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённом)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёном",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёном)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "том",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ном",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ном)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванному
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
                Text_Changer::Вид_Окончания::_Р,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванному",
                "ваному",
                "данному",
                "даному",
                "ельному",
                //"венному",
                "енному",
                "еному",
                "сенному",
                "сеному",
                "сённому",
                "сёному",
                "емому",
                "ённому",
                "ёному",
                "онному",
                "оному",
                "анному",
                "аному",
                "ному",
                "итому",
                "вшему",
                "ытому",
                "тому",
                "кому",
                "нятому",
                "ивому",
                "пному",
                "тному",
                "жному",
                "утому",
                "нутому",
                "атому",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атому",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутому",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утому",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тному",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жному",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельному",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кому",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятому",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивому",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(вому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данному",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даному",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенному",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеному",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённому",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённому)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёному",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емому",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итому",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшему",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшему)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытому",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пному",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венному",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венному)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енному)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённому",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённому)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёному",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёному)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тому",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ному",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ному)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванного
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::_Р,
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванного",
                "ваного",
                "данного",
                "даного",
                //"венного",
                "енного",
                "еного",
                "сенного",
                "сеного",
                "сённого",
                "сёного",
                "емого",
                "ённого",
                "ёного",
                "онного",
                "оного",
                "анного",
                "аного",
                "ного",
                "итого",
                "вшего",
                "ытого",
                "того",
                "кого",
                "нятого",
                "ельного",
                "ивого",
                "щего",
                "пного",
                "тного",
                "жного",
                "утого",
                "нутого",
                "атого",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атого",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутого",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утого",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тного",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жного",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пного",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "щего",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щего)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельного",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кого",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенного",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеного",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённого",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённого)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёного",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятого",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивого",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данного",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даного",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емого",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итого",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшего",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшего)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытого",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытого)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венного",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венного)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енного)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённого",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённого)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёного",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёного)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "того",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ного",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ного)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванное
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванное",
                "ваное",
                "данное",
                "даное",
                //"венное",
                "енное",
                "еное",
                "сенное",
                "сеное",
                "сённое",
                "сёное",
                "емое",
                "ённое",
                "ёное",
                "онное",
                "оное",
                "анное",
                "аное",
                "ное",
                "итое",
                //"вшее",
                "ытое",
                "тое",
                "ятое",
                "кое",
                "нятое",
                "ивое",
                "ельное",
                "щее",
                "пное",
                "нятное",
                "жное",
                "тное",
                "утое",
                "нутое",
                "атое",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атое",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атое)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутое",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутое)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утое",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утое)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жное",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тное",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пное",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "щее",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щее)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_гласная: true,
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кое",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятое",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятное",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельное",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивое",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данное",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даное",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенное",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеное",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённое",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённое)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёное",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емое",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емое)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итое",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытое",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ятое",
                    вид_окончания: Вид_Окончания::Ят,
                    re_выдер: Regex::new(r"(?i)(ятое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венное",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венное)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енное)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённое",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённое)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёное",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёное)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тое",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ное",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ное)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванные
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ов,
                Text_Changer::Вид_Окончания::_Д,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванные",
                "ваные",
                "данные",
                "даные",
                "ивые",
                "сенные",
                "сеные",
                "сённые",
                "сёные",
                //"венные",
                "енные",
                "еные",
                "емые",
                "ённые",
                "ёные",
                "онные",
                "оные",
                "анные",
                "аные",
                "ные",
                "итые",
                "вшие",
                "ытые",
                "тые",
                "кие",
                "нятые",
                "нятные",
                "жные",
                "пные",
                "тные",
                "янные",
                "яные",
                "утые",
                "нутые",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутые",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утые",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тные",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жные",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пные",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивые",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятные",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятые",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кие",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенные",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеные",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённые",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённые)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёные",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "янные",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(янные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "яные",
                    вид_окончания: Вид_Окончания::Ян,
                    re_выдер: Regex::new(r"(?i)(яные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данные",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даные",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емые",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итые",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшие",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшие)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытые",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венные",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венные)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енные)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённые",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённые)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёные",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёные)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ные",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ные)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тые",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванной
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванной",
                "ваной",
                "данной",
                "даной",
                //"венной",
                "енной",
                "еной",
                "сенной",
                "сеной",
                "сённой",
                "сёной",
                "емой",
                "ённой",
                "ёной",
                "онной",
                "аной",
                "анной",
                "ной",
                "итой",
                "вшей",
                "ытой",
                "той",
                "кой",
                "нятой",
                "нятной",
                "ельной",
                "ивой",
                "щей",
                "пной",
                "оной",
                "тной",
                "жной",
                "утой",
                "нутой",
                "атой",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атой",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутой",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утой",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тной",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жной",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "щей",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельной",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кой",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венной",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венной)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятной",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятой",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивой",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даной",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данной",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенной",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеной",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённой",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённой)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёной",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емой",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итой",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшей",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытой",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытой)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пной",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енной)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённой",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённой)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёной",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёной)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ной",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ной)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванность
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванность",
                "ваность",
                "данность",
                "даность",
                "пность",
                "ельность",
                "кость",
                //"венность",
                "енность",
                "еность",
                "емость",
                "ённость",
                "ёность",
                "онность",
                "оность",
                "анность",
                "аность",
                "ность",
                "итость",
                "вшесть",
                "ытость",
                "тость",
                "с",
                "нятость",
                "ивость",
                "утость",
                "нутость",
                "жность",
                "тность",
                "ство",
                "атость",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атость",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ство",
                    вид_окончания: Вид_Окончания::Ств,
                    re_выдер: Regex::new(r"(?i)(ство)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тность",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жность",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пность",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утость",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутость",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельность",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятость",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кость",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивость",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данность",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даность",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емость",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емость)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итость",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшесть",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшесть)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытость",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венность",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венность)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "с",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(с)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енность)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённость",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённость)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёность",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёность)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тость",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ность",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ность)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностью
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностью",
                "ваностью",
                "данностью",
                "даностью",
                "льностью",
                "ельностью",
                //"венностью",
                "енностью",
                "еностью",
                "сенностью",
                "сеностью",
                "сённостью",
                "сёностью",
                "емостью",
                "ённостью",
                "ёностью",
                "онностью",
                "оностью",
                "анностью",
                "аностью",
                "ностью",
                "итостью",
                "вшестью",
                "ытостью",
                "тостью",
                "сом",
                "утостью",
                "нутостью",
                "костью",
                "нятостью",
                "нятностью",
                "ивостью",
                "чностью",
                "пностью",
                "жностью",
                "тностью",
                "атостью",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атостью",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чностью",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тностью",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жностью",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пностью",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утостью",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутостью",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивостью",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятностью",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятостью",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "костью",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сом",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сом)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенностью",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеностью",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённостью",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёностью",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельностью",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "льностью",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(льностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данностью",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даностью",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостью",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостью",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестью",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостью",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностью",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностью)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёностью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностью",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностью)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванности
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ам,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваности",
                "ванности",
                "даности",
                "данности",
                "кости",
                "сености",
                "сенности",
                "сёности",
                "сённости",
                "емости",
                //"венности",
                "енности",
                "ённости",
                "онности",
                "анности",
                "ности",
                "итости",
                "вшести",
                "ытости",
                "тости",
                "ельности",
                "нятости",
                "нятности",
                "ивости",
                "чности",
                "сти",
                "пности",
                "жности",
                "тности",
                "утости",
                "нутости",
                "атости",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атости",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутости",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утости",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чности",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельности",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "кости",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(кости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сености",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сености)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенности",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёности",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённости",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённости)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятности",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятости",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивости",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тности",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жности",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пности",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даности",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даности)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данности",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емости",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онности",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анности",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итости",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшести",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшести)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытости",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венности",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венности)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енности",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енности)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённости",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённости)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тости",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ности",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ности)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сти",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(сти)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностей
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ств,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностей",
                "ваностей",
                "данностей",
                "даностей",
                //"венностей",
                "енностей",
                "еностей",
                "сенностей",
                "сеностей",
                "сённостей",
                "сёностей",
                "емостей",
                "ённостей",
                "ёностей",
                "онностей",
                "оностей",
                "анностей",
                "аностей",
                "ностей",
                "итостей",
                "вшестей",
                "ытостей",
                "тостей",
                "костей",
                "ельностей",
                "нятостей",
                "ивостей",
                "стей",
                "чностей",
                "нятностей",
                "пностей",
                "жностей",
                "тностей",
                "утостей",
                "нутостей",
                "атостей",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атостей",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутостей",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утостей",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тностей",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жностей",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чностей",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельностей",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "костей",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятостей",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятностей",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивостей",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пностей",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данностей",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даностей",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеностей",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенностей",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёностей",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённостей",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостей",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостей",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестей",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостей",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностей",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностей)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёностей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,

                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностей",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "стей",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стей)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностям
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностям",
                "ваностям",
                "данностям",
                "даностям",
                //"венностям",
                "енностям",
                "еностям",
                "ельностям",
                "сенностям",
                "сеностям",
                "сённостям",
                "сёностям",
                "емостям",
                "ённостям",
                "ёностям",
                "онностям",
                "оностям",
                "анностям",
                "аностям",
                "ностям",
                "итостям",
                "вшестям",
                "ытостям",
                "тостям",
                "сам",
                "нятостям",
                "костям",
                "ивостям",
                "чностям",
                "пностям",
                "жностям",
                "тностям",
                "утостям",
                "нутостям",
                "атостям",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атостям",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутостям",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утостям",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тностям",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жностям",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пностям",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чностям",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельностям",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "костям",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сам",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сам)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятостям",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивостям",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данностям",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостям",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостям",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестям",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостям",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенностям",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеностям",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сеностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённостям",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёностям",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сёностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностям",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностям)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёностям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностям",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностям)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностями
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностями",
                "ваностями",
                "данностями",
                "даностями",
                "ельностями",
                "енностями",
                "еностями",
                "сенностями",
                "сеностями",
                "сённостями",
                "сёностями",
                //"венностями",
                "емостями",
                "ённостями",
                "ёностями",
                "онностями",
                "оностями",
                "анностями",
                "аностями",
                "ностями",
                "итостями",
                "вшестями",
                "ытостями",
                "тостями",
                "костями",
                "нятостями",
                "ивостями",
                "ями",
                "цами",
                "чностями",
                "пностями",
                "жностями",
                "тностями",
                "утостями",
                "нутостями",
                "атостями",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атостями",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутостями",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утостями",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тностями",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жностями",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пностями",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чностями",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "цами",
                    вид_окончания: Вид_Окончания::_Ц,
                    re_выдер: Regex::new(r"(?i)(цами)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельностями",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "костями",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятостями",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивостями",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данностями",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даностями",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сенностями",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сеностями",
                    вид_окончания: Вид_Окончания::Сен,
                    re_выдер: Regex::new(r"(?i)(сенностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сённостями",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сёностями",
                    вид_окончания: Вид_Окончания::Сён,
                    re_выдер: Regex::new(r"(?i)(сённостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостями",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостями",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестями",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостями",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностями",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностями)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёностями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностями",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ями",
                    вид_окончания: Вид_Окончания::Ям,
                    re_выдер: Regex::new(r"(?i)(ями)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ванностях
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                Text_Changer::Вид_Окончания::Ям,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностях",
                "ваностях",
                "данностях",
                "даностях",
                //"венностях",
                "ельностях",
                "енностях",
                "еностях",
                "емостях",
                "ённостях",
                "ёностях",
                "онностях",
                "оностях",
                "анностях",
                "аностях",
                "ностях",
                "стях",
                "итостях",
                "вшестях",
                "ытостях",
                "тостях",
                "сах",
                "костях",
                "нятостях",
                "нятностях",
                "ивостях",
                "чностях",
                "пностях",
                "жностях",
                "тностях",
                "утостях",
                "нутостях",
                "атостях",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "атостях",
                    вид_окончания: Вид_Окончания::Ат,
                    re_выдер: Regex::new(r"(?i)(атостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутостях",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утостях",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тностях",
                    вид_окончания: Вид_Окончания::Тн,
                    re_выдер: Regex::new(r"(?i)(тностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "жностях",
                    вид_окончания: Вид_Окончания::Жн,
                    re_выдер: Regex::new(r"(?i)(жностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "пностях",
                    вид_окончания: Вид_Окончания::Пн,
                    re_выдер: Regex::new(r"(?i)(пностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "чностях",
                    вид_окончания: Вид_Окончания::Чн,
                    re_выдер: Regex::new(r"(?i)(чностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ельностях",
                    вид_окончания: Вид_Окончания::Ель,
                    re_выдер: Regex::new(r"(?i)(ельностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ивостях",
                    вид_окончания: Вид_Окончания::Ив,
                    re_выдер: Regex::new(r"(?i)(ивостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "костях",
                    вид_окончания: Вид_Окончания::Ко_ка,
                    re_выдер: Regex::new(r"(?i)(костях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятностях",
                    вид_окончания: Вид_Окончания::Нятн,
                    re_выдер: Regex::new(r"(?i)(нятностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нятостях",
                    вид_окончания: Вид_Окончания::Нят,
                    re_выдер: Regex::new(r"(?i)(нятостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "данностях",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(данностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "даностях",
                    вид_окончания: Вид_Окончания::Дан,
                    re_выдер: Regex::new(r"(?i)(даностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "сах",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(сах)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостях",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностях",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностях)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостях",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестях",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостях",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        удвоенная_согласная: true,
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёностях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        множество_образцов_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностях",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "стях",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стях)$").unwrap(),
                    правописание: Буквы_Слова {
                        единственный_образец_в_разделе: true,
                        ..Default::default()
                    },
                    ..Default::default()
                },
            ],
        },
        //ам - ям
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ям", //"венностях",
                "ам", "ем",
            ]),
            первая_очередь: vec![
                //
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ям",
                    вид_окончания: Вид_Окончания::Ям,
                    re_выдер: Regex::new(r"(?i)(ям)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ам",
                    вид_окончания: Вид_Окончания::Ам,
                    re_выдер: Regex::new(r"(?i)(ам)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ем",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ем)$").unwrap(),
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![],
        },
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ом", //"венностях",
            ]),
            первая_очередь: vec![
                //
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ом",
                    вид_окончания: Вид_Окончания::Ом,
                    re_выдер: Regex::new(r"(?i)(ом)$").unwrap(),
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![],
        },
        //р
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "р", //"венностях",
            ]),
            первая_очередь: vec![Вид_Окончания_со_строкой {
                часть_речи: Вид_части_речи::Не_определено,
                строка: "р",
                вид_окончания: Вид_Окончания::_Р,
                re_выдер: Regex::new(r"(?i)(р)$").unwrap(),
                ..Default::default()
            }],
            вторая_очередь: vec![],
        },
        //ся
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ся", //"венностях",
                "утся",
                "нутся",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ся",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(ся)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "утся",
                    вид_окончания: Вид_Окончания::Ут,
                    re_выдер: Regex::new(r"(?i)(утся)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нутся",
                    вид_окончания: Вид_Окончания::Нут,
                    re_выдер: Regex::new(r"(?i)(нутся)$").unwrap(),
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![],
        },
        //ства
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["ства"]),
            первая_очередь: vec![Вид_Окончания_со_строкой {
                часть_речи: Вид_части_речи::Не_определено,
                строка: "ства",
                вид_окончания: Вид_Окончания::Ств,
                re_выдер: Regex::new(r"(?i)(ства)$").unwrap(),
                ..Default::default()
            }],
            вторая_очередь: vec![],
        },
        /*Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["в", "с"]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "с",
                    вид_окончания: Вид_Окончания::_С,
                    re_выдер: Regex::new(r"(?i)(с)$").unwrap(),
                    ..Default::default()
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "в",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(в)$").unwrap(),
                    ..Default::default()
                },
            ],
            вторая_очередь: vec![],
        },*/
    ]
});
#[allow(non_camel_case_types)]
pub trait Возможности_торжка {
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_полное_окончание,
        изначальное_окончание: &RE_полное_окончание,
        неруское_слово_исходное: &String,
        слово_замена_исходное: &String,
        образец_окончания_неруского_слова: &str,
    ) -> Result<Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>;
    //
    fn найти_окончание_к_слову_замене_с_условием_удвоенных_букв(
        &self,
        образец_окончания_неруского_слова: &str,
        образец_выдера_в_замене: &Вид_Окончания_со_строкой,
        полный_образец_окончания_неруского_слова: &RE_полное_окончание,
    ) -> Result<Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>;
    //
}
impl Возможности_торжка for [Раздел_Торжка] {
    /*fn проверить_на_соблюдение_правил(&self) -> Result<(), ()> {
        //прогон
        for раздел in self.iter() {}
    }*/
    //
    fn найти_окончание_к_слову_замене_с_условием_удвоенных_букв(
        &self,
        образец_окончания_неруского_слова: &str,
        образец_выдера_в_замене: &Вид_Окончания_со_строкой,
        полный_образец_окончания_неруского_слова: &RE_полное_окончание,
    ) -> Result<Вид_Окончания_со_строкой, Вид_ошибки_при_поиске_выдера_в_торжке> {
        //let условие_вывода
        //
        let mut найден_ли_образец: bool = false;
        let mut сам_образец: Вид_Окончания_со_строкой = Default::default();
        /*println!(
            "образец_окончания_неруского_слова |{}| образец_выдера_в_замене вид_окончания |{}|",
            образец_окончания_неруского_слова, образец_выдера_в_замене.вид_окончания
        );*/
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(образец_окончания_неруского_слова)
            {
                //если исключение
                if раздел
                    .окончания_исключения
                    .contains(&образец_выдера_в_замене.вид_окончания)
                {
                    //есть исключение - - возврат
                    return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Исключение(образец_окончания_неруского_слова.to_string(),образец_выдера_в_замене.вид_окончания.clone()));
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for (_указатель_1, ячейка) in раздел.первая_очередь.iter().enumerate()
                {
                    //println!("1 - #|{}| строка ячейки |{}|", указатель_1, ячейка.строка);
                    if ячейка.вид_окончания == образец_выдера_в_замене.вид_окончания
                    {
                        /*println!(
                            "1-ячейка |{}| образец_выдера_в_замене |{}|",
                            ячейка.строка, полный_образец_окончания_неруского_слова.строка
                        );*/
                        найден_ли_образец = true;
                        //проверка на согласные и гласные
                        match Буквы_Слова::допустимость_согласных_и_гласных( &ячейка.правописание,&полный_образец_окончания_неруского_слова.правописание)
                        {

                            true=>  return Ok(ячейка.clone()),
                            false=>
                            //
                            {
                               // println!("Не сошлось ");
                                match ячейка.правописание.единственный_образец_в_разделе {
                                true=>return Ok(ячейка.clone()),
                                false=>сам_образец = ячейка.clone(),
                            }
                            }
                        }
                    }
                }
                //("2 ряд");
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for (_указатель_2, ячейка) in раздел.вторая_очередь.iter().enumerate()
                {
                    /*println!(
                        "2 - указатель №2 |{}| строка |{}|",
                        указатель_2, ячейка.строка
                    );*/
                    if ячейка.вид_окончания == образец_выдера_в_замене.вид_окончания
                    {
                        /*println!(
                            "2-ячейка |{}| образец_выдера_в_замене |{}|",
                            ячейка.строка, полный_образец_окончания_неруского_слова.строка
                        );*/
                        найден_ли_образец = true;
                        //проверка на согласные и гласные
                        match Буквы_Слова::допустимость_согласных_и_гласных( &ячейка.правописание,&полный_образец_окончания_неруского_слова.правописание)
                        {

                            true=>  return Ok(ячейка.clone()),
                            false=> match ячейка.правописание.единственный_образец_в_разделе {
                                true=>return Ok(ячейка.clone()),
                                false=>сам_образец = ячейка.clone(),
                            }
                        }
                    }
                }
                //
                match найден_ли_образец {
                    true=>return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_образец_по_условиям_гласных_и_согласных(сам_образец.clone(), полный_образец_окончания_неруского_слова.clone())),
                    false=>return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_вид_окончания_в_разделе_торжка_но_есть_в_куче(образец_окончания_неруского_слова.to_string(),образец_выдера_в_замене.вид_окончания.clone())),
                }
            }
        }
        return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_в_кучах(образец_окончания_неруского_слова.to_string()));
    }
    //
    fn найти_окончание_выдера(
        &self,
        образец_re_для_замены: &RE_полное_окончание,
        образец_re_неруси_первичного_слова: &RE_полное_окончание,
        неруское_слово_исходное: &String,
        слово_замена_исходное: &String,
        образец_окончания_неруского_слова: &str,
    ) -> Result<Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке> {
        use Text_Changer::{
            Возможноси_частей_речи, Ошибка_несоотвествия_части_речи_Торжок,
            РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ,
        };
        //
        let mut найден_в_куче_окончаний: bool = false;
        /*let mut вид_окончания_где_нашлось: Text_Changer::Вид_Окончания =
        Text_Changer::Вид_Окончания::Не_определено;*/
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&образец_re_неруси_первичного_слова.строка)
            {
                //на исключение проверяем
                if раздел
                    .окончания_исключения
                    .contains(&образец_re_для_замены.вид_окончания)
                {
                    return Err(Вид_ошибки_при_поиске_выдера_в_торжке::Исключение(образец_окончания_неруского_слова.to_string(),образец_re_для_замены.вид_окончания.clone()));
                }
                //
                найден_в_куче_окончаний = true;
                //если несколько видов окончаний одного вида в разделе
                let количество_окончаний_в_разделе_данного_вида_окончания: usize = раздел
                    .много_ли_окончаний_в_разделе(
                        &образец_re_для_замены.вид_окончания,
                    );
                let mut текущий_счётчик_множества_окончаний_в_разделе: usize = 1;
                //перебор ячеек в разделе на предмет соответствия вида окончания
                'круговорот_первой_очереди: for (_, ячейка) in
                    раздел.первая_очередь.iter().enumerate()
                {
                    if ячейка.вид_окончания == образец_re_для_замены.вид_окончания
                    {
                        //
                        let часть_речи_с_торжка = РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ
                            .определить_вид_части_речи_по_ячейке_торжка(
                                &ячейка,
                            )
                            .unwrap();
                        //проверка что несколько может быть окончаний
                        return match Возможноси_частей_речи::допустима_ли_покупка(образец_re_для_замены.части_речи, часть_речи_с_торжка) {
                            true=> Ok(ячейка.clone()),
                            //
                            false=>
                                    //много образцов окончания может быть в разделе
                                    match ячейка.правописание.множество_образцов_в_разделе {
                                        //
                                        false=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                Ошибка_несоотвествия_части_речи_Торжок {
                                    выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                    выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                    часть_речи_торжка:&часть_речи_с_торжка,
                                    ячейка_торжка_купленная:ячейка.clone(),
                                    нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                    слово_замена_исходное:слово_замена_исходное.clone(),
                                    окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                }
                            )) ,
                                        //это последний повтор окончания в ряде
                                        true=> match количество_окончаний_в_разделе_данного_вида_окончания==текущий_счётчик_множества_окончаний_в_разделе {
                                            //
                                            true=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                    Ошибка_несоотвествия_части_речи_Торжок {
                                        выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                        выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                        часть_речи_торжка:&часть_речи_с_торжка,
                                        ячейка_торжка_купленная:ячейка.clone(),
                                        нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                        слово_замена_исходное:слово_замена_исходное.clone(),
                                        окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                    }
                                )) ,
                                            //
                                         false=> {текущий_счётчик_множества_окончаний_в_разделе+=1;continue 'круговорот_первой_очереди},
                                         }

                            },
                        };
                    }
                }
                //
                'круговорот_второй_очереди: for ячейка in
                    раздел.вторая_очередь.iter()
                {
                    if ячейка.вид_окончания == образец_re_для_замены.вид_окончания
                    {
                        //
                        let часть_речи_с_торжка = РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ
                            .определить_вид_части_речи_по_ячейке_торжка(
                                &ячейка,
                            )
                            .unwrap();
                        //
                        //проверка что несколько может быть окончаний
                        return match Возможноси_частей_речи::допустима_ли_покупка(образец_re_для_замены.части_речи, часть_речи_с_торжка) {
                            true=> Ok(ячейка.clone()),
                            //
                            false=>
                            //много образцов окончания может быть в разделе
                                    match ячейка.правописание.множество_образцов_в_разделе {
                                        //
                                        false=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                Ошибка_несоотвествия_части_речи_Торжок {
                                    выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                    выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                    часть_речи_торжка:&часть_речи_с_торжка,
                                    ячейка_торжка_купленная:ячейка.clone(),
                                    нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                    слово_замена_исходное:слово_замена_исходное.clone(),
                                    окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                }
                            )) ,
                                          //это последний повтор окончания в ряде
                                        true=> match количество_окончаний_в_разделе_данного_вида_окончания==текущий_счётчик_множества_окончаний_в_разделе {
                                            //
                                            true=>Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                    Ошибка_несоотвествия_части_речи_Торжок {
                                        выдер_для_неруси_исходный:образец_re_неруси_первичного_слова.clone(),
                                        выдер_для_замены_изначальный:образец_re_для_замены.clone(),
                                        часть_речи_торжка:&часть_речи_с_торжка,
                                        ячейка_торжка_купленная:ячейка.clone(),
                                        нерусь_слово_исходное:неруское_слово_исходное.clone(),
                                        слово_замена_исходное:слово_замена_исходное.clone(),
                                        окончание_нерусь_итоговое:образец_окончания_неруского_слова.to_string(),
                                    }
                                )) ,
                                            //
                                         false=> {текущий_счётчик_множества_окончаний_в_разделе+=1;continue 'круговорот_второй_очереди},
                                         }

                            },
                        };
                    }
                }
            }
            //
        }
        //
        return match найден_в_куче_окончаний{
            //найден в куче
            true=> {
                //
                Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_вид_окончания_в_разделе_торжка_но_есть_в_куче(образец_re_неруси_первичного_слова.строка.to_string(),образец_re_для_замены.вид_окончания)) },
            //не найден
            false=> Err( Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найден_в_кучах(образец_re_неруси_первичного_слова.строка.to_string()))
        };
    }
}

// счётчик_входа.fetch_add(1, Ordering::Relaxed);

/*pub fn проверка_конечных_окончаний_re_образцов() {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        проверка_среза_строк_на_неповтор(
            &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
            "КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН",
        );
    }

    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}*/
pub fn проверка_среза_строк_на_неповтор(
    срез: &[&'static str],
    имя_кучи: &str,
) {
    let mut куча: rapidhash::fast::RapidHashSet<&str> = rapidhash::fast::RapidHashSet::default();
    //сама проверка
    for ячейка in срез.iter() {
        if !куча.contains(ячейка) {
            куча.insert(ячейка);
        } else {
            println!("Куча |{}| повторно содержит образец |{}|", имя_кучи, ячейка)
        }
    }
}
//
pub static МЕСТОИМЕНИЯ: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // --- Личные (я, ты, мы, вы) ---
        "я",
        "меня",
        "мне",
        "мной",
        "мною",
        "обо мне",
        "ты",
        "тебя",
        "тебе",
        "тобой",
        "тобою",
        "о тебе",
        "мы",
        "нас",
        "нам",
        "нами",
        "о нас",
        "вы",
        "вас",
        "вам",
        "вами",
        "о вас",
        // --- Личные 3-го лица (он, она, оно, они) ---
        "он",
        "его",
        "ему",
        "им",
        "нем",
        "о нем",
        "она",
        "ее",
        "ей",
        "ею",
        "ней",
        "о ней",
        "оно",
        "его",
        "ему",
        "им",
        "нем",
        "о нем",
        "они",
        "их",
        "им",
        "ими",
        "них",
        "о них",
        // --- Возвратное (себя) ---
        "себя",
        "себе",
        "собой",
        "собою",
        "о себе",
    ])
});
//
pub static ДОПЫ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> =
    LazyLock::new(|| RapidHashSet::from_iter(["не"]));
//
pub static НАРЕЧИЯ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // Возвратное (по-своему)
        "по-своему",
        // Личные (по-моему, по-твоему и т.д.)
        "по-моему",
        "по-твоему",
        "по-нашему",
        "по-вашему",
        // Местоимённые указательные
        "там",
        "тут",
        "сюда",
        "туда",
        "оттуда",
        "отсюда",
        "здесь",
        "так",
        "тогда",
        "потому",
        "поэтому",
        "затем",
        // Местоимённые определительные
        "всегда",
        "везде",
        "всюду",
        "повсюду",
        "по-иному",
        "по-всякому",
        // Вопросительно-относительные
        "как",
        "где",
        "куда",
        "откуда",
        "когда",
        "почему",
        "зачем",
        "отчего",
        // Неопределённые
        "как-то",
        "как-нибудь",
        "кое-как",
        "где-то",
        "где-либо",
        "где-нибудь",
        "кое-где",
        "когда-то",
        "когда-нибудь",
        "когда-либо",
        "зачем-то",
        "почему-то",
        // Отрицательные
        "никак",
        "нигде",
        "негде",
        "ниоткуда",
        "неоткуда",
        "никуда",
        "некуда",
        "никогда",
        "некогда",
        "незачем",
        // Определительные: качественные
        "быстро",
        "медленно",
        "весело",
        "громко",
        "хорошо",
        "дружно",
        "внимательно",
        "грубо",
        "молча",
        "правильно",
        "страшно",
        "чудовищно",
        "ярко",
        "смело",
        "горько",
        // Определительные: количественные
        "много",
        "мало",
        "приблизительно",
        "почти",
        "дважды",
        "вдвое",
        "втрое",
        "чуть-чуть",
        "очень",
        "весьма",
        "гораздо",
        "совершенно",
        "вдоволь",
        "дотла",
        "досыта",
        "крайне",
        "чрезмерно",
        "трижды",
        "вшестером",
        "пополам",
        "втройне",
        // Определительные: образа и способа действия
        "вручную",
        "вполголоса",
        "наизнанку",
        "шагом",
        "вплотную",
        "назубок",
        "искоса",
        "ощупью",
        "вдребезги",
        "кувырком",
        "крест-накрест",
        "басом",
        "вразвалку",
        "вплавь",
        "бегом",
        "верхом",
        "пешком",
        "плашмя",
        "вброд",
        "вприпрыжку",
        // Сравнительно-уподобительные
        "по-весеннему",
        "по-летнему",
        "по-осеннему",
        "по-зимнему",
        "по-детски",
        "по-дружески",
        "по-лисьи",
        "по-медвежьи",
        "по-отцовски",
        "по-матерински",
        "по-братски",
        // Совместности
        "вдвоём",
        "втроём",
        "впятером",
        "по двое",
        "по трое",
        "поочерёдно",
        // Обстоятельственные: места
        "далеко",
        "близко",
        "вблизи",
        "вдали",
        "вдалеке",
        "вдаль",
        "назад",
        "вперёд",
        "впереди",
        "позади",
        "сзади",
        "спереди",
        "слева",
        "справа",
        "налево",
        "направо",
        "вверху",
        "внизу",
        "наверху",
        "вниз",
        "вверх",
        "вбок",
        "набок",
        "вокруг",
        "рядом",
        "около",
        "возле",
        "издали",
        "издалека",
        "отовсюду",
        "оттуда",
        "изнутри",
        "снаружи",
        "поверх",
        "вглубь",
        "вширь",
        "навстречу",
        "посередине",
        "посреди",
        "вдалеке",
        "поблизости",
        "дома",
        "до́ма",
        // Обстоятельственные: времени
        "вчера",
        "сегодня",
        "завтра",
        "утром",
        "днём",
        "вечером",
        "ночью",
        "весной",
        "летом",
        "осенью",
        "зимой",
        "сейчас",
        "теперь",
        "тогда",
        "давно",
        "недавно",
        "издавна",
        "смолоду",
        "раньше",
        "прежде",
        "сперва",
        "сначала",
        "затем",
        "потом",
        "вовремя",
        "иногда",
        "всегда",
        "никогда",
        "допоздна",
        "затемно",
        "досветла",
        "долго",
        "недолго",
        "подолгу",
        "тотчас",
        "сразу",
        "наконец",
        "вскоре",
        "нескоро",
        "засветло",
        "на днях",
        "поутру",
        "вечор",
        "нонече",
        // Обстоятельственные: причины
        "сгоряча",
        "сдуру",
        "спьяну",
        "сослепу",
        "поневоле",
        "недаром",
        "почему",
        "потому",
        "оттого",
        "отчего",
        "волей-неволей",
        "неспроста",
        "спросонья",
        "со зла",
        "сослепу",
        // Обстоятельственные: цели
        "нарочно",
        "специально",
        "назло",
        "наперекор",
        "в шутку",
        "умышленно",
        "неумышленно",
        "в насмешку",
        "насмех",
        "невзначай",
        "напоказ",
        "зря",
        "бесцельно",
        "безрезультатно",
        // Производные от деепричастий
        "лёжа",
        "сидя",
        "стоя",
        "молча",
        "шутя",
        "нехотя",
        // Производные от наречий (с суффиксами)
        "рановато",
        "поздновато",
        "сыровато",
        "хорошенечко",
        "ранёхонько",
        "тихонько",
        "давненько",
        "поближе",
        "покрепче",
        "поменьше",
        "давным-давно",
        "полным-полно",
        // Непроизводные
        "вдруг",
        "еле-еле",
        "едва",
        "прежде",
        "весьма",
    ])
});

//
pub static ПРЕДЛОГИ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // Непроизводные (первообразные) — ~25 единиц
        "без",
        "безо",
        "близ",
        "в",
        "во",
        "вне",
        "вопреки",
        "для",
        "до",
        "за",
        "из",
        "изо",
        "из-за",
        "из-под",
        "к",
        "ко",
        "кроме",
        "меж",
        "между",
        "на",
        "над",
        "надо",
        "о",
        "об",
        "обо",
        "от",
        "ото",
        "по",
        "под",
        "подо",
        "при",
        "про",
        "ради",
        "с",
        "со",
        "среди",
        "у",
        "через",
        "чрез",
        // Производные от наречий — наречные
        "вблизи",
        "вглубь",
        "вдоль",
        "взамен",
        "вместо",
        "внутри",
        "внутрь",
        "возле",
        "вокруг",
        "впереди",
        "навстречу",
        "напротив",
        "насквозь",
        "около",
        "поверх",
        "позади",
        "помимо",
        "поперёк",
        "после",
        "посреди",
        "посредине",
        "против",
        "сверх",
        "свыше",
        "сзади",
        "сквозь",
        "снизу",
        "согласно",
        "сообразно",
        "соответственно",
        "соразмерно",
        "спереди",
        "сродни",
        // Производные от существительных — отымённые
        "ввиду",
        "в виде",
        "в зависимости от",
        "в качестве",
        "в лице",
        "в отличие от",
        "в отношении",
        "в преддверии",
        "в продолжение",
        "в роли",
        "в силу",
        "в течение",
        "в целях",
        "вследствие",
        "за вычетом",
        "за исключением",
        "за счёт",
        "наподобие",
        "насчёт",
        "по мере",
        "по поводу",
        "по причине",
        "по случаю",
        "под видом",
        "посредством",
        "путём",
        "с помощью",
        "с точки зрения",
        // Производные от глаголов — отглагольные
        "благодаря",
        "включая",
        "исключая",
        "начиная с",
        "не считая",
        "несмотря на",
        "невзирая на",
        "спустя",
    ])
});
