use Text_Changer::{
    Вид_Окончания, Вид_ошибки_при_поиске_в_торжке, *
};
use console::style;
//use gpui_kit::component::text::Text;
use rapidhash::RapidHashSet;
//use rayon::prelude::*;
use regex::Regex;
use std::sync::LazyLock;
//use std::sync::atomic::{AtomicBool, Ordering};

/*pub static ИСКЛЮЧЕНИЯ_ПОИСКА_ВЫДЕРА: LazyLock<Исключения_поиска_выдера> =
LazyLock::new(|| Исключения_поиска_выдера {
    ван: vec![Исключение_поиска_выдера {
        вид_окончания: Text_Changer::Вид_Окончания::Ван,
        куча_окончаний: rapidhash::fast::RapidHashSet::from_iter(["вано"]),
        куча_обрезков_слов: rapidhash::fast::RapidHashSet::from_iter(["нир"]),
    }],
});*/
//

//

/*pub struct Regex_с_заменой {
    поиск: Regex,
    замена: Regex,
}*/
/*
pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание;63],
> = LazyLock::new(|| {
    [

//под конец уже идут исключения
//
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ш$").unwrap(),
          окончание_строка: "ш",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ша$").unwrap(),
          окончание_строка: "ша",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шая$").unwrap(),
          окончание_строка: "шая",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шую$").unwrap(),
          окончание_строка: "шую",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ше$").unwrap(),
          окончание_строка: "ше",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ши$").unwrap(),
          окончание_строка: "ши",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шем$").unwrap(),
          окончание_строка: "шем",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шею$").unwrap(),
          окончание_строка: "шею",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шему$").unwrap(),
          окончание_строка: "шему",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шего$").unwrap(),
          окончание_строка: "шего",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шее$").unwrap(),
          окончание_строка: "шее",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шей$").unwrap(),
          окончание_строка: "шей",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шесть$").unwrap(),
          окончание_строка: "шесть",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестью$").unwrap(),
          окончание_строка: "шестью",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шести$").unwrap(),
          окончание_строка: "шести",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестей$").unwrap(),
          окончание_строка: "шестей",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестям$").unwrap(),
          окончание_строка: "шестям",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестями$").unwrap(),
          окончание_строка: "шестями",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шестях$").unwrap(),
          окончание_строка: "шестях",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шим$").unwrap(),
          окончание_строка: "шим",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шими$").unwrap(),
          окончание_строка: "шими",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ший$").unwrap(),
          окончание_строка: "ший",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)шие$").unwrap(),
          окончание_строка: "шие",
          вид_окончания: Вид_Окончания::_Ш,
      },
      RE_исключающее_окончание {
          re_образец: Regex::new(r"(?i)ших$").unwrap(),
          окончание_строка: "ших",
          вид_окончания: Вид_Окончания::_Ш,
      },
      //-------------

//------------------то
/*RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)та$").unwrap(),
    окончание_строка: "та",
    вид_окончания: Вид_Окончания::То,
},
/*RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)т$").unwrap(),
    окончание_строка: "т",
    вид_окончания: Вид_Окончания::То,
},*/
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тая$").unwrap(),
    окончание_строка: "тая",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тую$").unwrap(),
    окончание_строка: "тую",
    вид_окончания: Вид_Окончания::То,
},*/
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
/*RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ты$").unwrap(),
    окончание_строка: "ты",
    вид_окончания: Вид_Окончания::Ты,
},*/
//
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)том$").unwrap(),
    окончание_строка: "том",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тому$").unwrap(),
    окончание_строка: "тому",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)то$").unwrap(),
    окончание_строка: "то",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)того$").unwrap(),
    окончание_строка: "того",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)той$").unwrap(),
    окончание_строка: "той",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тость$").unwrap(),
    окончание_строка: "тость",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостью$").unwrap(),
    окончание_строка: "тостью",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тости$").unwrap(),
    окончание_строка: "тости",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостей$").unwrap(),
    окончание_строка: "тостей",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостям$").unwrap(),
    окончание_строка: "тостям",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостями$").unwrap(),
    окончание_строка: "тостями",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостях$").unwrap(),
    окончание_строка: "тостях",
    вид_окончания: Вид_Окончания::То,
},
//ыт
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыт$").unwrap(),
   окончание_строка: "ыт",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыта$").unwrap(),
   окончание_строка: "ыта",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытая$").unwrap(),
   окончание_строка: "ытая",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытую$").unwrap(),
   окончание_строка: "ытую",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыто$").unwrap(),
   окончание_строка: "ыто",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытое$").unwrap(),
   окончание_строка: "ытое",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытом$").unwrap(),
   окончание_строка: "ытом",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытому$").unwrap(),
   окончание_строка: "ытому",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытой$").unwrap(),
   окончание_строка: "ытой",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытого$").unwrap(),
   окончание_строка: "ытого",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытость$").unwrap(),
   окончание_строка: "ытость",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостью$").unwrap(),
   окончание_строка: "ытостью",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытости$").unwrap(),
   окончание_строка: "ытости",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостей$").unwrap(),
   окончание_строка: "ытостей",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостям$").unwrap(),
   окончание_строка: "ытостям",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостями$").unwrap(),
   окончание_строка: "ытостями",
   вид_окончания: Вид_Окончания::Ыт,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытостях$").unwrap(),
   окончание_строка: "ытостях",
   вид_окончания: Вид_Окончания::Ыт,
},
 RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ыты$").unwrap(),
    окончание_строка: "ыты",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытые$").unwrap(),
   окончание_строка: "ытые",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытым$").unwrap(),
   окончание_строка: "ытым",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытыми$").unwrap(),
   окончание_строка: "ытыми",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ытых$").unwrap(),
   окончание_строка: "ытых",
   вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ытый$").unwrap(),
    окончание_строка: "ытый",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ытые$").unwrap(),
    окончание_строка: "ытые",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ытее$").unwrap(),
    окончание_строка: "ытее",
    вид_окончания: Вид_Окончания::_Ы,
},
]
});*/
//
/*pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание; 306],
> = LazyLock::new(|| {
    [
    //----------------В
    //ем
           //----------------
         RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)в$").unwrap(),
               окончание_строка: "в",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)ве$").unwrap(),
               окончание_строка: "ве",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)ва$").unwrap(),
               окончание_строка: "ва",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вая$").unwrap(),
               окончание_строка: "вая",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вую$").unwrap(),
               окончание_строка: "вую",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)во$").unwrap(),
               окончание_строка: "во",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вы$").unwrap(),
               окончание_строка: "вы",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вом$").unwrap(),
               окончание_строка: "вом",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вому$").unwrap(),
               окончание_строка: "вому",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)во$").unwrap(),
               окончание_строка: "во",
               вид_окончания: Вид_Окончания::Ва_Во,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вого$").unwrap(),
               окончание_строка: "вого",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вое$").unwrap(),
               окончание_строка: "вое",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вой$").unwrap(),
               окончание_строка: "вой",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вость$").unwrap(),
               окончание_строка: "вость",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востью$").unwrap(),
               окончание_строка: "востью",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вости$").unwrap(),
               окончание_строка: "вости",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востей$").unwrap(),
               окончание_строка: "востей",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востям$").unwrap(),
               окончание_строка: "востям",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востями$").unwrap(),
               окончание_строка: "востями",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)востях$").unwrap(),
               окончание_строка: "востях",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вым$").unwrap(),
               окончание_строка: "вым",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)выми$").unwrap(),
               окончание_строка: "выми",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вый$").unwrap(),
               окончание_строка: "вый",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вые$").unwrap(),
               окончание_строка: "вые",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вых$").unwrap(),
               окончание_строка: "вых",
               вид_окончания: Вид_Окончания::_В,
           },
           RE_исключающее_окончание {
               re_образец: Regex::new(r"(?i)вее$").unwrap(),
               окончание_строка: "вее",
               вид_окончания: Вид_Окончания::_В,
           },
           //--------------------
    //---------------Щ
    //
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щ$").unwrap(),
              окончание_строка: "щ",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)ща$").unwrap(),
              окончание_строка: "ща",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щая$").unwrap(),
              окончание_строка: "щая",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щую$").unwrap(),
              окончание_строка: "щую",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)ще$").unwrap(),
              окончание_строка: "ще",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щи$").unwrap(),
              окончание_строка: "щи",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щем$").unwrap(),
              окончание_строка: "щем",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щему$").unwrap(),
              окончание_строка: "щему",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щее$").unwrap(),
              окончание_строка: "щее",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щего$").unwrap(),
              окончание_строка: "щего",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щее$").unwrap(),
              окончание_строка: "щее",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щей$").unwrap(),
              окончание_строка: "щей",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щесть$").unwrap(),
              окончание_строка: "щесть",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестью$").unwrap(),
              окончание_строка: "щестью",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щести$").unwrap(),
              окончание_строка: "щести",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестей$").unwrap(),
              окончание_строка: "щестей",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестям$").unwrap(),
              окончание_строка: "щестям",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестями$").unwrap(),
              окончание_строка: "щестями",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щестях$").unwrap(),
              окончание_строка: "щестях",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щим$").unwrap(),
              окончание_строка: "щим",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щими$").unwrap(),
              окончание_строка: "щими",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щий$").unwrap(),
              окончание_строка: "щий",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щие$").unwrap(),
              окончание_строка: "щие",
              вид_окончания: Вид_Окончания::_Щ,
          },
          RE_исключающее_окончание {
              re_образец: Regex::new(r"(?i)щих$").unwrap(),
              окончание_строка: "щих",
              вид_окончания: Вид_Окончания::_Щ,
          },
          //-------------

        //----------------Л
        //Л
       /* RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)л$").unwrap(),
            окончание_строка: "л",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лся$").unwrap(),
            окончание_строка: "лся",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ло$").unwrap(),
            окончание_строка: "ло",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лось$").unwrap(),
            окончание_строка: "лось",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ли$").unwrap(),
            окончание_строка: "ли",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лись$").unwrap(),
            окончание_строка: "лись",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ль$").unwrap(),
            окончание_строка: "ль",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лью$").unwrap(),
            окончание_строка: "лью",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лей$").unwrap(),
            окончание_строка: "лей",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ли$").unwrap(),
            окончание_строка: "ли",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лям$").unwrap(),
            окончание_строка: "лям",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лями$").unwrap(),
            окончание_строка: "лями",
            вид_окончания: Вид_Окончания::_Л,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)лях$").unwrap(),
            окончание_строка: "лях",
            вид_окончания: Вид_Окончания::_Л,
        },*/

        //-------------

        //-------------------------------------ён






        //--------------------

        //
    ]
});*/

//
pub static ПУСТОЙ_РЯД_RE: LazyLock<[Regex; 0]> = LazyLock::new(|| Default::default());
//
/*pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН: LazyLock<[Regex; 42]> = LazyLock::new(|| {
    [
        //ен
        //а
        Regex::new(r"(?i)еная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)енн$").unwrap(),
        Regex::new(r"(?i)енна$").unwrap(),
        Regex::new(r"(?i)енно$").unwrap(),
        Regex::new(r"(?i)енны$").unwrap(),
        //Regex::new(r"(?i)еннее$").unwrap(),
        //ую
        Regex::new(r"(?i)еную$").unwrap(),
        //о
        Regex::new(r"(?i)еное$").unwrap(),
        Regex::new(r"(?i)еного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)еном$").unwrap(),
        Regex::new(r"(?i)еному$").unwrap(),
        Regex::new(r"(?i)еность$").unwrap(),
        Regex::new(r"(?i)еностью$").unwrap(),
        Regex::new(r"(?i)ености$").unwrap(),
        Regex::new(r"(?i)еностей$").unwrap(),
        Regex::new(r"(?i)еностям$").unwrap(),
        Regex::new(r"(?i)еностями$").unwrap(),
        Regex::new(r"(?i)еностях$").unwrap(),
        //ы
        Regex::new(r"(?i)еным$").unwrap(),
        Regex::new(r"(?i)еными$").unwrap(),
        Regex::new(r"(?i)еных$").unwrap(),
        Regex::new(r"(?i)еные$").unwrap(),
        //----------------------------------);
        //ён
        //а
        Regex::new(r"(?i)ёная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)ённ$").unwrap(),
        Regex::new(r"(?i)ённа$").unwrap(),
        Regex::new(r"(?i)ённо$").unwrap(),
        Regex::new(r"(?i)ённы$").unwrap(),
        //ую
        Regex::new(r"(?i)ёную$").unwrap(),
        //о
        Regex::new(r"(?i)ёное$").unwrap(),
        Regex::new(r"(?i)ёного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)ёном$").unwrap(),
        Regex::new(r"(?i)ёному$").unwrap(),
        Regex::new(r"(?i)ёность$").unwrap(),
        Regex::new(r"(?i)ёностью$").unwrap(),
        Regex::new(r"(?i)ёности$").unwrap(),
        Regex::new(r"(?i)ёностей$").unwrap(),
        Regex::new(r"(?i)ёностям$").unwrap(),
        Regex::new(r"(?i)ёностями$").unwrap(),
        Regex::new(r"(?i)ёностях$").unwrap(),
        //ы
        Regex::new(r"(?i)ёным$").unwrap(),
        Regex::new(r"(?i)ёными$").unwrap(),
        Regex::new(r"(?i)ёных$").unwrap(),
        Regex::new(r"(?i)ёные$").unwrap(),
        //----------------------------------);
        //
    ]
});*/
//
/*pub static RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Re_образцы; 23]> = LazyLock::new(|| {
    [
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ван)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ван)$").unwrap(),
                окончание_строка: "ван",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вана)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вана)$").unwrap(),
                окончание_строка: "вана",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вано)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вано)$").unwrap(),
                окончание_строка: "вано",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ваны)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ваны)$").unwrap(),
                окончание_строка: "ваны",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванная)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванная)$").unwrap(),
                окончание_строка: "ванная",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванную)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванную)$").unwrap(),
                окончание_строка: "ванную",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванной)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванной)$").unwrap(),
                окончание_строка: "ванной",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванное)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванное)$").unwrap(),
                окончание_строка: "ванное",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванного)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванного)$").unwrap(),
                окончание_строка: "ванного",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванном)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванном)$").unwrap(),
                окончание_строка: "ванном",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванному)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванному)$").unwrap(),
                окончание_строка: "ванному",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванность)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванность)$").unwrap(),
                окончание_строка: "ванность",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностью)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностью)$").unwrap(),
                окончание_строка: "ванностью",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванности)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванности)$").unwrap(),
                окончание_строка: "ванности",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностей)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностей)$").unwrap(),
                окончание_строка: "ванностей",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностям)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностям)$").unwrap(),
                окончание_строка: "ванностям",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностями)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностями)$").unwrap(),
                окончание_строка: "ванностями",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностях)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностях)$").unwrap(),
                окончание_строка: "ванностях",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванным)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванным)$").unwrap(),
                окончание_строка: "ванным",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванными)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванными)$").unwrap(),
                окончание_строка: "ванными",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванных)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванных)$").unwrap(),
                окончание_строка: "ванных",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванные)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванные)$").unwrap(),
                окончание_строка: "ванные",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванный)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванный)$").unwrap(),
                окончание_строка: "ванный",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
    ]
});*/
//
/*pub const КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН: [&'static str; 24] = [
    "ван",
    "вана",
    "вано",
    "ваны",
    "ваннее",
    //
    "ванная",
    "ванную",
    //о
    "ванной",
    "ванное",
    "ванного",
    //глаголы
    "ванном",
    "ванному",
    //ст
    "ванность",
    "ванностью",
    "ванности",
    "ванностей",
    "ванностям",
    "ванностями",
    "ванностях",
    //ы
    "ванными",
    "ванным",
    "ванных",
    "ванные",
    "ванный",
];*/
//
pub static ТОРЖОК_ОКОНЧАНИЙ: LazyLock<[Раздел_Торжка; 25]> = LazyLock::new(|| {
    [
        //
        Раздел_Торжка {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ван", "ен", "ён", "он", "ан", "ит", "ем", "ыт", "н", "в",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,

                    строка: "в",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(в)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ван",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ван)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ен",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ем",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ем)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ён",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ён)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "он",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(он)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ан",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ан)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ит",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ит)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыт",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыт)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                /*Вид_Окончания_со_строкой {
                    строка: "т",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)()$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "н",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(н)$").unwrap(),
                },
            ],
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
        },
        //вана
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вана", "ена", "ема", "она", "ана", "на", "ита", "ыта", "та", "ва",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ва",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вана",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вана)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ема",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ема)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "она",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(она)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ана",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ана)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ита",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ита)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыта",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыта)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "та",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "на",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                },
            ],
        },
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
                //Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваннее",
                "еннее",
                "емее",
                "ённее",
                "оннее",
                "аннее",
                "нее",
                "итее",
                "ытее",
                "тее",
                "щее",
                "вшее",
                "шее",
                "стее",
                "лее",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "щее",
                    вид_окончания: Вид_Окончания::_Щ,
                    re_выдер: Regex::new(r"(?i)(щее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваннее",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваннее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "еннее",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(еннее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённее",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ённее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емее",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оннее",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оннее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аннее",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аннее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итее",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытее",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "стее",
                    вид_окончания: Вид_Окончания::Ст,
                    re_выдер: Regex::new(r"(?i)(стее)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "лее",
                    вид_окончания: Вид_Окончания::_Л,
                    re_выдер: Regex::new(r"(?i)(лее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "шее",
                    вид_окончания: Вид_Окончания::_Ш,
                    re_выдер: Regex::new(r"(?i)(шее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тее",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тее)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    строка: "тее",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тее)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "нее",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(нее)$").unwrap(),
                },
            ],
        },
        //
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вано", "ено", "емо", "оно", "ано", "но", "ито", "ыто", "то",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вано",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вано)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емо",
                    вид_окончания: Вид_Окончания::Ем,

                    re_выдер: Regex::new(r"(?i)(емо)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оно)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ано",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ано)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ито",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ито)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыто",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыто)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "то",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    строка: "то",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "но",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(но)$").unwrap(),
                },
            ],
        },
        //оны
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Вш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваны", "ены", "емы", "оны", "аны", "ны", "иты", "ыты", "те", "ва",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ва",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(ва)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ваны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емы",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емы)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "оны",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "аны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "иты",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(иты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ыты",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ыты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "те",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(те)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ты",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(ты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ны",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ны)$").unwrap(),
                },
            ],
        },
        //ванный
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванный",
                "енный",
                "емый",
                "ённый",
                "онный",
                "анный",
                "ный",
                "итый",
                "ытый",
                "вший",
                "той",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вший",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вший)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                },
            ],
        },
        //ванных
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
              //  Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванных",
                //"венных",
                "енных",
                "емых",
                "ённых",
                "онных",
                "анных",
                "ных",
                "итых",
                "вших",
                "ытых",
                "тех",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емых",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итых",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытых",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вших",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вших)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тех",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тех)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венных",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венных)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённых",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тых",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ных",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ных)$").unwrap(),
                },
            ],
        },
        //ванным
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванным",
                // "венным",
                "енным",
                "емым",
                "ённым",
                "онным",
                "анным",
                "ным",
                "итым",
                "вшим",
                "ытым",
                "том",
                "тым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емым",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ным",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итым",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшим",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшим)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытым",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "том",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венным",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венным)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённым",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },
            ],
        },
        //ванными
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванными",
                //"венными",
                "енными",
                "емыми",
                "ёнными",
                "онными",
                "анными",
                "ными",
                "итыми",
                "вшими",
                "ытыми",
                "тыми",
                //"венными",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ёнными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итыми",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшими",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшими)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытыми",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытыми)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    строка: "венными",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венными)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емыми",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ными",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ными)$").unwrap(),
                },
            ],
        },
        //ванный
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванный",
                "енный",
                //"венный",
                "емый",
                "ённый",
                "онный",
                "анный",
                "ный",
                "итый",
                "вший",
                "ытый",
                "тый",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вший",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вший)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венный",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венный)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                },
            ],
        },
        //ванная
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
              //  Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванная",
                "енная",
                "емая",
                "ённая",
                "онная",
                "анная",
                "ная",
                "итая",
                "вшая",
                "ытая",
                "тая",
                //"венная",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванная)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венная",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венная)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емая",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итая",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшая",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытая",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытая)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённая",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тая",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тая",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ная",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ная)$").unwrap(),
                },
            ],
        },
        //ванную
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
              //  Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванную",
                "енную",
                "емую",
                "ённую",
                "онную",
                "анную",
                "ную",
                "итую",
                "вшую",
                "ытую",
                "тую",
                //"венную",
            ]),
            первая_очередь: vec![
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венную",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венную)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емую",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итую",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшую",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытую",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытую)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённую",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тую",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тую",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ную",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ную)$").unwrap(),
                },
            ],
        },
        //ванном
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванном",
                //"венном",
                "енном",
                "емом",
                "ённом",
                "онном",
                "анном",
                "ном",
                "итом",
                "вшем",
                "ытом",
                "том",
                "тым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емом",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итом",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшем",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшем)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытом",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытом)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венном",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венном)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённом",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "том",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ном",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ном)$").unwrap(),
                },
            ],
        },
        //ванному
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванному",
                //"венному",
                "енному",
                "емому",
                "ённому",
                "онному",
                "анному",
                "ному",
                "итому",
                "вшему",
                "ытому",
                "тому",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емому",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итому",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшему",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшему)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытому",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытому)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венному",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венному)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённому",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тому",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тому",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ному",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ному)$").unwrap(),
                },
            ],
        },
        //ванного
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванного",
                //"венного",
                "енного",
                "емого",
                "ённого",
                "онного",
                "анного",
                "ного",
                "итого",
                "вшего",
                "ытого",
                "того",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емого",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итого",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшего",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшего)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытого",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытого)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венного",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венного)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённого",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "того",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "того",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ного",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ного)$").unwrap(),
                },
            ],
        },
        //ванное
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
               // Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванное",
                //"венное",
                "енное",
                "емое",
                "ённое",
                "онное",
                "анное",
                "ное",
                "итое",
                "вшее",
                "ытое",
                "тое",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емое",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итое",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшее",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытое",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытое)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венное",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венное)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённое",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тое",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тое",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ное",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ное)$").unwrap(),
                },
            ],
        },
        //ванные
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
              //  Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванные",
                //"венные",
                "енные",
                "емые",
                "ённые",
                "онные",
                "анные",
                "ные",
                "итые",
                "вшие",
                "ытые",
                "тые",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емые",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итые",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшие",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшие)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытые",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытые)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венные",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венные)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённые",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ные",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тые",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                },
            ],
        },
        //ванной
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::from_iter([
              //  Text_Changer::Вид_Окончания::Авш,
            ]),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванной",
                //"венной",
                "енной",
                "емой",
                "ённой",
                "онной",
                "анной",
                "ной",
                "итой",
                "вшей",
                "ытой",
                "той",
            ]),
            первая_очередь: vec![
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венной",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венной)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емой",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итой",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшей",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытой",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытой)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённой",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "той",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ной",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ной)$").unwrap(),
                },
            ],
        },
        //ванность
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванность",
                //"венность",
                "енность",
                "емость",
                "ённость",
                "онность",
                "анность",
                "ность",
                "итость",
                "вшесть",
                "ытость",
                "тость",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емость",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итость",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшесть",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшесть)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытость",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытость)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венность",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венность)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённость",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тость",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тость",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ность",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ность)$").unwrap(),
                },
            ],
        },
        //ванностью
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностью",
                //"венностью",
                "енностью",
                "емостью",
                "ённостью",
                "онностью",
                "анностью",
                "ностью",
                "итостью",
                "вшестью",
                "ытостью",
                "тостью",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостью",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостью",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестью",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостью",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостью)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностью",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностью)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностью",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностью)$").unwrap(),
                },
            ],
        },
        //ванности
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванности",
                "емости",
                //"венности",
                "енности",
                "ённости",
                "онности",
                "анности",
                "ности",
                "итости",
                "вшести",
                "ытости",
                "тости",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емости",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онности",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анности",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итости",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшести",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшести)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытости",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытости)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венности",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венности)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енности",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённости",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тости",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тости",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ности",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ности)$").unwrap(),
                },
            ],
        },
        //ванностей
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностей",
                //"венностей",
                "енностей",
                "емостей",
                "ённостей",
                "онностей",
                "анностей",
                "ностей",
                "итостей",
                "вшестей",
                "ытостей",
                "тостей",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостей",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостей",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестей",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостей",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостей)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностей",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностей)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностей",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностей)$").unwrap(),
                },
            ],
        },
        //ванностям
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностям",
                //"венностям",
                "енностям",
                "емостям",
                "ённостям",
                "онностям",
                "анностям",
                "ностям",
                "итостям",
                "вшестям",
                "ытостям",
                "тостям",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостям",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостям",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестям",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостям",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостям)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностям",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностям)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностям",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностям)$").unwrap(),
                },
            ],
        },
        //ванностями
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностями",
                "енностями",
                //"венностями",
                "емостями",
                "ённостями",
                "онностями",
                "анностями",
                "ностями",
                "итостями",
                "вшестями",
                "ытостями",
                "тостями",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостями",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостями",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестями",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостями",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостями)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностями",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностями)$").unwrap(),
                },*/
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностями",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностями)$").unwrap(),
                },
            ],
        },
        //ванностях
        Раздел_Торжка {
            окончания_исключения: rapidhash::fast::RapidHashSet::default(),
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностях",
                //"венностях",
                "енностях",
                "емостях",
                "ённостях",
                "онностях",
                "анностях",
                "ностях",
                "итостях",
                "вшестях",
                "ытостях",
                "тостях",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ванностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "емостях",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостях)$").unwrap(),
                },
                /*Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "венностях",
                    вид_окончания: Вид_Окончания::Ва_Во,
                    re_выдер: Regex::new(r"(?i)(венностях)$").unwrap(),
                },*/
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "онностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "анностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "итостях",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "вшестях",
                    вид_окончания: Вид_Окончания::Вш,
                    re_выдер: Regex::new(r"(?i)(вшестях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ытостях",
                    вид_окончания: Вид_Окончания::Ыт,
                    re_выдер: Regex::new(r"(?i)(ытостях)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "енностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ённостях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::Та_то,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    часть_речи: Вид_части_речи::Не_определено,
                    строка: "ностях",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностях)$").unwrap(),
                },
            ],
        },
    ]
});
#[allow(non_camel_case_types)]
pub trait Возможности_торжка {
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_полное_окончание,
        изначальное_окончание: &RE_полное_окончание,
    ) -> Result<&Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>;
    //
    fn найти_окончание_к_слову_замене(
        &self,
        искомое_окончание: &str,
        ячейка_выдера: &Вид_Окончания_со_строкой,
    ) -> Result<&Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_в_торжке>;
    //
}
impl Возможности_торжка for [Раздел_Торжка] {
    /*fn проверить_на_соблюдение_правил(&self) -> Result<(), ()> {
        //прогон
        for раздел in self.iter() {}
    }*/
    //
    fn найти_окончание_к_слову_замене(
        &self,
        искомое_окончание: &str,
        ячейка_выдера: &Вид_Окончания_со_строкой,
    ) -> Result<&Вид_Окончания_со_строкой, Вид_ошибки_при_поиске_в_торжке> {
        //let mut найден_в_куче_окончаий: bool = false;
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел.куча_окончаний.contains(искомое_окончание)
            {
                //    найден_в_куче_окончаий = true;
                //если исключение
                if раздел
                    .окончания_исключения
                    .contains(&ячейка_выдера.вид_окончания)
                {
                    return Err(Вид_ошибки_при_поиске_в_торжке::Исключение);
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            /*println!(
                "найти_окончание_к_слову_замене -ищем окончание |{}|  в разделе |{:?}|",
                искомое_окончание,
                // искомое_окончание.as_bytes(),
                раздел.куча_окончаний,
            );*/
            /*for ячейка in раздел.куча_окончаний.iter() {
                println!("окончание |{}| побайтово |{:?}|", ячейка, ячейка.as_bytes());
            }*/
            if раздел.куча_окончаний.contains(искомое_окончание)
            {
                //
                println!(
                    "{}{}{}{}",
                    style(format!("найти_окончание_к_слову_замене - окончание ",)),
                    style(format!("|{}|", искомое_окончание)).cyan(),
                    style(format!(" найдено в разделе ",)),
                    style(format!("|{:?}|", раздел.куча_окончаний)).blue(),
                    /*"найти_окончание_к_слову_замене - окончание |{}| найдено в разделе |{:?}|",
                    искомое_окончание, раздел.куча_окончаний*/
                );
                let mut строка: String = String::new();
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                    строка = format!("{}+{}", строка, ячейка.вид_окончания.to_string());
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                    строка = format!("{}+{}", строка, ячейка.вид_окончания.to_string());
                }
                //
                println!(
                    "{}{}{}{}",
                    style(format!("не нашло  вид исходного окончания ",)),
                    style(format!("|{}|", ячейка_выдера.вид_окончания)).cyan(),
                    style(format!(" в ряде ",)),
                    style(format!("|{}|", строка)).blue(),
                    /*"не нашло  вид исходного окончания |{}| в ряде |{}|",
                    ячейка_выдера.вид_окончания,
                    строка*/
                );
                return Err(
                    Text_Changer::Вид_ошибки_при_поиске_в_торжке::Ошибка(format!(
                        "{}{}",
                        style(format!(
                            "найти_окончание_к_слову_замене - не нашло окончание для ",
                        )),
                        style(format!("|{}|", искомое_окончание)).cyan(),
                    )),
                );
            }
        }
        Err(
            Text_Changer::Вид_ошибки_при_поиске_в_торжке::Ошибка(
                format!(
                    "{}{}",
                    style(format!(
                        "найти_окончание_к_слову_замене - не нашло окончание для ",
                    )),
                    style(format!("|{}|", искомое_окончание)).cyan(),
                ),
            ),
        )
        //
    }
    //
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_полное_окончание,
        изначальное_окончание: &RE_полное_окончание,
    ) -> Result<&Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке>
    {
        use Text_Changer::{
            Возможноси_частей_речи, Ошибка_несоотвествия_части_речи, РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ,
        };
        let mut найден_в_куче_окончаний: bool = false;
        /*let mut вид_окончания_где_нашлось: Text_Changer::Вид_Окончания =
        Text_Changer::Вид_Окончания::Не_определено;*/
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&изначальное_окончание.окончание_строка)
            {
                найден_в_куче_окончаний = true;
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        let часть_речи_с_торжка = РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ
                            .определить_вид_части_речи_по_ячейке_торжка(
                                &ячейка,
                            )
                            .unwrap();
                        match Возможноси_частей_речи::допустима_ли_покупка(исключающее_окончание.части_речи, часть_речи_с_торжка) {
                            true=>return Ok(&ячейка),
                            //
                            false=>return  Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                Ошибка_несоотвествия_части_речи {
                                    выдер_изначальный:исключающее_окончание.части_речи,
                                    купленный_на_торжке:часть_речи_с_торжка,
                                }
                            )) ,
                        }
                    }
                }
                //
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        let часть_речи_с_торжка = РАЗДЕЛЫ_ОКОНЧАНИЙ_ПОЛНЫЕ
                            .определить_вид_части_речи_по_ячейке_торжка(
                                &ячейка,
                            )
                            .unwrap();
                        match Возможноси_частей_речи::допустима_ли_покупка(исключающее_окончание.части_речи, часть_речи_с_торжка) {
                            true=>return Ok(&ячейка),
                            //
                            false=>return  Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_соответствие_частей_речи(
                                Ошибка_несоотвествия_части_речи {
                                    выдер_изначальный:исключающее_окончание.части_речи,
                                    купленный_на_торжке:часть_речи_с_торжка,
                                }
                            )) ,
                        }
                    }
                }
            }
        }
        //перебор внутри
        /*for раздел in self.iter() {
            /*println!(
                "найти_окончание_выдера - ищем окончание |{}| в разделе |{:?}|",
                изначальное_окончание.окончание_строка, раздел.куча_окончаний,
            );*/
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&изначальное_окончание.окончание_строка)
            {
                //
                /*println!(
                    "найти_окончание_выдера - окончание |{}| найдено в разделе |{:?}|",
                    изначальное_окончание.окончание_строка, раздел.куча_окончаний
                );*/
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }*/
        return match найден_в_куче_окончаний{
            true=>  Err(Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Не_найдено_окончание_в_разделе_торжка_но_есть_в_куче) ,
            false=> Err( Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке::Нет_окончания_в_Торжке)
        };
        /* Err(format!(
            "Найти окончание выдера - не нашло окончание для |{}|",
            изначальное_окончание.re_поиска
        ))*/
    }
}

// счётчик_входа.fetch_add(1, Ordering::Relaxed);

/*pub fn проверка_конечных_окончаний_re_образцов() {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        проверка_среза_строк_на_неповтор(
            &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
            "КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН",
        );
    }

    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}*/
pub fn проверка_среза_строк_на_неповтор(
    срез: &[&'static str],
    имя_кучи: &str,
) {
    let mut куча: rapidhash::fast::RapidHashSet<&str> = rapidhash::fast::RapidHashSet::default();
    //сама проверка
    for ячейка in срез.iter() {
        if !куча.contains(ячейка) {
            куча.insert(ячейка);
        } else {
            println!("Куча |{}| повторно содержит образец |{}|", имя_кучи, ячейка)
        }
    }
}
//
pub static МЕСТОИМЕНИЯ: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // --- Личные (я, ты, мы, вы) ---
        "я",
        "меня",
        "мне",
        "мной",
        "мною",
        "обо мне",
        "ты",
        "тебя",
        "тебе",
        "тобой",
        "тобою",
        "о тебе",
        "мы",
        "нас",
        "нам",
        "нами",
        "о нас",
        "вы",
        "вас",
        "вам",
        "вами",
        "о вас",
        // --- Личные 3-го лица (он, она, оно, они) ---
        "он",
        "его",
        "ему",
        "им",
        "нем",
        "о нем",
        "она",
        "ее",
        "ей",
        "ею",
        "ней",
        "о ней",
        "оно",
        "его",
        "ему",
        "им",
        "нем",
        "о нем",
        "они",
        "их",
        "им",
        "ими",
        "них",
        "о них",
        // --- Возвратное (себя) ---
        "себя",
        "себе",
        "собой",
        "собою",
        "о себе",
    ])
});
//
pub static ДОПЫ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> =
    LazyLock::new(|| RapidHashSet::from_iter([]));
//
pub static НАРЕЧИЯ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // Возвратное (по-своему)
        "по-своему",
        // Личные (по-моему, по-твоему и т.д.)
        "по-моему",
        "по-твоему",
        "по-нашему",
        "по-вашему",
        // Местоимённые указательные
        "там",
        "тут",
        "сюда",
        "туда",
        "оттуда",
        "отсюда",
        "здесь",
        "так",
        "тогда",
        "потому",
        "поэтому",
        "затем",
        // Местоимённые определительные
        "всегда",
        "везде",
        "всюду",
        "повсюду",
        "по-иному",
        "по-всякому",
        // Вопросительно-относительные
        "как",
        "где",
        "куда",
        "откуда",
        "когда",
        "почему",
        "зачем",
        "отчего",
        // Неопределённые
        "как-то",
        "как-нибудь",
        "кое-как",
        "где-то",
        "где-либо",
        "где-нибудь",
        "кое-где",
        "когда-то",
        "когда-нибудь",
        "когда-либо",
        "зачем-то",
        "почему-то",
        // Отрицательные
        "никак",
        "нигде",
        "негде",
        "ниоткуда",
        "неоткуда",
        "никуда",
        "некуда",
        "никогда",
        "некогда",
        "незачем",
        // Определительные: качественные
        "быстро",
        "медленно",
        "весело",
        "громко",
        "хорошо",
        "дружно",
        "внимательно",
        "грубо",
        "молча",
        "правильно",
        "страшно",
        "чудовищно",
        "ярко",
        "смело",
        "горько",
        // Определительные: количественные
        "много",
        "мало",
        "приблизительно",
        "почти",
        "дважды",
        "вдвое",
        "втрое",
        "чуть-чуть",
        "очень",
        "весьма",
        "гораздо",
        "совершенно",
        "вдоволь",
        "дотла",
        "досыта",
        "крайне",
        "чрезмерно",
        "трижды",
        "вшестером",
        "пополам",
        "втройне",
        // Определительные: образа и способа действия
        "вручную",
        "вполголоса",
        "наизнанку",
        "шагом",
        "вплотную",
        "назубок",
        "искоса",
        "ощупью",
        "вдребезги",
        "кувырком",
        "крест-накрест",
        "басом",
        "вразвалку",
        "вплавь",
        "бегом",
        "верхом",
        "пешком",
        "плашмя",
        "вброд",
        "вприпрыжку",
        // Сравнительно-уподобительные
        "по-весеннему",
        "по-летнему",
        "по-осеннему",
        "по-зимнему",
        "по-детски",
        "по-дружески",
        "по-лисьи",
        "по-медвежьи",
        "по-отцовски",
        "по-матерински",
        "по-братски",
        // Совместности
        "вдвоём",
        "втроём",
        "впятером",
        "по двое",
        "по трое",
        "поочерёдно",
        // Обстоятельственные: места
        "далеко",
        "близко",
        "вблизи",
        "вдали",
        "вдалеке",
        "вдаль",
        "назад",
        "вперёд",
        "впереди",
        "позади",
        "сзади",
        "спереди",
        "слева",
        "справа",
        "налево",
        "направо",
        "вверху",
        "внизу",
        "наверху",
        "вниз",
        "вверх",
        "вбок",
        "набок",
        "вокруг",
        "рядом",
        "около",
        "возле",
        "издали",
        "издалека",
        "отовсюду",
        "оттуда",
        "изнутри",
        "снаружи",
        "поверх",
        "вглубь",
        "вширь",
        "навстречу",
        "посередине",
        "посреди",
        "вдалеке",
        "поблизости",
        "дома",
        "до́ма",
        // Обстоятельственные: времени
        "вчера",
        "сегодня",
        "завтра",
        "утром",
        "днём",
        "вечером",
        "ночью",
        "весной",
        "летом",
        "осенью",
        "зимой",
        "сейчас",
        "теперь",
        "тогда",
        "давно",
        "недавно",
        "издавна",
        "смолоду",
        "раньше",
        "прежде",
        "сперва",
        "сначала",
        "затем",
        "потом",
        "вовремя",
        "иногда",
        "всегда",
        "никогда",
        "допоздна",
        "затемно",
        "досветла",
        "долго",
        "недолго",
        "подолгу",
        "тотчас",
        "сразу",
        "наконец",
        "вскоре",
        "нескоро",
        "засветло",
        "на днях",
        "поутру",
        "вечор",
        "нонече",
        // Обстоятельственные: причины
        "сгоряча",
        "сдуру",
        "спьяну",
        "сослепу",
        "поневоле",
        "недаром",
        "почему",
        "потому",
        "оттого",
        "отчего",
        "волей-неволей",
        "неспроста",
        "спросонья",
        "со зла",
        "сослепу",
        // Обстоятельственные: цели
        "нарочно",
        "специально",
        "назло",
        "наперекор",
        "в шутку",
        "умышленно",
        "неумышленно",
        "в насмешку",
        "насмех",
        "невзначай",
        "напоказ",
        "зря",
        "бесцельно",
        "безрезультатно",
        // Производные от деепричастий
        "лёжа",
        "сидя",
        "стоя",
        "молча",
        "шутя",
        "нехотя",
        // Производные от наречий (с суффиксами)
        "рановато",
        "поздновато",
        "сыровато",
        "хорошенечко",
        "ранёхонько",
        "тихонько",
        "давненько",
        "поближе",
        "покрепче",
        "поменьше",
        "давным-давно",
        "полным-полно",
        // Непроизводные
        "вдруг",
        "еле-еле",
        "едва",
        "прежде",
        "весьма",
    ])
});

//
pub static ПРЕДЛОГИ_РУССКОГО_ЯЗЫКА: LazyLock<RapidHashSet<&'static str>> = LazyLock::new(|| {
    RapidHashSet::from_iter([
        // Непроизводные (первообразные) — ~25 единиц
        "без",
        "безо",
        "близ",
        "в",
        "во",
        "вне",
        "вопреки",
        "для",
        "до",
        "за",
        "из",
        "изо",
        "из-за",
        "из-под",
        "к",
        "ко",
        "кроме",
        "меж",
        "между",
        "на",
        "над",
        "надо",
        "о",
        "об",
        "обо",
        "от",
        "ото",
        "по",
        "под",
        "подо",
        "при",
        "про",
        "ради",
        "с",
        "со",
        "среди",
        "у",
        "через",
        "чрез",
        // Производные от наречий — наречные
        "вблизи",
        "вглубь",
        "вдоль",
        "взамен",
        "вместо",
        "внутри",
        "внутрь",
        "возле",
        "вокруг",
        "впереди",
        "навстречу",
        "напротив",
        "насквозь",
        "около",
        "поверх",
        "позади",
        "помимо",
        "поперёк",
        "после",
        "посреди",
        "посредине",
        "против",
        "сверх",
        "свыше",
        "сзади",
        "сквозь",
        "снизу",
        "согласно",
        "сообразно",
        "соответственно",
        "соразмерно",
        "спереди",
        "сродни",
        // Производные от существительных — отымённые
        "ввиду",
        "в виде",
        "в зависимости от",
        "в качестве",
        "в лице",
        "в отличие от",
        "в отношении",
        "в преддверии",
        "в продолжение",
        "в роли",
        "в силу",
        "в течение",
        "в целях",
        "вследствие",
        "за вычетом",
        "за исключением",
        "за счёт",
        "наподобие",
        "насчёт",
        "по мере",
        "по поводу",
        "по причине",
        "по случаю",
        "под видом",
        "посредством",
        "путём",
        "с помощью",
        "с точки зрения",
        // Производные от глаголов — отглагольные
        "благодаря",
        "включая",
        "исключая",
        "начиная с",
        "не считая",
        "несмотря на",
        "невзирая на",
        "спустя",
    ])
});
