use crate::ui_gpui::gpui_main::Данные_при_загрузке;
use console::style;
use rapidhash::RapidHashMap;
use regex::Regex;
use std::sync::LazyLock;
use std::sync::atomic::{AtomicBool, Ordering};
use std::time::Instant;
//use clap::builder::Str;
//use convert_case::{Case, Casing};
//use rapidhash::*;
use super::library::*;
use crate::utils::stringzilla::{
    sz_найти, sz_найти_в_str, sz_упорядочить_кучу_строк_rapid_в_ряд_строк,
};
use Text_Changer::{
    Вид_Окончания, Вид_ошибки_при_поиске_в_торжке
};
use rayon::prelude::*;

//

pub fn проверка_окончания_re_и_слова_через_sz_RE_исключающее_окончание(
    ячейка: &RE_исключающее_окончание,
) -> Result<(), String> {
    if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        return Err(format!(
            "В образце |{}| нет |{}|",
            &ячейка.re_образец.to_string(),
            ячейка.окончание_строка
        ));
    } else {
        return Ok(());
    }
}
pub fn проверка_окончания_re_и_слова_через_re_RE_исключающее_окончание(
    ячейка: &RE_исключающее_окончание,
) -> Result<(), String> {
    if !ячейка.re_образец.is_match(ячейка.окончание_строка)
    // if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        return Err(format!(
            "Образец RE |{}| не сходится с  |{}|",
            &ячейка.re_образец.to_string(),
            ячейка.окончание_строка
        ));
    } else {
        return Ok(());
    }
}
//
pub fn проверка_окончания_re_и_слова_RE_Окончания_Поиск(
    ячейка: &RE_Окончания_Поиск,
) -> Result<(), rapidhash::fast::RapidHashSet<String>> {
    let mut куча: rapidhash::fast::RapidHashSet<String> = rapidhash::fast::RapidHashSet::default();
    if !sz_найти_в_str(ячейка.re_поиска.as_str(), &ячейка.вид_окончания.to_string())
    {
        куча.insert(format!(
            "0-В образце re поиска |{}| нет окончания |{}|",
            ячейка.re_поиска.as_str(),
            ячейка.окончание_строка
        ));
    }
    if !sz_найти_в_str(ячейка.re_замена.as_str(), &ячейка.вид_окончания.to_string())
    {
        куча.insert(format!(
            "1-В образце re замены |{}| нет окончания |{}|, байты: re замены |{:?}| окончания |{:?}|",
            ячейка.re_замена.as_str(),
            ячейка.окончание_строка,
             ячейка.re_замена.as_str().as_bytes(),
               ячейка.окончание_строка.as_bytes(),
        ));
    }
    if !sz_найти_в_str(&ячейка.вид_окончания.to_string(), &ячейка.окончание_строка)
    {
        куча.insert(format!(
            "2-В образце (окончание_строка) |{}| нет окончания |{}|, байты: окончание_строка |{:?}| окончания |{:?}|",
            &ячейка.re_поиска.to_string(),
            ячейка.окончание_строка,
            &ячейка.re_поиска.to_string().as_bytes(),
            ячейка.окончание_строка.as_bytes(),
        ));
    }
    //
    if !sz_найти_в_str(&ячейка.re_поиска.as_str(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "3-В образце re поиска |{}| нет |{}|",
            &ячейка.re_поиска.to_string(),
            ячейка.окончание_строка
        ));
    }
    if !sz_найти_в_str(&ячейка.re_замена.as_str(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "4-В образце re замены |{}| нет |{}|",
            &ячейка.re_замена.to_string(),
            ячейка.окончание_строка
        ));
    }
    if !ячейка
        .re_поиска
        .is_match(&format!("добавка{}", ячейка.окончание_строка))
    // if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "5-Образец RE поиска |{}| не сходится с  |{}|",
            &ячейка.re_поиска.to_string(),
            format!("добавка{}", ячейка.окончание_строка)
        ));
    }
    if !ячейка.re_замена.is_match(ячейка.окончание_строка)
    // if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "6-Образец RE замены |{}| не сходится с  |{}|",
            &ячейка.re_замена.to_string(),
            ячейка.окончание_строка
        ));
    }
    match куча.is_empty() {
        true => Ok(()),
        false => return Err(куча),
    }
}
pub fn проверка_окончаний_включающих_re_образцов(//  стопка: &Окончания_включающие
) {
    проверка_конечных_окончаний_re_образцов();
    проверка_начальных_окончаний_re_образцов();
}
//
pub fn проверка_начальных_окончаний_re_образцов() {
    use crate::utils::functions::вывод_сообщений_на_экран;
    //if счётчик_входа.load(Ordering::Relaxed) == 0 {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    //сама проверка
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        //println!("Заход проверки lazy static");
        //проверка на повторы
        let куча: rapidhash::fast::RapidHashSet<String> =
            RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН
                .iter()
                .flat_map(|ячейка| {
                    проверка_окончания_re_и_слова_RE_Окончания_Поиск(
                               &ячейка.содержимое,
                           )
                           .err()
                           .into_iter()
                           .flatten()
                })
                .collect();

        let упорядоченный_ряд =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча);
        if упорядоченный_ряд.len() > 0 {
            //
            вывод_сообщений_на_экран(
                "RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН ошибки",
                &упорядоченный_ряд,
            );
        }
    }
    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}
//
pub fn проверка_окончаний_в_заменах_ен_исключениях() {
    use crate::utils::functions::вывод_сообщений_на_экран;
    //if счётчик_входа.load(Ordering::Relaxed) == 0 {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    //сама проверка
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        //println!("Заход проверки lazy static");
        //проверка на повторы
        let куча_1: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_sz_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //проверка на повторы
        let куча_2: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ПЕРВОЙ_ОЧЕРЕДИ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_re_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //
        let куча: rapidhash::fast::RapidHashSet<String> =
            куча_1.into_iter().chain(куча_2).collect();
        //
        //проверка на повторы
        let куча_1: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_sz_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //проверка на повторы
        let куча_2: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_re_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //
        let куча2: rapidhash::fast::RapidHashSet<String> =
            куча_1.into_iter().chain(куча_2).collect();
        //
        let куча: rapidhash::fast::RapidHashSet<String> = куча.into_iter().chain(куча2).collect();
        //
        let упорядоченный_ряд =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча);
        if упорядоченный_ряд.len() > 0 {
            //
            вывод_сообщений_на_экран(
                "RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ+RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ ошибки",
                &упорядоченный_ряд,
            );
        }
    }
    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}

pub fn найти_не_переведённые_слова_в_основном_словаре(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    данные_при_загрузке: &Данные_при_загрузке,
) -> Result<(), ()> {
    if данные_при_загрузке.не_загружать_основные_словари
    {
        return Ok(());
    }
    //
    let куча_не_добавленных_слов_из_главного_словаря_со_страницы_перевести: rapidhash::fast::RapidHashSet<usize> =
        основной_словарь.сам
            .перевести
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                //let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if !содержат_ли_слово_простые_кучи(
                    ячейка.искомое_слово.получить_ссылку_на_строку(),
                    &основной_словарь.кучи_простые.искомые,
                ) {
                    //если не содержит искомое слово кучи составные, составные важные и неимзенные коротки
                    if !содержат_ли_слово_3_кучи(
                        ячейка.искомое_слово.получить_ссылку_на_строку(),
                        &основной_словарь.кучи_простые.искомые,
                    ) {
                        Some(указатель)
                    } else {
                        None
                    }
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //
    //
    crate::output::write::вывод_основного_словаря_поискавшего(
        &куча_не_добавленных_слов_из_главного_словаря_со_страницы_перевести,
        &основной_словарь,
        //
    )
    .unwrap();

    Ok(())
}
//
pub fn сравнить_основной_и_запасной_словари(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    запасной_словарь: &Text_Changer::Словари_с_кучами,
    данные_при_загрузке: &crate::ui_gpui::gpui_main::Данные_при_загрузке,
) -> Result<(), ()> {
    println!(
        "Длина простых слов (всего): Основной - |{}| Запасной - |{}| поделажщих переводу |{}|",
        основной_словарь.сам.простое.len() / 3,
        запасной_словарь.сам.простое.len(),
        основной_словарь.сам.перевести.len(),
    );
    //
    println!(
        "Длина кучи простых слов главного словаря - |{}|",
        основной_словарь.кучи_простые.искомые[0].простое.len()
    );
    //
    /*let ссылка_кучи_простых_слов: &rapidhash::fast::RapidHashSet<String> =
    &основной_словарь.кучи_простые.искомые[0].простое;*/
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_словарь_запасной: rapidhash::fast::RapidHashSet<usize> =
        запасной_словарь
            .сам
            .простое
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                /*let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }*/
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !содержат_ли_слово_простые_кучи(
                    ячейка.искомое_слово.получить_ссылку_на_строку(),
                    &основной_словарь.кучи_простые.искомые,
                ) {
                    //если не содержит искомое слово кучи составные, составные важные и неимзенные коротки
                    if !содержат_ли_слово_3_кучи(
                        ячейка.искомое_слово.получить_ссылку_на_строку(),
                        &основной_словарь.кучи_простые.искомые,
                    ) {
                        Some(указатель)
                    } else {
                        None
                    }
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_страницу_не_переведённых_слов_главного_словаря: rapidhash::fast::RapidHashSet<usize> =
        основной_словарь.сам
            .перевести
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                /*let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }*/
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                //if !куча_переведенных_слов_в_запасном_словаре.contains(ячейка.искомое_слово.as_str())
                if !содержат_ли_слово_простые_кучи(ячейка.искомое_слово.получить_ссылку_на_строку(),  &запасной_словарь.кучи_простые.искомые)
                {
                    Some(указатель)
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //
    //
    println!(
        "Количество слов запасного словаря, которые отсутствуют в основном - |{}|",
        куча_указателей_на_словарь_запасной.len(),
    );
    println!(
        "куча_указателей_на_страницу_не_переведённых_слов_главного_словаря - |{}|",
        куча_указателей_на_страницу_не_переведённых_слов_главного_словаря.len(),
    );
    //
    crate::output::write::вывод_запасного_словаря_почищенного(
        &запасной_словарь,
        &куча_указателей_на_словарь_запасной,
        //
        &куча_указателей_на_страницу_не_переведённых_слов_главного_словаря,
        &основной_словарь,
        //
    )
    .unwrap();

    Ok(())
}
pub fn получить_замену(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    слово_искомое: &String,
) -> Result<String, String> {
    //
    let mut слово_замена: Text_Changer::Умная_Строка =
        Text_Changer::Умная_Строка::Пусто;
    //
    if let Some(значения) = основной_словарь.кучи_полные.искомые[0]
        .простое
        .get(слово_искомое)
    {
        let указатель: usize = значения.iter().copied().next().unwrap();
        //
        слово_замена = Text_Changer::Умная_Строка::создать_значение(
            основной_словарь.сам.простое[указатель].замена.clone(),
        );
        // }
    };
    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", слово_искомое));
        }
    }
}
/*pub fn получить_замену_по_указателю(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    ячейка: (
        &String,
        &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>,
    ),
) -> Result<String, String> {
    //
    //
    let указатель: usize = ячейка.1.iter().copied().next().unwrap();
    //
    let слово_замена = Text_Changer::Умная_Строка::создать_значение(
        основной_словарь.сам.простое[указатель].замена.clone(),
    );
    // }

    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", ячейка.0));
        }
    }
}*/
pub fn получить_указатель_на_слово_замену_из_кучи(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    ячейка: (
        &String,
        &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>,
    ),
) -> Result<usize, String> {
    //
    //
    let указатель: usize = ячейка.1.iter().copied().next().unwrap();
    //
    let слово_замена: &Text_Changer::Умная_Строка =
        &основной_словарь.сам.простое[указатель].замена;
    // }

    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(указатель);
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", ячейка.0));
        }
    }
}

//
fn если_нет_в_словаре_связки(
    словарь: &rapidhash::fast::RapidHashMap<String, rapidhash::fast::RapidHashSet<usize>>,
    искомое: String,
    замена: String,
) -> Option<(String, String)> {
    (!словарь.contains_key(&искомое)).then_some((искомое, замена))
}

//
pub fn найти_недостающие_слова(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
    пути_общие: &Text_Changer::Пути_Общие,
) -> Result<(), ()> {
    let куча_простых: &rapidhash::fast::RapidHashMap<String, rapidhash::fast::RapidHashSet<usize>> =
        &основной_словарь.кучи_полные.искомые[0].простое;
    if !данные_при_загрузке.проверка_недостающих_запрещённых_окончаний
    {
        return Ok(());
    }
    use Text_Changer::Вид_Окончания;
    проверка_окончаний_в_заменах_ен_исключениях();
    проверка_окончаний_включающих_re_образцов();
    //#![allow(non_snake_case, non_camel_case_types)]
    let время_отсчёта: Instant = Instant::now();
    // use crate::dictionary::выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания;
    use crate::output::write::вывод_недопустимых_и_недостающих_окончаний_в_xlsx;
    use crate::utils::stringzilla::sz_упорядочить_hashmap_в_слова_с_заменой;
    use Text_Changer::Слово_с_заменой;
    //

    //
    /*let куча_искомых_слов_с_указателями:rapidhash::fast::RapidHashMap<String, rapidhash::fast::RapidHashSet<usize>>=
    выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания(&основной_словарь.кучи.куча_словарь_искомые[0].простое,&основной_словарь.сам.простое);*/
    //

    // где-то в коде, один раз:
    let стопка_образцов_выдеров_окончаний: Окончания_включающие =
        Окончания_включающие {
            ячейка_re: &*RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН, // &[Regex; 1] → &[Regex] через coercion
            срез_окончаний: &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
        };
    //
    //
    //
    let время_отсчёта_недостающих_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недостающих окончаний"))
            .true_color(127, 255, 212)
            .bold(),
    );
    //
    /*for ячейка in основной_словарь.кучи_полные.искомые[0].простое.iter()
    {
        println!("слово |{}| куча-указатели |{:?}|", ячейка.0, ячейка.1);
    }*/
    /*let mut куча_сообщений: rapidhash::fast::RapidHashSet<String> =
    rapidhash::fast::RapidHashSet::default();*/
    //поиск строчного простого в куче полной (со ссылкой на ячейку словаря для получения замены)
    let стопка_недостающих_слов: RapidHashMap<String,String> = основной_словарь.кучи_полные.искомые[0]
        .простое
        .iter()
        .flat_map(|слово_в_куче: (&String, &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>)| {
    //ищем окончание для выдера
            стопка_образцов_выдеров_окончаний
                .ячейка_re
                .iter()
                .flat_map(|образец_re| {
                    if слово_в_куче.0.is_empty() {panic!("Есть пустое слово в перерводом |{}|",{
                        let указатель_на_слово_замена:usize = получить_указатель_на_слово_замену_из_кучи(
                            &основной_словарь,
                            слово_в_куче,
                        )
                        .unwrap();
                        //получаем ссылку
                        let слово_замена_исходное:&String=основной_словарь.сам.простое[указатель_на_слово_замена].замена.получить_ссылку_на_строку();
                        слово_замена_исходное

                    }
                    )}
                    //есть ли окончание по образцу в слове из кучи - если нет, то следующее слово
                    if !образец_re.содержимое.re_поиска.is_match(слово_в_куче.0) {
                        //вернуть пустую
                        return rapidhash::fast::RapidHashMap::default();
                    }
                    //
                    let указатель_на_слово_замена:usize = получить_указатель_на_слово_замену_из_кучи(
                        &основной_словарь,
                        слово_в_куче,
                    )
                    .unwrap();
                    //получаем ссылку
                    let слово_замена_исходное:&String=основной_словарь.сам.простое[указатель_на_слово_замена].замена.получить_ссылку_на_строку();
                    //
                    /*let слово_замена_исходное = получить_замену_по_указателю(
                        &основной_словарь,
                        слово_в_куче,
                    )
                    .unwrap();*/
                    let наличие_пробелов_в_слове_замене = есть_ли_пробелы_в_слове(слово_замена_исходное);
                    //искомое слово всегда обрезается успешно
                    let  обрезок_искомого_слова=образец_re.содержимое.re_замена.replace(слово_в_куче.0.as_str(), "").to_string();
                    //если нет такого окончания в слове - то следующее
                     let mut удачная_замена_окончания:bool=false;
                    //замена окончания
                        //объявляем обрезок
                         let обрезок_слова_замены: String=
                         match наличие_пробелов_в_слове_замене {
                             //если несколько слов в строке (не считая черты)
                             true=>слово_замена_исходное.clone(),
                             //если 1 слово в строке
                             false=>       {
                                 //
                                 if !образец_re.содержимое.re_поиска.is_match(&слово_замена_исходное) {
                                 //вернуть пустую
                                 //обрезок_слова_замены=слово_замена_исходное.clone();
                                 удачная_замена_окончания=false;
                                 слово_замена_исходное.clone()
                             } else {
                         удачная_замена_окончания=true;
                          образец_re.содержимое.re_замена.replace(слово_замена_исходное.as_str(), "").to_string()
                             }
                         },
                         };
                         //если обычный образец не подходит

                        //
                        if данные_при_загрузке.общий_ход {
                            println!("обрезок искомого слова |{обрезок_искомого_слова}| само слово исходное изначально |{}|\r\n",слово_в_куче.0);
                            if удачная_замена_окончания {
                                println!("удачная замена - обрезок_слова_замены |{обрезок_слова_замены}| само слово замена изначально |{}|\r\n",слово_замена_исходное);
                            } else {
                                 println!("Неудачная замена - обрезок_слова_замены |{обрезок_слова_замены}| образец для выдера |{}|\r\n", образец_re.содержимое.re_замена.to_string());
                            }
                        }
                    //
                    //проверяем всю кучу на предмет недостающих окончаний
                    стопка_образцов_выдеров_окончаний
                        .срез_окончаний
                        .iter()
                        .filter_map(|образец_окончания_неруского_слова| {
                            //
                            let искомое_слово_с_окончанием =
                                format!("{обрезок_искомого_слова}{образец_окончания_неруского_слова}");
                            //если слово уже есть в словаре - следующий исход
                            if куча_простых.contains_key(&искомое_слово_с_окончанием) {return None}
                            //если есть слово - то возращаем слово замену как есть
                            if наличие_пробелов_в_слове_замене {
                               /*return  Some(
                                    (искомое_слово_с_окончанием,обрезок_слова_замены.clone())
                                )*/
                                return если_нет_в_словаре_связки(&куча_простых,искомое_слово_с_окончанием,обрезок_слова_замены.clone());
                            }
                            //
                            if ИСКЛЮЧЕНИЯ_ПОИСКА_ВЫДЕРА.есть_ли_в_исключениях(обрезок_слова_замены.as_str(), образец_окончания_неруского_слова) { /*return  Some(
                                 (искомое_слово_с_окончанием,обрезок_слова_замены.clone())
                             )*/
                             return если_нет_в_словаре_связки(&куча_простых,искомое_слово_с_окончанием,обрезок_слова_замены.clone());
                            }
                            //
                            //теперь меняем окончание в слове-замене
                            let слово_замена_с_окончанием =
                                //
                            match удачная_замена_окончания {
                                //если удачно заменилось всё
                                true=>
                                format!("{обрезок_слова_замены}{образец_окончания_неруского_слова}"),
                                //если нужно найти окончание в торжке
                                false=>{//обрезок_слова_замены.clone();
                                    let окончание_для_выдера_в_замене:&Вид_Окончания_со_строкой;
                                    match найти_замену_для_выдера(&образец_re,&обрезок_слова_замены,слово_в_куче.0,образец_окончания_неруского_слова)  {
                                        Ok(успех)=>окончание_для_выдера_в_замене=успех,
                                        Err(ошибка)=>{
                                            println!("{}{}",
                                                style(format!("\r\n\t\t Неудача :")).red().bold(),

                                                 style(format!(" при поиске образца для выдера")).true_color(127, 255, 212).bold());
                                            //
                                              if наличие_пробелов_в_слове_замене {
                                            println!("наличие_пробелов_в_слове_замене |{наличие_пробелов_в_слове_замене}| в слове |{слово_замена_исходное}|");
                                              }
                                            let нужное_нерусское_слово:String=format!("{обрезок_искомого_слова}{образец_окончания_неруского_слова}");
                                          println!("{}{}{}{}{}{}{}{}{}",
                                                style(format!("\r\nОшибка0:")).yellow(),
                                              style(format!(" не-руское слово ")),
                                                   style(format!("|{}|",слово_в_куче.0)).cyan(),
                                                    style(format!(" слово-замена ")),
                                                       style(format!("|{}|",обрезок_слова_замены)).blue(),
                                                        style(format!(" нужное_нерусское_слово ")),
                                                             style(format!("|{нужное_нерусское_слово}|")).true_color(127,255,212),
                                                               style(format!(" искомое окончание на замену ")),
                                                                 style(format!("|{образец_окончания_неруского_слова}|")).red(),);

                                              /*\r\nОшибка0:искомое слово |{}| слово-замена |{}| нужное_нерусское_слово |{нужное_нерусское_слово}| искомое окончание на замену |{образец}|",
                                              слово_в_куче.0,обрезок_слова_замены);*/
                                              //
                                                println!("{}{}{}{}{}{}{}{}{}{}",
                                                        style(format!("Ошибка2:")).yellow(),
                                                        style(format!(" образец_re искомого слова [ ")),
                                                          style(format!(" образец поиска ")).bold(),
                                                     style(format!("|{}|",образец_re.содержимое.re_поиска)).cyan(),
                                                       style(format!(" re замена ")).bold(),
                                                        style(format!("|{}|",образец_re.содержимое.re_замена)).blue(),
                                                           style(format!(" вид окончания ")),
                                                            style(format!("|{}|",образец_re.содержимое.вид_окончания)).true_color(127,255,212),
                                                               style(format!(" окончание строка ")),
                                                                style(format!("|{}|",образец_re.содержимое.окончание_строка)).true_color(127,255,212),

                                                );
                                          /*println!("Ошибка2 :образец_re искомого слова [образец поиска|{}| re замены |{}| вид окончания |{}| окончание строка |{}|]\r\n",
                                              образец_re.содержимое.re_поиска,образец_re.содержимое.re_замена,образец_re.содержимое.вид_окончания,образец_re.содержимое.окончание_строка,
                                          );*/
                                          println!("{}",ошибка);
                                        //panic!("{}",ошибка)
                                        /*return Some(
                                            (искомое_слово_с_окончанием,слово_замена_исходное.clone())
                                        )*/
                                        return если_нет_в_словаре_связки(&куча_простых,искомое_слово_с_окончанием,слово_замена_исходное.clone());
                                        },

                                    };
                                    //
                                      let окончание_добавочное:&Вид_Окончания_со_строкой;
                                      match найти_добавочное_окончание(&образец_окончания_неруского_слова,&окончание_для_выдера_в_замене,слово_в_куче.0){
                                          Ok(успех)=>окончание_добавочное=успех,
                                          Err(вид_ошибки)=>{
                                              match вид_ошибки {
                                                  Text_Changer::Вид_ошибки_при_поиске_в_торжке::Исключение=>/*return Some(
                                                      (искомое_слово_с_окончанием,слово_замена_исходное.clone())
                                                  )*/
                                                  return если_нет_в_словаре_связки(&куча_простых,искомое_слово_с_окончанием,слово_замена_исходное.clone())
                                                  ,
                                                  Text_Changer::Вид_ошибки_при_поиске_в_торжке::Ошибка(ошибка)=> {
                                                      println!("{}{}",
                                                           style(format!("\r\n\t\t Неудача :")).red().bold(),
                                                          style(format!(" при поиске добавочного окончания")).true_color(127, 255, 212).bold());
                                                      //
                                                      if наличие_пробелов_в_слове_замене {
                                                         println!("наличие_пробелов_в_слове_замене |{наличие_пробелов_в_слове_замене}| в слове |{слово_замена_исходное}|");
                                                      }
                                                        let нужное_нерусское_слово:String=format!("{обрезок_искомого_слова}{образец_окончания_неруского_слова}");
                                                         println!("{}{}{}{}{}{}{}{}{}",
                                                              style(format!("\r\nОшибка0")).yellow(),
                                                             style(format!(" не-руское слово ")),
                                                                  style(format!("|{}|",слово_в_куче.0)).cyan(),
                                                                   style(format!(" слово-замена ")),
                                                                      style(format!("|{}|",обрезок_слова_замены)).blue(),
                                                                       style(format!(" нужное_нерусское_слово ")),
                                                                            style(format!("|{нужное_нерусское_слово}|")).true_color(127,255,212),
                                                                              style(format!(" искомое окончание на замену ")),
                                                                                style(format!("|{образец_окончания_неруского_слова}|")).red(),);
                                                         //
                                                      /*println!("\r\nОшибка0:искомое слово |{}| слово-замена |{}| нужное_нерусское_слово |{нужное_нерусское_слово}| искомое окончание на замену |{образец}|",
                                                          слово_в_куче.0,обрезок_слова_замены);*/
                                                         println!("{}{}{}{}{}{}{}{}",
                                                                  style(format!("Ошибка1:")).yellow(),
                                                              style(format!(" окончание_для_выдера в замене [ re ")),
                                                               style(format!("|{}|",окончание_для_выдера_в_замене.re_выдер)).cyan(),
                                                                style(format!(" вид ")),
                                                                        style(format!("|{}|",окончание_для_выдера_в_замене.вид_окончания)).blue(),
                                                                          style(format!(" окончание строка ")),
                                                                          style(format!("|{}|",окончание_для_выдера_в_замене.строка)).true_color(127,255,212),
                                                                            style(format!(" ]")),
                                                         );
                                                         //
                                                      /*println!("Ошибка1: окончание_для_выдера в замене [ re |{}| вид |{}| окончание строка |{}|]\r\n",
                                                          окончание_для_выдера_в_замене.re_выдер,окончание_для_выдера_в_замене.вид_окончания,окончание_для_выдера_в_замене.строка
                                                      );*/
                                                       println!("{}{}{}{}{}{}{}{}{}{}",
                                                           style(format!("Ошибка2:")).yellow(),
                                                       style(format!(" образец_re искомого слова [ ")),
                                                         style(format!(" образец поиска ")).bold(),
                                                        style(format!("|{}|",образец_re.содержимое.re_поиска)).cyan(),
                                                          style(format!(" re замены ")).bold(),
                                                                   style(format!("|{}|",образец_re.содержимое.re_замена)).blue(),
                                                                     style(format!(" вид окончания ")).bold(),
                                                                       style(format!("|{}|",образец_re.содержимое.вид_окончания)).true_color(127,255,212),
                                                                       style(format!(" окончание строка ")),
                                                                         style(format!("|{}|",образец_re.содержимое.окончание_строка)).red(),
                                                       );
                                                      /*println!("Ошибка2 :образец_re искомого слова [образец поиска|{}| re замены |{}| вид окончания |{}| окончание строка |{}|]\r\n",
                                                          образец_re.содержимое.re_поиска,образец_re.содержимое.re_замена,образец_re.содержимое.вид_окончания,образец_re.содержимое.окончание_строка,
                                                      );*/

                                                      println!("{ошибка}");
                                                      //panic!();
                                                      /*return Some(
                                                          (искомое_слово_с_окончанием,слово_замена_исходное.clone())
                                                      )*/
                                                      return если_нет_в_словаре_связки(&куча_простых,искомое_слово_с_окончанием,слово_замена_исходное.clone());
                                                  }

                                              }

                                          }
                                      };
                                        let обрезок_замены=окончание_для_выдера_в_замене.re_выдер.replace(&обрезок_слова_замены, "").to_string();
                                         let итог:String=format!("{}{}",обрезок_замены,окончание_добавочное.строка);
                                        //
                                      if данные_при_загрузке.общий_ход {
                                              println!("\r\nОшибка4:слово замена |{}| окончание_для_выдера в замене |{}| окончание_добавочное |{}| итог |{итог}|",
                                                  обрезок_слова_замены,окончание_для_выдера_в_замене.строка,окончание_добавочное.строка);
                                      }
                                      итог
                                },
                            };
                            return если_нет_в_словаре_связки(&куча_простых,искомое_слово_с_окончанием,слово_замена_с_окончанием);
                            //если куча окончаний строчных не содержит данное окончание
                            /*if !куча_простых
                                .contains_key(&искомое_слово_с_окончанием)
                            {
                                /*if данные_при_загрузке.общий_ход {
                                    println!("Добавляем: искомое_слово_с_окончанием |{искомое_слово_с_окончанием}| - слово_замена_с_окончанием |{слово_замена_с_окончанием}| слово_в_куче.0 |{}|\r\n",слово_в_куче.0);

                                }*/
                                Some(
                                    (искомое_слово_с_окончанием,слово_замена_с_окончанием)
                                )
                                //
                            } else {
                                None
                            }*/
                        })
                        .collect::<RapidHashMap<String,String>>()
                })
                .collect::<RapidHashMap<String,String>>()
        })
        .collect();
    //
    /*for сообщение in куча_сообщений.iter() {
        println!("{}", сообщение);
    }*/
    //кучу в общий вид привести с упорядочиванием
    let стопка_недостающих_слов: Vec<Слово_с_заменой> =
        sz_упорядочить_hashmap_в_слова_с_заменой(стопка_недостающих_слов);
    //вывод количества времени
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта_недостающих_окончаний.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    /*for ошибка in ряд_упорядоченный.iter() {
        println!(
            "{}{}{}{}",
            style(format!("Словарь ")),
            style(format!("|{вид_словаря}|")).red(),
            style(format!("не содержит ")),
            style(format!("|{ошибка}|")).cyan(),
        );
    }*/

    /*println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
    );*/
    let ряд_недопустимых_окончаний_общий =
        поиск_недопустимых_окончаний_в_искомых_и_заменах(
            &основной_словарь,
            &вид_словаря,
            &данные_при_загрузке,
        );
    //
    вывод_недопустимых_и_недостающих_окончаний_в_xlsx(
        &стопка_недостающих_слов,
        &ряд_недопустимых_окончаний_общий,
        &вид_словаря,
        &данные_при_загрузке,
        &пути_общие,
    )
    .unwrap();
    //output времени затраченного в итоге
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск и вывод недопустимых/недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    Ok(())
}
#[allow(non_camel_case_types)]
pub fn проверка_что_нет_пересечений_искомых_слов(
    основной_словарь: &Text_Changer::Полный_Словарь,
    куча_словарь_искомые: &[Text_Changer::Куча_Словарь_Искомые_простые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
    вид_словаря: &Text_Changer::Вид_Словаря,
) -> Result<(), ()> {
    use Text_Changer::Ячейка_словаря;
    let точка_отсчёта_по_времени_2: Instant = Instant::now();
    //
    const КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ: usize = 8;
    //
    pub struct Подробный_Раздел_Словаря<'a> {
        pub ячейки: &'a Vec<Ячейка_словаря>,
        pub куча: &'a rapidhash::fast::RapidHashSet<String>,
        pub имя_раздела: Text_Changer::Раздел_Словаря,
    }
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    //
    let указатели_раздела_словаря: [Подробный_Раздел_Словаря;
        КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ] = [
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное,
            куча: &куча_словарь_искомые[0].составное,
            имя_раздела: Text_Changer::Раздел_Словаря::Составные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_важное,
            куча: &куча_словарь_искомые[0].составное_важное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_важные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_длинное,
            куча: &куча_словарь_искомые[0].составное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые,
            куча: &куча_словарь_искомые[0].запятые,
            имя_раздела: Text_Changer::Раздел_Словаря::Запятые,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые_длинные,
            куча: &куча_словарь_искомые[0].запятые_длинные,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Запятые_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное,
            куча: &куча_словарь_искомые[0].неизменное,
            имя_раздела: Text_Changer::Раздел_Словаря::Неизменные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_короткое,
            куча: &куча_словарь_искомые[0].неизменное_короткое,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_длинное,
            куча: &куча_словарь_искомые[0].неизменное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_длинные,
        },
    ];
    //сама проверка
    for указатель_уровня in 0..КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ {
        let условие_поиска_заглавных: bool =
            match указатели_раздела_словаря[указатель_уровня].имя_раздела
            {
                Text_Changer::Раздел_Словаря::Составные
                | Text_Changer::Раздел_Словаря::Составные_важные
                | Text_Changer::Раздел_Словаря::Составные_длинные
                | Text_Changer::Раздел_Словаря::Запятые
                | Text_Changer::Раздел_Словаря::Запятые_длинные => true,
                _ => false,
            };
        //составные слова,запятые не надо проверять - там замена идёт по полному совпадению. Проверяем только неизменные
        /*if условие_поиска_заглавных {
            continue;
        }*/
        //
        /*println!(
            "Прооверка на пересечение искомых слов внутри себя - Длина раздела |{}| слов  |{}|  ",
            указатели_раздела_словаря[указатель_уровня].имя_раздела,
            if условие_поиска_заглавных {
                указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
            } else {
                указатели_раздела_словаря[указатель_уровня].ячейки.len()
            },
        );*/
        /*println!(
            "{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}|",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan()
        );*/
        //
        let указатель_раздела_словаря = &указатели_раздела_словаря[указатель_уровня];
        let указатель_раздела_кучи = &указатели_раздела_словаря[указатель_уровня];

        //
        //
        let куча_сообщений: rapidhash::fast::RapidHashSet<String> =
            указатель_раздела_словаря
                .ячейки
                .iter()
                .filter(|ячейка| {
                    if условие_поиска_заглавных {
                        let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                        //если первый знак большой - вернуть отказ
                        !ряд_знаков[0].is_uppercase()
                    } else {
                        true
                    }
                })
                .flat_map(|ячейка| {
                    //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                    //счётчик заглавных букв, 1 раз можно его поменять - дальше выдаст ошибку, что повторное слово
                    let счётчик: AtomicBool = AtomicBool::new(false);
                    //если протсые слова в главном словаре не содержат слово переведённое - вывести
                    указатель_раздела_кучи
                        .куча
                        .iter()
                        .filter_map(|слово_в_куче| {
                            //есть ли совпадение
                            if sz_найти(слово_в_куче, ячейка.искомое_слово.получить_ссылку())
                            {
                                if слово_в_куче.as_str() != ячейка.искомое_слово.as_str()
                                {
                                    //проверка было ли совпадение ранее 1
                                    let уже_было_совпадение =
                                        счётчик.fetch_or(true, Ordering::Relaxed);
                                    //если это 1 случай
                                    if !уже_было_совпадение {
                                        счётчик.fetch_and(true, Ordering::Relaxed);
                                        None
                                    }
                                    //если это не первый случай
                                    else {
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| повторно содержит себя |{}|",
                                            указатели_раздела_словаря
                                                [указатель_уровня]
                                                .имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                    };
                                    //если заглавные буквы (составные) - то проверять количество слов в слове  - то тут заменят полностью всё слово
                                    // соответственно надо првоерять если только слов больше
                                    match условие_поиска_заглавных {
                                        //
                                        true=> {//если есть совпадение - указать
                                        let количество_слов_в_искомом_слове =
                                            ячейка.искомое_слово.split_whitespace().count();
                                        //
                                        let количество_слов_в_слове_из_кучи =
                                            слово_в_куче.split_whitespace().count();
                                        //если разное количество слов - то вывести
                                        if количество_слов_в_слове_из_кучи!=количество_слов_в_искомом_слове{
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                        }
                                            //если одинаковое количество сллов - ничего не делать
                                        else {None}},
                                        //если неизменные - то тут заменят частично всё что ухавтит
                                        false=> Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        )),
                                        //
                                    }

                                } else {
                                    None
                                }
                            } else {
                                None
                            }
                        })
                        .collect::<rapidhash::fast::RapidHashSet<String>>()
                })
                .collect::<rapidhash::fast::RapidHashSet<String>>();
        //
        //если длина больше 0 -тогда вывести
        if указатели_раздела_словаря[указатель_уровня].ячейки.len() > 0
            || указатели_раздела_словаря[указатель_уровня].куча.len() > 0
        {
            //
            println!(
                "{}{}{}{}{}",
                style(format!(
                    "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела словаря ",
                ))
                .true_color(0, 255, 0),
                //
                style(format!(
                    "|{}| слов  ",
                    указатели_раздела_словаря[указатель_уровня].имя_раздела,
                ))
                .red(),
                style(format!(
                    "|{}| ",
                    if условие_поиска_заглавных {
                        указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                    } else {
                        указатели_раздела_словаря[указатель_уровня].ячейки.len()
                    }
                ))
                .cyan(),
                style(format!("Длина раздела кучи ",)).true_color(0, 255, 0),
                style(format!(
                    "|{}| ",
                    указатели_раздела_словаря[указатель_уровня].куча.len(),
                ))
                .red(),
            );
        }
        //
        куча_сообщений.iter().for_each(|сообщение| {
            println!("{}", сообщение);
        })
        //
        //}
    }
    //
    println!("{}",
             style(format!("⏰ |{}| Время занятое на соответствие проверку, что искомые слова не имеют схождений (итого): {:.2?}",
                                вид_словаря,
                                точка_отсчёта_по_времени_2.elapsed())).true_color(154, 136, 252)
    );
    //

    //

    Ok(())
}
pub fn найти_замену_для_выдера<'a>(
    образец_re: &'a Re_образцы,
    слово_замена: &'a String,
    искомое_слово: &String,
    образец_искомого_окончания: &str,
) -> Result<&'a Вид_Окончания_со_строкой, String> {
    use Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке;
    let mut есть_ли_вход_1: bool = false;
    let mut есть_ли_вход_2: bool = false;
    let mut ошибка_итог:Text_Changer::Вид_ошибки_при_поиске_выдера_в_торжке=Вид_ошибки_при_поиске_выдера_в_торжке::Не_определено;
    //
    for образец_частной_замены in образец_re.исключения_первой_очереди.iter()
    {
        /*println!(
            "образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            есть_ли_вход_1 = true;
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => ошибка_итог = ошибка, //return Err(ошибка),
            }
        }
    }
    //дальше во второй очереди берём
    for образец_частной_замены in образец_re.исключения_второй_очереди.iter()
    {
        /*println!(
            "образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            есть_ли_вход_2 = true;
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => ошибка_итог = ошибка, //return Err(ошибка),
            }
        }
    }
    //
    for образец_частной_замены in образец_re.исключения_первой_очереди.iter()
    {
        /*println!(
            "|исключения_первой_очереди|образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|  искомое_слово |{искомое_слово}|",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            //
            /*println!(
                "слово |{}| re образец |{}|",
                слово_замена, образец_частной_замены.re_образец
            );*/
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => (), //return Err(ошибка),
            }
        }
    }
    //
    for образец_частной_замены in образец_re.исключения_второй_очереди.iter()
    {
        /*println!(
            "|исключения_второй_очереди| образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|  искомое_слово |{искомое_слово}| ",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            //
            /*println!(
                "слово |{}| re образец |{}|",
                слово_замена, образец_частной_замены.re_образец
            );*/
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => (), //return Err(ошибка),
            }
        }
    }
    //вывод где найдено
    let в_каком_разделе_найдено= //первое условие
    if есть_ли_вход_1 {
        style(format!("|первой очереди| ",))
            .true_color(255, 165, 0) //оранжевый
            .bold()
    } else if есть_ли_вход_2 {
        style(format!("|второй_очереди| ",))
            .true_color(255, 165, 0) //оранжевый
            .bold()
    } else
    if !есть_ли_вход_2&&!есть_ли_вход_1 {
        style(format!("|нигде нет| ",)).bold()
    } else if есть_ли_вход_2&&есть_ли_вход_1 {
         style(format!("|в обоих кучах| ",)).red().bold()
    }else {
        panic!()
    };
    //вывод оибки
    let ошибка2: String = format!(
        "{}{}{}{}{}{}{}{}{}{}{}{}{}{}",
        style(format!("Ошибка")).red().bold(),
        style(format!(" найти_замену_для_выдера")).blue(),
        style(format!(" - ")),
        style(format!("ничего не нашло для слова-замены ")).cyan(),
        style(format!("|{}| ", слово_замена)).red(),
        style(format!("найдено в ")),
        в_каком_разделе_найдено,
        style(format!(" причина ошибки ")),
        style(format!("|{}| ", ошибка_итог)).true_color(123, 104, 238),
        style(format!("|{}| ", слово_замена)).red(),
        style(format!(" не-руское слово ")),
        style(format!("|{}|", искомое_слово)).green(),
        style(format!(" образец_искомого_окончания ")),
        style(format!("|{}|", образец_искомого_окончания)).yellow(),
    );
    //
    //println!("{}", ошибка);*/
    //
    return Err(ошибка2);
}
pub fn найти_добавочное_окончание<'a>(
    образец: &'a str,
    выдер: &'a Вид_Окончания_со_строкой,
    искомое_слово: &String,
) -> Result<&'a Вид_Окончания_со_строкой, Text_Changer::Вид_ошибки_при_поиске_в_торжке> {
    //

    //идёт в торжок обменивать окончание
    match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_к_слову_замене(образец, &выдер)
    {
        Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
        Err(вид_ошибки) => {
            match вид_ошибки {
                Вид_ошибки_при_поиске_в_торжке::Ошибка(ошибка)=>
                return Err(Text_Changer::Вид_ошибки_при_поиске_в_торжке::Ошибка(format!(
                    "{}{}{}",
                    style(format!("Ошибка")).red().bold(),
                    style(format!(" найти_добавочное_окончание ")),
                    style(format!(" {ошибка} "))
                ))),
                Вид_ошибки_при_поиске_в_торжке::Исключение=> return Err(Вид_ошибки_при_поиске_в_торжке::Исключение),
            }

        }
    }

    //
    //return Err(format!("ничего не нашло"));
}

pub fn поиск_недопустимых_окончаний_в_искомых_и_заменах(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
) -> Vec<String> {
    use crate::utils::stringzilla::sz_упорядочить_кучу_строк_rapid_в_ряд_строк;

    let время_отсчёта_недопустимых_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недопустимых окончаний")).yellow(),
    );
    //
    let mut куча_недопустимых_окончаний_общий: rapidhash::fast::RapidHashSet<String> =
        rapidhash::fast::RapidHashSet::default();
    //
    for раздел in СТОПКА_ЛОЖНЫХ_ОКОНЧАНИЙ.iter() {
        //
        for образец in раздел.ряд_re.iter() {
            //
            let куча_исходных_слов: rapidhash::fast::RapidHashSet<String> =
                основной_словарь.кучи_полные.искомые[0]
                    .простое
                    .iter()
                    .filter_map(|слово_в_куче| {
                        //ссылка на исходное слово
                        let исходное_слово: &String = слово_в_куче.0;
                        //
                        //если есть совпадение исходного слова и RE образца
                        if образец.is_match(исходное_слово.as_str()) {
                            //
                            if есть_ли_слово_в_куче_исключений_ложных_окончаний(&исходное_слово,& раздел.ряд_исключений) {return None }
                             Some(исходное_слово.clone())
                        } else {None}
                    })
                    .collect::<rapidhash::fast::RapidHashSet<String>>();
            //
            куча_недопустимых_окончаний_общий.extend(куча_исходных_слов);
            //слова_замены
            let куча_слов_замен: rapidhash::fast::RapidHashSet<String> =
                основной_словарь.кучи_полные.искомые[0]
                    .простое
                    .iter()
                    .filter_map(|слово_в_куче| {
                        //ссылка на слово замену
                        let указатель_на_слово_замена:usize = получить_указатель_на_слово_замену_из_кучи(
                            &основной_словарь,
                            слово_в_куче,
                        )
                        .unwrap();
                        //получаем ссылку
                        let слово_замена:&String=основной_словарь.сам.простое[указатель_на_слово_замена].замена.получить_ссылку_на_строку();
                        //
                        //если есть совпадение  слова замены и RE образца
                        if образец.is_match(слово_замена.as_str()) {
                            //
                            if есть_ли_слово_в_куче_исключений_ложных_окончаний(&слово_замена,& раздел.ряд_исключений) {return None }
                             Some(слово_замена.clone())
                        } else {None}
                    })
                    .collect::<rapidhash::fast::RapidHashSet<String>>();
            //
            куча_недопустимых_окончаний_общий.extend(куча_слов_замен);
            //
        }
        //
    }
    let ряд_недопустимых_окончаний_общий =
        sz_упорядочить_кучу_строк_rapid_в_ряд_строк(
            куча_недопустимых_окончаний_общий,
        );
    //
    println!(
            "{}",
            style(format!(
                "⌚  Время занятое всего выполнения поиск недопустимых окончаний (от начала до конца): {:.2?}",
                время_отсчёта_недопустимых_окончаний.elapsed()
            ))
            .true_color(198, 100, 72)
        );
    return ряд_недопустимых_окончаний_общий;
}
pub fn есть_ли_пробелы_в_слове(слово: &String) -> bool {
    //let количество = слово.matches([' ', ' ']).count();
    // хорошо (увидит все виды пробелов):
    let количество = слово.chars().filter(|знак| знак.is_whitespace()).count();
    // let количество_черт_в_слове: usize = слово.matches(['-', '—', '–']).count();
    if количество > 0 {
        true
    } else {
        false
    }
}
//
pub fn есть_ли_слово_в_куче_исключений_ложных_окончаний(
    слово: &String,
    куча_исключений: &'static rapidhash::fast::RapidHashSet<&'static str>,
) -> bool {
    match есть_ли_пробелы_в_слове(слово) {
        true => {
            let раздел: Vec<&str> = слово.split_whitespace().collect();
            for выделенное_слово in раздел.iter() {
                //
                if куча_исключений.contains(выделенное_слово) {
                    return true;
                }
            }
        }
        //это одно слово
        false => {
            if куча_исключений.contains(слово.as_str()) {
                return true;
            }
        }
    }
    false
}
pub fn содержат_ли_слово_3_кучи(
    слово: &String,
    кучи: &[Text_Changer::Куча_Словарь_Искомые_простые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
) -> bool {
    //
    for уровень in кучи.iter() {
        //
        if уровень.составное.contains(слово) {
            return true;
        }
        //
        if уровень.составное_важное.contains(слово) {
            return true;
        }
        //
        if уровень.неизменное_короткое.contains(слово) {
            return true;
        }
    }
    //
    false
}
pub fn содержат_ли_слово_простые_кучи(
    слово: &String,
    кучи: &[Text_Changer::Куча_Словарь_Искомые_простые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
) -> bool {
    //
    for уровень in кучи.iter() {
        //
        if уровень.простое.contains(слово) {
            return true;
        }
        //
        /*if уровень.составное_важное.contains(слово) {
            return true;
        }
        //
        if уровень.неизменное_короткое.contains(слово) {
            return true;
        }*/
    }
    //
    false
}
