//use gpui_kit::component::text::Text;
//use encoding_rs::WINDOWS_1251;
//use encoding_rs_io::DecodeReaderBytesBuilder;
//use foldhash::{rapidhash::fast::RapidHashMap, HashSet, HashSetExt, fast::RandomState};
use regex::Regex;
//use std::fmt;
//use std::fs::File;
//use std::io::prelude::*;
//use std::io::{Cursor, Seek, SeekFrom, Write};
//use crate::write;
use crate::utils::functions::вывод_сообщения_на_экран_и_вложение_в_кучу;
use crate::utils::read::*;
use crate::utils::stringzilla::sz_найти_в_умной_строке;
use crate::utils::zip::zip_архив_в_память;
use crate::utils::zip::Архив_в_озу;
use Text_Changer::{ВСЕГО_ШАГОВ, ПУТИ_ОБЩИЕ};
use console::style;
use std::sync::LazyLock;
use std::time::{
    //Duration,
    Instant,
};
extern crate rayon;
use rayon::prelude::*;

use Text_Changer::{
    self,
    //Dictionary
};
//use crate::utils::functions_add::system_pause;
//use crate::utils::functions_txt::*;
use crate::utils::regex::re_получить_строку_с_описанием;

//use std::path::Path;
//use clap::builder::Str;
//use std::fs::File;
use std::sync::{Arc, Mutex};
//use walkdir::{DirEntry, WalkDir};
//use xml::Encoding::Default;
use crate::ALLOCATOR;
use crate::utils::stringzilla::sz_найти;
//use Text_Changer::Кодировка;
//use cap::Cap;
//use std::alloc;

//use std::collections::rapidhash::fast::RapidHashMap;

// 1. Публичная регулярка
pub static RE_РАСШИРЕНИЕ_ФАЙЛА_C_ТОЧКОЙ: LazyLock<Regex> =
    LazyLock::new(|| Regex::new(r"(?i)(?:\.)+([\d\w\s&&[^\.]]+)$").unwrap());
/*
// 2. Без точки
static RE_РАСШИРЕНИЕ_ФАЙЛА_БЕЗ_ТОЧКИ: LazyLock<Regex> =
    LazyLock::new(|| Regex::new(r"(?i)(?:\/.)+([\d\w]+)$").unwrap());

// 3. Третий случай
static RE_РАСШИРЕНИЕ_ФАЙЛА_3_Й_СЛУЧАЙ: LazyLock<Regex> =
    LazyLock::new(|| Regex::new(r"(?i)(?:\\)+([\d\w_-]+)$").unwrap());
*/

// 4. Имя файла
//static RE_ИМЯ_ФАЙЛА: LazyLock<Regex> =
//  LazyLock::new(|| Regex::new(r"\.\*/*книги\\*/*(.+)\.(?:[\d\w&&[^\.]]+)").unwrap());*/
//имя словаря вырезать
use crate::ui_gpui::gpui_main::Данные_при_загрузке;
use crate::utils::read::получить_содержимое;
//Чтение файлов
//1 - книги, 2 - словари
pub fn считать_словари() -> Vec<Text_Changer::Умная_Строка> {
    //основной путь
    //let пути_общие: Text_Changer::Пути_Общие = Default::default();
    //получение значение корневого доступа к скрипту (где он лежит, как решила ОС)
    //получение словарей
    let пути_до_словарей: Vec<Text_Changer::Умная_Строка> =
        получить_содержимое(&ПУТИ_ОБЩИЕ.словари);
    return пути_до_словарей;
}

pub fn считать_книги(
    сообщения_приход: &mut Text_Changer::Сообщения_считывания_книг,
    данные_при_загрузке: &Данные_при_загрузке,
) -> Text_Changer::Книги_в_ОЗУ {
    use Text_Changer::{Вид_Книги, Основной_Вид_Расширения};
    // use crate::utils::functions::*;
    //use crate::utils::functions_add::прочитать_содержимое_построчно;
    //use crate::utils::read::*;
    use crate::utils::regex::определить_имя_книги;
    //use crate::utils::zip::{zip_архив_в_память, Архив_в_озу};
    use std::default::Default;
    //время, занятое на этот шаг
    let точка_отсчёта_по_времени: Instant = Instant::now();
    // Set the limit to 30000MiB.
    // ALLOCATOR.set_limit(30000 * 1024 * 1024).unwrap();
    //если не надо переводить
    if !данные_при_загрузке.включить_перевод {
        println!("Считывание книг отменено");
        return Default::default();
    }
    //
    let куча_нераспознанных_расширений: Arc<Mutex<rapidhash::fast::RapidHashSet<String>>> =
        Arc::new(Mutex::new(rapidhash::fast::RapidHashSet::default()));
    //вывод этапа
    println!(
        "{}",
        style(format!("\t[1/{ВСЕГО_ШАГОВ}]: Считывание книг")).yellow(),
    );

    //получение книг
    let пути_до_книг: Vec<Text_Changer::Умная_Строка> =
        получить_содержимое(&ПУТИ_ОБЩИЕ.книги);
    //получение словарей

    //получение книг
    let стопки_книг: Vec<Text_Changer::Книга_с_сообщениями> = пути_до_книг
        .par_iter()
        .enumerate()
        .filter_map(|(_i, путь)| {
            if sz_найти_в_умной_строке(&путь, r#"\"#) | sz_найти_в_умной_строке(&путь, r#"\\"#) {
                println!("путь с палкой: {путь}");
            };
            //открытие файла с библиотекой
            //расширение файла
            let mut расширение_строка: Text_Changer::Умная_Строка =
                match re_получить_строку_с_описанием(
                    &путь,
                    &RE_РАСШИРЕНИЕ_ФАЙЛА_C_ТОЧКОЙ,
                    "Не удалось выдрать расширение файла с точкой",
                ) {
                    Ok(путь) => путь,
                    Err(_) => Text_Changer::Умная_Строка::Пусто,
                    /*match re_получить_строку_с_описанием(
                                        &путь,
                                        &re_расширение_файла_без_точки,
                                        "Не удалось выдрать расширение файла без точки",
                                    ) {

                                        Ok(исход_2) => исход_2,
                                        Err(_) =>
                                            match re_получить_строку_с_описанием(
                                                &путь,
                                                &re_расширение_файла_3_й_случай,
                                                "Не удалось выдрать расширение файла 3-й случай",
                                            ) {
                                                Ok(исход_3)=>исход_3,
                                                Err(_) =>panic!("Не удалось извлечь расширение файла без точки и с точкой: {}", путь),
                                    }
                                    }
                    */
                };
            //
            let расширение_самой_книги_подробно: Text_Changer::Основной_Вид_Расширения = определить_расширение_подробно(
                &расширение_строка.to_lowercase());
                //&mut куча_нераспознанных_расширений.lock().unwrap());
            if расширение_строка.len() > 6 && !расширение_самой_книги_подробно.без_названия()
            {
                println!("Путь, где расширение больше 6 букв |{путь}|");
                println!("Расширение больше 6 букв |{расширение_строка}|");
                расширение_строка = Text_Changer::Умная_Строка::Пусто
            };
            let  расширение_полное: Text_Changer::Расширение_полное=Text_Changer::Расширение_полное{
                строка:расширение_строка.clone(),
                вид:расширение_самой_книги_подробно.clone(),
                };
            //имя файла
            let название_книги: Text_Changer::Умная_Строка = определить_имя_книги(путь);

            let книга_итог:Text_Changer::Книга_с_сообщениями=match  &расширение_самой_книги_подробно {
            Text_Changer::Основной_Вид_Расширения::Книга(содержимое) => {
                match содержимое {
                    Вид_Книги::Архивная(_) => считывание_книги_архивной(&путь,&расширение_полное,&название_книги).unwrap(),
                    Вид_Книги::Одиночная(_)=>считывание_книги_одиночной_решение(&путь,&расширение_полное,&название_книги).unwrap(),
                    //_=>Default::default(),
                }
            },
            Основной_Вид_Расширения::Разметка_Паутины(_)|Основной_Вид_Расширения::Мусорная_Разметка(_)|Основной_Вид_Расширения::XML(_)|Основной_Вид_Расширения::Реклама_html(_)=>
            считывание_файла_строк_htm_решение(&путь,&расширение_полное,&название_книги).unwrap(),
            //одиночный файл со строками

            |Основной_Вид_Расширения::JS(_)|Основной_Вид_Расширения::Простая_письменность(_)|Основной_Вид_Расширения::Приказы(_)|Основной_Вид_Расширения::Пусто|Основной_Вид_Расширения::Без_Названия

            =>считывание_файла_строк_построчно(&путь,&расширение_полное,&название_книги).unwrap(),
            _=>считывание_файла_как_путь(&путь,&расширение_полное,&название_книги).unwrap(),
            //
            };
            Some(книга_итог)
        })
        .collect();
    //
    let mut содержимое_папки: Text_Changer::Содержимое_папок =
        Text_Changer::Содержимое_папок::из_стопки_книг(&стопки_книг);
    let mut содержимое_файлов: Text_Changer::Сообщения_считывания_книг =
        Text_Changer::Сообщения_считывания_книг::из_стопки_книг(
            &стопки_книг,
        );
    //перебор содержимого книги на предмет наличия трех точек подряд
    crate::output::write::вывод_содержимого_папок_по_умолчанию(
        &mut содержимое_папки,
        "книги",
        &mut содержимое_файлов.общие,
        &данные_при_загрузке,
    )
    .unwrap();
    crate::output::dir::заменить_путь_выходным_книгам(
        &mut содержимое_папки.файлы,
        "книги",
    );

    содержимое_файлов
        .проверка_после_замен
        .extend(vec![Default::default(); стопки_книг.len()]);
    //println!("количество в стопке: {}",&сообщения.проверка_после_замен.len());
    *сообщения_приход = содержимое_файлов;
    //вывод этапа
    let количество_мегабайт: usize = (ALLOCATOR.allocated() / 1024) / 1024;
    println!(
        "{}{}",
        style(format!(
            "\tВыделено памяти на этапе [1/{ВСЕГО_ШАГОВ}]: Считывание книг:  "
        ))
        .bold(),
        style(format!("Мегабайт: {}", количество_мегабайт))
            .true_color(127, 255, 212)
            .bold(),
    );
    //вывод отчёта по времени, занятого на этот шаг
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое на чтение книг: {:.2?}",
            точка_отсчёта_по_времени.elapsed()
        ))
        .true_color(154, 136, 252)
    );
    //
    let куча_нераспознанных_расширений: rapidhash::fast::RapidHashSet<String> =
        Arc::try_unwrap(куча_нераспознанных_расширений)
            .unwrap()
            .into_inner()
            .unwrap();
    //
    for расширение in куча_нераспознанных_расширений {
        println!("Не распознанное расширение: {}", расширение);
    }

    return Text_Changer::Книги_в_ОЗУ {
        книги: стопки_книг.into_iter().map(|ячейка| ячейка.книга).collect(),
        размер_в_озу: количество_мегабайт,
    };
}
pub fn определить_расширение_подробно(
    расширение: &str,
    // куча: &mut rapidhash::fast::RapidHashSet<String>,
) -> Text_Changer::Основной_Вид_Расширения {
    if расширение.is_empty() {
        return Text_Changer::Основной_Вид_Расширения::Пусто;
    }
    match расширение {
        "md"=>Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Md),
        "ncx"=>Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Ncx),
        "opf"=>Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Opf),
        "xhtml"=> Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Xhtml),
        "ttf"=> Text_Changer::Основной_Вид_Расширения::Шрифты(Text_Changer::Вид_Шрифтов::Ttf),
         "otf"=> Text_Changer::Основной_Вид_Расширения::Шрифты(Text_Changer::Вид_Шрифтов::Otf),
        "txt" => Text_Changer::Основной_Вид_Расширения::Простая_письменность(Text_Changer::Вид_простой_письменности::Txt),
        "docx" => Text_Changer::Основной_Вид_Расширения::Word(Text_Changer::Вид_Word::Docx),
        "xlsx" => Text_Changer::Основной_Вид_Расширения::Excel(Text_Changer::Вид_Excel::Xlsx),
        "log" => Text_Changer::Основной_Вид_Расширения::Простая_письменность(Text_Changer::Вид_простой_письменности::Log),
        "html" => Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Html),
        "htm" => Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Htm),
        "png" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Png),
        "jpg" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Jpg),
        "jpeg" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Jpeg),
        "svg" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Svg),
        "gif" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Gif),
        "bmp" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Bmp),
        "tif" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Tif),
        "tiff" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Tiff),
        "jpe" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Jpe),
        "avif" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Avif),
        "webp" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Webp),
        "wmf" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Wmf),
        "wpg" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Wpg),
        "eps" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Eps),
        "epub" => Text_Changer::Основной_Вид_Расширения::Книга(Text_Changer::Вид_Книги::Архивная(Text_Changer::Вид_Архивной_Книги::Epub)),
        "fb3" => Text_Changer::Основной_Вид_Расширения::Книга(Text_Changer::Вид_Книги::Архивная(Text_Changer::Вид_Архивной_Книги::Fb3)),
        "php" => Text_Changer::Основной_Вид_Расширения::Разметка_Паутины(Text_Changer::Вид_Разметки_Паутины::Php),
        "css" => Text_Changer::Основной_Вид_Расширения::Мусорная_Разметка(Text_Changer::Вид_Мусорные_Разметки_Паутины::Css),
        "fb2" => Text_Changer::Основной_Вид_Расширения::Книга(Text_Changer::Вид_Книги::Одиночная(Text_Changer::Вид_одичноной_книги::Fb2)),
        "xml" => Text_Changer::Основной_Вид_Расширения::XML(Text_Changer::Вид_XML::Xml),
                "rels" => Text_Changer::Основной_Вид_Расширения::XML(Text_Changer::Вид_XML::Rels),
        "gz" => Text_Changer::Основной_Вид_Расширения::Архив(Text_Changer::Вид_Архива::Gz),
        "gzip" => Text_Changer::Основной_Вид_Расширения::Архив(Text_Changer::Вид_Архива::Gzip),
        "emf" => Text_Changer::Основной_Вид_Расширения::Изображение(Text_Changer::Вид_Изображения::Emf),
        "js" => Text_Changer::Основной_Вид_Расширения::JS(Text_Changer::Вид_JS::Js),
        "mjs" => Text_Changer::Основной_Вид_Расширения::JS(Text_Changer::Вид_JS::Mjs),
        "cjs" => Text_Changer::Основной_Вид_Расширения::JS(Text_Changer::Вид_JS::Cjs),
        "thmx" => Text_Changer::Основной_Вид_Расширения::Мусорная_Разметка(Text_Changer::Вид_Мусорные_Разметки_Паутины::Thmx),
        "tcl" => Text_Changer::Основной_Вид_Расширения::Приказы(Text_Changer::Вид_приказов::Tcl),
        "fcg" => Text_Changer::Основной_Вид_Расширения::Приказы(Text_Changer::Вид_приказов::Fcg),
        "cgi" => Text_Changer::Основной_Вид_Расширения::Приказы(Text_Changer::Вид_приказов::Cgi),
        "без названия" => Text_Changer::Основной_Вид_Расширения::Без_Названия,
        "cnt" => Text_Changer::Основной_Вид_Расширения::Справка(Text_Changer::Вид_Справи::Cnt),
        "hlp" => Text_Changer::Основной_Вид_Расширения::Справка(Text_Changer::Вид_Справи::Hlp),
        "chm" => Text_Changer::Основной_Вид_Расширения::Справка(Text_Changer::Вид_Справи::Chm),
        "pdf"=> Text_Changer::Основной_Вид_Расширения::Pdf,
        "ru" => Text_Changer::Основной_Вид_Расширения::Реклама_html(Text_Changer::Вид_рекламы_HTML::Ru),


        _ => {
            println!("Не определено расширение |{}|",расширение);
            panic!();
            //println!("Расширение '{}' не поддерживается", расширение);
           // куча.insert(расширение.to_string());
          //  Text_Changer::Основной_Вид_Расширения::Не_определено
        },
    }
}
pub fn получить_подробное_расширение(
    имя: &Text_Changer::Умная_Строка,
) -> Text_Changer::Подробный_вид_расширения_с_кучей {
    let куча_нераспознанных_расширений: rapidhash::fast::RapidHashSet<String> =
        rapidhash::fast::RapidHashSet::default();
    //
    let расширение: Text_Changer::Умная_Строка =
        match re_получить_строку_с_описанием(
            &имя,
            &RE_РАСШИРЕНИЕ_ФАЙЛА_C_ТОЧКОЙ,
            "Не удалось выдрать расширение файла с точкой",
        ) {
            Ok(путь) => путь,
            Err(_) => Text_Changer::Умная_Строка::Пусто,
        };
    let расширение_подробно: Text_Changer::Основной_Вид_Расширения =
        определить_расширение_подробно(
            &расширение.to_lowercase(),
            //&mut куча_нераспознанных_расширений,
        );
    //
    return Text_Changer::Подробный_вид_расширения_с_кучей {
        строка: расширение,
        вид: расширение_подробно,
        куча: куча_нераспознанных_расширений,
    };
}

pub fn проверка_на_непустоту_содержимого_при_считывании_нужны_строки(
    строки: &Vec<Text_Changer::Умная_Строка>,
    байты: &Vec<u8>,
    путь: &Text_Changer::Умная_Строка,
    имя_файла_без_пути: &Text_Changer::Умная_Строка,
    источник: &Text_Changer::Ошибка_Сохранения,
) -> Result<(), Text_Changer::Ошибка_при_вложении_книги> {
    match строки.len() == 0 {
        //
        true => match байты.len() == 0 {
            true => {
                println!(
                    "\r\n|{источник}| Пустой ряд строк + байт для пути |{}| имя_файла_без_пути |{}|",
                    путь, имя_файла_без_пути
                );
                return Err(Text_Changer::Ошибка_при_вложении_книги::Пустые_оба_ряда);
            }
            false => {
                println!(
                    "\r\n|{источник}| Пустой ряд строк + байт для пути |{}| имя_файла_без_пути |{}|",
                    путь, имя_файла_без_пути
                );
                return Err(Text_Changer::Ошибка_при_вложении_книги::Пустой_ряд_строк);
            }
        },
        false => return Ok(()),
    }
    //
}
pub fn проверка_на_непустоту_содержимого_при_считывании_нужны_байты(
    строки: &Vec<Text_Changer::Умная_Строка>,
    байты: &Vec<u8>,
    путь: &Text_Changer::Умная_Строка,
    имя_файла_без_пути: &Text_Changer::Умная_Строка,
    источник: &Text_Changer::Ошибка_Сохранения,
) -> Result<(), Text_Changer::Ошибка_при_вложении_книги> {
    match байты.len() == 0 {
        //
        true => match строки.len() == 0 {
            true => {
                println!(
                    "\r\n|{источник}| Пустой ряд байт + строк для пути |{}| имя_файла_без_пути |{}|",
                    путь, имя_файла_без_пути
                );
                return Err(Text_Changer::Ошибка_при_вложении_книги::Пустые_оба_ряда);
            }
            false => {
                return {
                    println!(
                        "\r\n|{источник}| Пустой ряд байт для пути |{}| имя_файла_без_пути |{}|",
                        путь, имя_файла_без_пути
                    );
                    Err(Text_Changer::Ошибка_при_вложении_книги::Пустой_ряд_байт)
                };
            }
        },
        false => return Ok(()),
    }
    //
}
pub fn считывание_книги_одиночной_решение(
    путь: &Text_Changer::Умная_Строка,
    расширение_полное: &Text_Changer::Расширение_полное,
    название_книги: &Text_Changer::Умная_Строка,
) -> Result<Text_Changer::Книга_с_сообщениями, ()> {
    use crate::utils::regex::re_получить_имя_файла_без_пути;
    let сообщения_общие: Text_Changer::Сообщения_считывания_книг = Default::default();
    let mut содержимое_папок: Text_Changer::Содержимое_папок = Default::default();
    // fb2_rtf_mht_mhtml(&путь) {
    // println!("вхождение: fb2_rtf_mht_mhtml");
    let содержимое: Vec<Text_Changer::Умная_Строка> = {
        считать_в_utf8_умные_строки(&путь) //чтение файла в UTF-8
    };
    let имя_без_пути = re_получить_имя_файла_без_пути(&название_книги);
    проверка_на_непустоту_содержимого_при_считывании_нужны_строки(&содержимое,&Vec::new(),&название_книги,&имя_без_пути,&Text_Changer::Ошибка_Сохранения::Чтение_Диска).unwrap();
    //вложение
    let стопка: Vec<Text_Changer::Вложения> = vec![Text_Changer::Вложения {
        содержимое: содержимое,
        содержимое_в_байтах: Vec::new(),
        имя: название_книги.clone(),
        имя_без_пути,
        путь_полный: путь.clone(),
        кодировка: Text_Changer::Кодировка::Utf8,
        расширение: расширение_полное.clone(),
    }];
    содержимое_папок.файлы.insert(путь.получить_значение());
    //вложение не архива в стопку
    let книга_итог = Text_Changer::Книга_целиковая {
        вложения: стопка,
        //содержимое:содержимое,
        путь: путь.clone(),                     //путь полный
        название_книги: название_книги.clone(), //имя книги
        книга_ли: расширение_полное.вид.книга_ли(),
        архив: Default::default(),
        расширение: расширение_полное.clone(),
    };
    Ok(Text_Changer::Книга_с_сообщениями {
        книга: книга_итог,
        сообщения_файлов: сообщения_общие,
        содержимое_папок,
    })
}
pub fn считывание_книги_архивной(
    путь: &Text_Changer::Умная_Строка,
    расширение_полное: &Text_Changer::Расширение_полное,
    название_книги: &Text_Changer::Умная_Строка,
) -> Result<Text_Changer::Книга_с_сообщениями, ()> {
    //
    #[allow(non_camel_case_types)]
    struct Вложения_с_сообщениями {
        pub вложения: Vec<Text_Changer::Вложения>,
        pub сообщения: Text_Changer::Сообщения_считывания_книг,
    }

    use crate::utils::regex::re_получить_имя_файла_без_пути;

    let mut сообщения_файлов: Text_Changer::Сообщения_считывания_книг = Default::default();
    let mut содержимое_папок: Text_Changer::Содержимое_папок = Default::default();

    let книга_в_озу: Архив_в_озу = match zip_архив_в_память(
        путь,
        rapidhash::fast::RapidHashMap::with_hasher(rapidhash::fast::RandomState::default()),
    ) {
        Ok(успех) => успех,
        Err(ошибка) => {
            if sz_найти(&ошибка.to_string(), "Пустой файл") {
                вывод_сообщения_на_экран_и_вложение_в_кучу(
                    Text_Changer::Умная_Строка::создать_значение(
                        format!("☢️ Запись2:  книга {}. Пустое содержимое книги", путь),
                    ),
                    &mut сообщения_файлов.чтение_книг,
                );
                rapidhash::fast::RapidHashMap::with_hasher(rapidhash::fast::RandomState::default())
            } else {
                panic!("Ошибка при распаковке файла в архив |{путь}|")
            }
        }
    };

    // 1) Собираем в Vec<Вложения_с_сообщениями>
    let круговорот_книг_вектор: Vec<Вложения_с_сообщениями> = книга_в_озу
        .into_iter()
        .filter_map(|(имя_свитка_в_куче, содержимое_архива)| {
            let имя_свитка: Text_Changer::Умная_Строка =
                Text_Changer::Умная_Строка::создать_значение(
                    имя_свитка_в_куче,
                );
            let итог_расширения =
                получить_подробное_расширение(&имя_свитка);

            // картинки/шрифты — не читаем в utf8
            if !итог_расширения.вид.книга_ли() {
                let имя_без_пути =
                    re_получить_имя_файла_без_пути(&имя_свитка);
                проверка_на_непустоту_содержимого_при_считывании_нужны_байты(
                    &Vec::new(),
                    &содержимое_архива,
                    &имя_свитка,
                    &имя_без_пути,
                    &Text_Changer::Ошибка_Сохранения::Чтение_Диска,
                )
                .unwrap();

                Some(Вложения_с_сообщениями {
                    вложения: vec![Text_Changer::Вложения {
                        содержимое: Vec::new(),
                        имя_без_пути,
                        имя: имя_свитка,
                        путь_полный: путь.clone(),
                        содержимое_в_байтах: содержимое_архива.clone(),
                        кодировка:
                            Text_Changer::Кодировка::Не_определено,
                        расширение: Text_Changer::Расширение_полное {
                            строка: итог_расширения.строка,
                            вид: итог_расширения.вид,
                        },
                    }],
                    сообщения: Default::default(),
                })
            } else {
                let содержимое_файла: Vec<Text_Changer::Умная_Строка> =
                    read_utf8_из_ряда_u8(&содержимое_архива, &имя_свитка);

                if итог_расширения.вид.разметка_паутины()
                    || итог_расширения.вид.простая_письменность()
                {
                    let mut сообщения_свои: Text_Changer::Сообщения_считывания_книг =
                        Text_Changer::Сообщения_считывания_книг::default();
                    let новое_содержимое_файла: Vec<Text_Changer::Умная_Строка> =
                        htm_utf8_без_переносов_строк_в_умный_ряд(
                            &содержимое_файла,
                            &имя_свитка,
                            &расширение_полное.вид,
                        );
                    let кодировка: Text_Changer::Кодировка =
                        определить_кодировку(
                            &новое_содержимое_файла,
                            &имя_свитка,
                            &расширение_полное.вид,
                            путь,
                            &mut сообщения_свои.кодировка,
                        );

                    // ВАЖНО: не трогаем сообщения_файлов внутри замыкания.
                    let имя_без_пути =
                        re_получить_имя_файла_без_пути(&имя_свитка);
                    проверка_на_непустоту_содержимого_при_считывании_нужны_строки(
                        &новое_содержимое_файла,
                        &Vec::new(),
                        &имя_свитка,
                        &имя_без_пути,
                        &Text_Changer::Ошибка_Сохранения::Чтение_Диска,
                    )
                    .unwrap();

                    Some(Вложения_с_сообщениями {
                        вложения: vec![Text_Changer::Вложения {
                            содержимое: новое_содержимое_файла,
                            имя_без_пути,
                            имя: имя_свитка,
                            путь_полный: путь.clone(),
                            содержимое_в_байтах: содержимое_архива.clone(),
                            кодировка,
                            расширение: Text_Changer::Расширение_полное {
                                строка: итог_расширения.строка,
                                вид: итог_расширения.вид,
                            },
                        }],
                        сообщения: сообщения_свои,
                    })
                } else {
                    let mut сообщения_свои: Text_Changer::Сообщения_считывания_книг =
                        Text_Changer::Сообщения_считывания_книг::default();
                    let кодировка: Text_Changer::Кодировка =
                        определить_кодировку(
                            &содержимое_файла,
                            &имя_свитка,
                            &расширение_полное.вид,
                            путь,
                            &mut сообщения_свои.кодировка,
                        );

                    let имя_без_пути =
                        re_получить_имя_файла_без_пути(&имя_свитка);
                    проверка_на_непустоту_содержимого_при_считывании_нужны_строки(
                        &содержимое_файла,
                        &содержимое_архива,
                        &имя_свитка,
                        &имя_без_пути,
                        &Text_Changer::Ошибка_Сохранения::Чтение_Диска,
                    )
                    .unwrap();

                    Some(Вложения_с_сообщениями {
                        вложения: vec![Text_Changer::Вложения {
                            содержимое: содержимое_файла,
                            имя_без_пути,
                            имя: имя_свитка,
                            путь_полный: путь.clone(),
                            содержимое_в_байтах: содержимое_архива.clone(),
                            кодировка,
                            расширение: Text_Changer::Расширение_полное {
                                строка: итог_расширения.строка,
                                вид: итог_расширения.вид,
                            },
                        }],
                        сообщения: сообщения_свои,
                    })
                }
            }
        })
        .collect();

    // 2) Склеиваем Vec<Вложения_с_сообщениями> в один Вложения_с_сообщениями
    let круговорот_книг: Вложения_с_сообщениями = круговорот_книг_вектор.into_iter().fold(
        Вложения_с_сообщениями {
            вложения: Vec::new(),
            сообщения: Default::default(),
        },
        |mut итог, запчасть| {
            итог.вложения.extend(запчасть.вложения);
            // предполагаем, что у Сообщения_считывания_книг есть поле кодировка:
            итог
                .сообщения
                .кодировка
                .extend(запчасть.сообщения.кодировка);
            // и, если есть, чтение_книг:
            итог
                .сообщения
                .чтение_книг
                .extend(запчасть.сообщения.чтение_книг);
            итог
        },
    );

    содержимое_папок.файлы.insert(путь.получить_значение());

    /*let архив: rapidhash::fast::RapidHashMap<String, Vec<u8>> =
    rapidhash::fast::RapidHashMap::with_hasher(rapidhash::fast::RandomState::default());*/

    let книга_итог: Text_Changer::Книга_целиковая = Text_Changer::Книга_целиковая {
        вложения: круговорот_книг.вложения,
        архив: Default::default(),
        путь: путь.clone(),
        название_книги: название_книги.clone(),
        книга_ли: расширение_полное.вид.книга_ли(),
        расширение: расширение_полное.clone(),
    };

    // объединяем уже накопленные сообщения (ошибки распаковки) с сообщениями из файлов
    let mut итог_сообщений: Text_Changer::Сообщения_считывания_книг =
        сообщения_файлов;
    итог_сообщений
        .кодировка
        .extend(круговорот_книг.сообщения.кодировка);
    итог_сообщений
        .чтение_книг
        .extend(круговорот_книг.сообщения.чтение_книг);

    Ok(Text_Changer::Книга_с_сообщениями {
        книга: книга_итог,
        сообщения_файлов: итог_сообщений,
        содержимое_папок,
    })
}

pub fn считывание_файла_строк_htm_решение(
    путь: &Text_Changer::Умная_Строка,
    расширение_полное: &Text_Changer::Расширение_полное,
    название_книги: &Text_Changer::Умная_Строка,
) -> Result<Text_Changer::Книга_с_сообщениями, ()> {
    use crate::utils::regex::re_получить_имя_файла_без_пути;
    let mut сообщения_общие: Text_Changer::Сообщения_считывания_книг = Default::default();
    let mut содержимое_папок: Text_Changer::Содержимое_папок = Default::default();
    // fb2_rtf_mht_mhtml(&путь) {
    // println!("вхождение: fb2_rtf_mht_mhtml");
    let содержимое: Vec<Text_Changer::Умная_Строка> =
        считать_в_utf8_без_переносов_строк_htm_не_архив(
            &путь,
            &название_книги,
        ); //чтение файла в UTF-8
    //println!("Длина файла |{}| - длина |{}|",путь,содержимое.len());

    /*for строка_книги in содержимое.iter() {
        println!("|{}|",строка_книги);
    }*/
    let кодировка: Text_Changer::Кодировка = определить_кодировку(
        &содержимое,
        &название_книги,
        &расширение_полное.вид,
        &путь,
        &mut сообщения_общие.кодировка,
    );
    let имя_без_пути = re_получить_имя_файла_без_пути(&название_книги);
    //println!("Книга |{}| кодировка |{}|",название_книги,кодировка);
    проверка_на_непустоту_содержимого_при_считывании_нужны_строки(&содержимое,&Vec::new(),&название_книги,&имя_без_пути,&Text_Changer::Ошибка_Сохранения::Чтение_Диска).unwrap();
    //
    let стопка: Vec<Text_Changer::Вложения> = vec![Text_Changer::Вложения {
        содержимое: содержимое,
        имя: название_книги.clone(),
        имя_без_пути,
        путь_полный: путь.clone(),
        содержимое_в_байтах: Vec::new(),
        кодировка,
        расширение: расширение_полное.clone(),
    }];
    содержимое_папок.файлы.insert(путь.получить_значение());
    //
    //сообщения_общие.кодировка.extend(сообщения_свои.кодировка);
    //вложение не архива в стопку
    let книга_итог = Text_Changer::Книга_целиковая {
        вложения: стопка,
        //содержимое:содержимое,
        путь: путь.clone(),                     //путь полный
        название_книги: название_книги.clone(), //имя книги
        книга_ли: расширение_полное.вид.книга_ли(),
        архив: Default::default(),
        расширение: расширение_полное.clone(),
    };
    //
    Ok(Text_Changer::Книга_с_сообщениями {
        книга: книга_итог,
        сообщения_файлов: сообщения_общие,
        содержимое_папок,
    })
}

pub fn считывание_файла_как_путь(
    путь: &Text_Changer::Умная_Строка,
    расширение_полное: &Text_Changer::Расширение_полное,
    название_книги: &Text_Changer::Умная_Строка,
) -> Result<Text_Changer::Книга_с_сообщениями, ()> {
    use crate::utils::regex::re_получить_имя_файла_без_пути;
    //let mut сообщения_общие: Text_Changer::Сообщения_считывания_книг = Default::default();
    let mut содержимое_папок: Text_Changer::Содержимое_папок = Default::default();
    let имя_без_пути = re_получить_имя_файла_без_пути(&название_книги);
    //println!("Книга |{}| кодировка |{}|",название_книги,кодировка);
    //проверка_на_непустоту_содержимого_при_считывании_нужны_строки(&содержимое,&Vec::new(),&название_книги,&имя_без_пути,&Text_Changer::Ошибка_Сохранения::Чтение_Диска).unwrap();
    let кодировка_внутр:Text_Changer::Кодировка=match расширение_полное.вид {
        Text_Changer::Основной_Вид_Расширения::Мусорная_Разметка(_)=>Text_Changer::Кодировка::Utf8,
        Text_Changer::Основной_Вид_Расширения::Шрифты(_) => Text_Changer::Кодировка::Utf8,
        Text_Changer::Основной_Вид_Расширения::XML(_)=> Text_Changer::Кодировка::Utf8,
         Text_Changer::Основной_Вид_Расширения::JS(_)=> Text_Changer::Кодировка::Utf8,
        _=>Text_Changer::Кодировка::Не_определено,
    };
    //
    let стопка: Vec<Text_Changer::Вложения> = vec![Text_Changer::Вложения {
        содержимое: Vec::new(),
        имя: название_книги.clone(),
        имя_без_пути,
        путь_полный: путь.clone(),
        содержимое_в_байтах: Vec::new(),
        кодировка: кодировка_внутр,
        расширение: расширение_полное.clone(),
    }];
    содержимое_папок.файлы.insert(путь.получить_значение());
    //
    //сообщения_общие.кодировка.extend(сообщения_свои.кодировка);
    //вложение не архива в стопку
    let книга_итог = Text_Changer::Книга_целиковая {
        вложения: стопка,
        //содержимое:содержимое,
        путь: путь.clone(),                     //путь полный
        название_книги: название_книги.clone(), //имя книги
        книга_ли: расширение_полное.вид.книга_ли(),
        архив: Default::default(),
        расширение: расширение_полное.clone(),
    };
    //
    Ok(Text_Changer::Книга_с_сообщениями {
        книга: книга_итог,
        сообщения_файлов: Default::default(),
        содержимое_папок,
    })
}

pub fn считывание_файла_строк_построчно(
    путь: &Text_Changer::Умная_Строка,
    расширение_полное: &Text_Changer::Расширение_полное,
    название_книги: &Text_Changer::Умная_Строка,
) -> Result<Text_Changer::Книга_с_сообщениями, ()> {
    use crate::utils::regex::re_получить_имя_файла_без_пути;
    let mut сообщения_общие: Text_Changer::Сообщения_считывания_книг = Default::default();
    let mut содержимое_папок: Text_Changer::Содержимое_папок = Default::default();
    // fb2_rtf_mht_mhtml(&путь) {
    // println!("вхождение: fb2_rtf_mht_mhtml");
    let содержимое: Vec<Text_Changer::Умная_Строка> =
        считать_в_utf8_умные_строки(&путь); //чтение файла в UTF-8
    //println!("Длина файла |{}| - длина |{}|",путь,содержимое.len());

    /*for строка_книги in содержимое.iter() {
        println!("|{}|",строка_книги);
    }*/
    let кодировка: Text_Changer::Кодировка = определить_кодировку(
        &содержимое,
        &название_книги,
        &расширение_полное.вид,
        &путь,
        &mut сообщения_общие.кодировка,
    );
    let имя_без_пути = re_получить_имя_файла_без_пути(&название_книги);
    //println!("Книга |{}| кодировка |{}|",название_книги,кодировка);
    проверка_на_непустоту_содержимого_при_считывании_нужны_строки(&содержимое,&Vec::new(),&название_книги,&имя_без_пути,&Text_Changer::Ошибка_Сохранения::Чтение_Диска).unwrap();
    //
    let стопка: Vec<Text_Changer::Вложения> = vec![Text_Changer::Вложения {
        содержимое: содержимое,
        имя: название_книги.clone(),
        имя_без_пути,
        путь_полный: путь.clone(),
        содержимое_в_байтах: Vec::new(),
        кодировка,
        расширение: расширение_полное.clone(),
    }];
    содержимое_папок.файлы.insert(путь.получить_значение());
    //
    //сообщения_общие.кодировка.extend(сообщения_свои.кодировка);
    //вложение не архива в стопку
    let книга_итог = Text_Changer::Книга_целиковая {
        вложения: стопка,
        //содержимое:содержимое,
        путь: путь.clone(),                     //путь полный
        название_книги: название_книги.clone(), //имя книги
        книга_ли: расширение_полное.вид.книга_ли(),
        архив: Default::default(),
        расширение: расширение_полное.clone(),
    };
    //
    Ok(Text_Changer::Книга_с_сообщениями {
        книга: книга_итог,
        сообщения_файлов: сообщения_общие,
        содержимое_папок,
    })
}
