//use rayon::prelude::*;
pub fn проверка_содержимого_папок() {
    println!();
    use crate::output::functions::проверка_наличия_папок_в_случае_их_отсутствия_создать_папки_по_срезу;
    // use crate::utils::read::попытка_открыть_файл;
    // use std::path::Path;
    let пути_общие: Text_Changer::Пути_Общие = Default::default();
    //let пути_вывода: Text_Changer::Пути_Вывода = Default::default();
    //двумерный вектор. 1-й для хранения прямых путей, 2 - после пути добавляется косая черта / (linux)
    let пути: [&str; 8] = [
        //test
        пути_общие.вывод,
        пути_общие.книги,
        пути_общие.словари,
        пути_общие.вывод_книги,
        пути_общие.вывод_словари,
        пути_общие.вывод_книги_кучи,
        пути_общие.вывод_книги_проверка_после_замены_слов,
        пути_общие.вывод_книги_запись_и_чтение,
    ];
    //проверка наличия папок
    //если не создано - создать
    пути.iter().for_each(|путь| {
        проверка_наличия_папок_в_случае_их_отсутствия_создать_папки_по_срезу(&путь)
        //crate::output::dir::создать_вложенные_папки(&путь).unwrap();
    });
}
