use crate::ui_gpui::gpui_main::Данные_при_загрузке;
use rapidhash::RapidHashMap;
use regex::Regex;
use std::sync::LazyLock;
use std::sync::atomic::{AtomicBool, Ordering};
use std::time::Instant;
//use clap::builder::Str;
//use convert_case::{Case, Casing};
//use rapidhash::*;
use crate::utils::stringzilla::sz_найти;
use console::style;
use rayon::prelude::*;
pub fn сравнить_основной_и_запасной_словари(
    основной_словарь: &Text_Changer::Полный_Словарь,
    запасной_словарь: &Text_Changer::Полный_Словарь,
) -> Result<(), ()> {
    println!(
        "Длина простых слов (всего): Основной - |{}| Запасной - |{}| поделажщих переводу |{}|",
        основной_словарь.простое.len() / 3,
        запасной_словарь.простое.len(),
        основной_словарь.перевести.len(),
    );
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    let куча_переведенных_слов_в_запасном_словаре: rapidhash::fast::RapidHashSet<&str> =
        запасной_словарь
            .простое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
        куча_переведенных_слов_в_запасном_словаре.len()
    );
    //
    let куча_простых_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .простое
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .составное
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_сложных_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .составное_важное
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    let куча_неизменных_коротких_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .неизменное_короткое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи простых слов - |{}|",
        куча_простых_слов.len() / 3
    );
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_словарь_запасной: rapidhash::fast::RapidHashSet<usize> =
        запасной_словарь
            .простое
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_простых_слов.contains(ячейка.искомое_слово.as_str())
                {
                    //если в составных словах тоже отсутствует
                    if !куча_составных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_составных_сложных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_неизменных_коротких_слов.contains(ячейка.искомое_слово.as_str())
                    {
                        Some(указатель)
                    } else {
                        None
                    }
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_страницу_не_переведённых_слов_главного_словаря: rapidhash::fast::RapidHashSet<usize> =
        основной_словарь
            .перевести
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_переведенных_слов_в_запасном_словаре.contains(ячейка.искомое_слово.as_str())
                {
                    Some(указатель)
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //
    println!(
        "Количество слов запасного словаря, которые отсутствуют в основном - |{}|",
        куча_указателей_на_словарь_запасной.len(),
    );
    println!(
        "куча_указателей_на_страницу_не_переведённых_слов_главного_словаря - |{}|",
        куча_указателей_на_страницу_не_переведённых_слов_главного_словаря.len(),
    );
    //
    crate::output::write::вывод_запасного_словаря_почищенного(
        &запасной_словарь,
        &куча_указателей_на_словарь_запасной,
        //
        &куча_указателей_на_страницу_не_переведённых_слов_главного_словаря,
        &основной_словарь,
        //
    )
    .unwrap();

    Ok(())
}
pub fn получить_замену(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    слово_искомое: &String,
) -> Result<String, String> {
    //
    let mut слово_замена: Text_Changer::Умная_Строка =
        Text_Changer::Умная_Строка::Пусто;
    //
    if let Some(значения) = основной_словарь.кучи_полные.искомые[0]
        .простое
        .get(слово_искомое)
    {
        let указатель: usize = значения.iter().copied().next().unwrap();
        //
        слово_замена = Text_Changer::Умная_Строка::создать_значение(
            основной_словарь.сам.простое[указатель].замена.clone(),
        );
        // }
    };
    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", слово_искомое));
        }
    }
}
pub fn получить_замену_по_указателю(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    ячейка: (
        &String,
        &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>,
    ),
) -> Result<String, String> {
    //
    //
    let указатель: usize = ячейка.1.iter().copied().next().unwrap();
    //
    let слово_замена = Text_Changer::Умная_Строка::создать_значение(
        основной_словарь.сам.простое[указатель].замена.clone(),
    );
    // }

    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", ячейка.0));
        }
    }
}
//
pub fn найти_недостающие_слова(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
    пути_общие: &Text_Changer::Пути_Общие,
) -> Result<(), ()> {
    #![allow(non_snake_case, non_camel_case_types)]
    let время_отсчёта: Instant = Instant::now();
    // use crate::dictionary::выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания;
    use crate::output::write::вывод_недопустимых_и_недостающих_окончаний_в_xlsx;
    use crate::utils::stringzilla::{
        sz_упорядочить_hashmap_в_слова_с_заменой, sz_упорядочить_кучу_строк_rapid_в_ряд_строк,
    };
    use Text_Changer::Слово_с_заменой;
    //

    //
    /*let куча_искомых_слов_с_указателями:rapidhash::fast::RapidHashMap<String, rapidhash::fast::RapidHashSet<usize>>=
    выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания(&основной_словарь.кучи.куча_словарь_искомые[0].простое,&основной_словарь.сам.простое);*/
    //
    pub struct Окончания_включающие {
        начально: &'static [Regex],
        конец: &'static [&'static str],
    }
    /*pub struct Regex_с_заменой {
        поиск: Regex,
        замена: Regex,
    }*/
    //
    static RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Regex; 23]> = LazyLock::new(|| {
        [
            Regex::new(r"(?i)\w+(ван)+$").unwrap(),
            //само слово и 1 буква дополнительно
            Regex::new(r"(?i)\w+(вана)+$").unwrap(),
            Regex::new(r"(?i)\w+(вано)$").unwrap(),
            Regex::new(r"(?i)\w+(ваны)+$").unwrap(),
            //а
            Regex::new(r"(?i)\w+(ванная)+$").unwrap(),
            //у
            Regex::new(r"(?i)\w+(ванную)+$").unwrap(),
            //о
            Regex::new(r"(?i)\w+(ванной)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванное)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванного)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванном)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванному)+$").unwrap(),
            //ст
            Regex::new(r"(?i)\w+(ванность)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванностью)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванности)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванностей)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванностям)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванностями)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванностях)+$").unwrap(),
            //ы
            Regex::new(r"(?i)\w+(ванным)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванными)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванных)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванные)+$").unwrap(),
            Regex::new(r"(?i)\w+(ванный)+$").unwrap(),
        ]
    });
    //
    const КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН: [&'static str; 23] = [
        "ван",
        "вана",
        "вано",
        "ваны",
        //
        "ванная",
        "ванную",
        //о
        "ванной",
        "ванное",
        "ванного",
        //глаголы
        "ванном",
        "ванному",
        //ст
        "ванность",
        "ванностью",
        "ванности",
        "ванностей",
        "ванностям",
        "ванностями",
        "ванностях",
        //ы
        "ванным",
        "ванными",
        "ванных",
        "ванные",
        "ванный",
    ];
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ: LazyLock<[Regex; 62]> = LazyLock::new(|| {
        [
            //----------------------------------
            //ван
            //а
            Regex::new(r"(?i)ваная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)ванн$").unwrap(),
            Regex::new(r"(?i)ванна$").unwrap(),
            Regex::new(r"(?i)ванно$").unwrap(),
            Regex::new(r"(?i)ванны$").unwrap(),
            //ую
            Regex::new(r"(?i)ваную$").unwrap(),
            //о
            Regex::new(r"(?i)ваное$").unwrap(),
            Regex::new(r"(?i)ваного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)ваном$").unwrap(),
            Regex::new(r"(?i)ваному$").unwrap(),
            Regex::new(r"(?i)ваность$").unwrap(),
            Regex::new(r"(?i)ваностю$").unwrap(),
            Regex::new(r"(?i)ваности$").unwrap(),
            Regex::new(r"(?i)ваностей$").unwrap(),
            Regex::new(r"(?i)ваностям$").unwrap(),
            Regex::new(r"(?i)ваностями$").unwrap(),
            Regex::new(r"(?i)ваностях$").unwrap(),
            //ы
            Regex::new(r"(?i)ваным$").unwrap(),
            Regex::new(r"(?i)ваными$").unwrap(),
            Regex::new(r"(?i)ваных$").unwrap(),
            Regex::new(r"(?i)ваные$").unwrap(),
            Regex::new(r"(?i)ваный$").unwrap(),
            //----------------------------------
            //ен
            //а
            Regex::new(r"(?i)еная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)енн$").unwrap(),
            Regex::new(r"(?i)енна$").unwrap(),
            Regex::new(r"(?i)енно$").unwrap(),
            Regex::new(r"(?i)енны$").unwrap(),
            //ую
            Regex::new(r"(?i)еную$").unwrap(),
            //о
            Regex::new(r"(?i)еное$").unwrap(),
            Regex::new(r"(?i)еного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)еном$").unwrap(),
            Regex::new(r"(?i)еному$").unwrap(),
            Regex::new(r"(?i)еность$").unwrap(),
            Regex::new(r"(?i)еностью$").unwrap(),
            Regex::new(r"(?i)ености$").unwrap(),
            Regex::new(r"(?i)еностей$").unwrap(),
            Regex::new(r"(?i)еностям$").unwrap(),
            Regex::new(r"(?i)еностями$").unwrap(),
            Regex::new(r"(?i)еностях$").unwrap(),
            //ы
            Regex::new(r"(?i)еным$").unwrap(),
            Regex::new(r"(?i)еными$").unwrap(),
            Regex::new(r"(?i)еных$").unwrap(),
            Regex::new(r"(?i)еные$").unwrap(),
            //----------------------------------
            //он
            Regex::new(r"(?i)оная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)онн$").unwrap(),
            Regex::new(r"(?i)онна$").unwrap(),
            // Regex::new(r"(?i)онно$").unwrap(),
            Regex::new(r"(?i)онны$").unwrap(),
            //ую
            Regex::new(r"(?i)оную$").unwrap(),
            //о
            Regex::new(r"(?i)оное$").unwrap(),
            Regex::new(r"(?i)оного$").unwrap(),
            //глаголы
            //Regex::new(r"(?i)оном$").unwrap(),
            Regex::new(r"(?i)оному$").unwrap(),
            Regex::new(r"(?i)оность$").unwrap(),
            Regex::new(r"(?i)оностью$").unwrap(),
            Regex::new(r"(?i)оности$").unwrap(),
            Regex::new(r"(?i)оностей$").unwrap(),
            Regex::new(r"(?i)оностям$").unwrap(),
            Regex::new(r"(?i)оностями$").unwrap(),
            Regex::new(r"(?i)оностях$").unwrap(),
            //ы
            Regex::new(r"(?i)оным$").unwrap(),
            Regex::new(r"(?i)оными$").unwrap(),
            Regex::new(r"(?i)оных$").unwrap(),
            Regex::new(r"(?i)оные$").unwrap(),
        ]
    });
    // где-то в коде, один раз:
    let стопка_ван: Окончания_включающие = Окончания_включающие {
        начально: &*RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН, // &[Regex; 1] → &[Regex] через coercion
        конец: &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
    };
    //
    //
    //
    let время_отсчёта_недостающих_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недостающих окончаний")).true_color(127, 255, 212),
    );

    //
    let стопка_недостающих_слов: RapidHashMap<String,String> = основной_словарь.кучи_полные.искомые[0]
        .простое
        .iter()
        .flat_map(|слово_в_куче: (&String, &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>)| {
            стопка_ван
                .начально
                .iter()
                .flat_map(|образец_re| {
                    //есть ли окончание по образцу в слове из кучи - если нет, то следующее слово
                    if !образец_re.is_match(слово_в_куче.0) {
                        //вернуть пустую
                        return rapidhash::fast::RapidHashMap::default();
                    }

                    //
                    let слово_замена = получить_замену_по_указателю(
                        &основной_словарь,
                        слово_в_куче,
                    )
                    .unwrap();
                    //если нет такого окончания в слове - то следующее

                    //замена окончания
                    let обрезок_слова_замены: String =образец_re.replace(слово_замена.as_str(), "").to_string();
                        //слово_замена.replace(слово_в_куче, "").to_string();
                    //выделяем само слово без окончания
                    /*let обрезок_искомого_слова: String = стопка_ван.начально[0]
                        .replace(слово_в_куче, "")
                        .into_owned();*/
                         let обрезок_искомого_слова: String;
                        if !образец_re.is_match(&слово_замена) {
                            //вернуть пустую
                            обрезок_искомого_слова=слово_в_куче.0.clone();
                        } else {
                    обрезок_искомого_слова=образец_re.replace(слово_в_куче.0.as_str(), "").to_string();}
                        //
                    //
                    if данные_при_загрузке.общий_ход {
                        println!("обрезок искомого слова |{обрезок_искомого_слова}| само слово исходное изначально |{}|",слово_в_куче.0);
                            println!("обрезок_слова_замены |{обрезок_слова_замены}| само слово замена изначально |{}|",слово_замена);
                    }
                    //проверяем всю кучу на предмет недостающих окончаний
                    стопка_ван
                        .конец
                        .iter()
                        .filter_map(|образец| {
                            let искомое_слово_с_окончанием =
                                format!("{обрезок_искомого_слова}{образец}");
                            let слово_замена_с_окончанием =
                                format!("{обрезок_слова_замены}{образец}");
                            //
                            if данные_при_загрузке.общий_ход {
                                println!("искомое_слово_с_окончанием |{искомое_слово_с_окончанием}| ",);
                                    println!("слово_замена_с_окончанием |{слово_замена_с_окончанием}|");
                            }
                            //
                            if !основной_словарь.кучи_полные.искомые[0]
                                .простое
                                .contains_key(&искомое_слово_с_окончанием)
                            {
                                //println!(" слово_замена_с_окончанием |{слово_замена_с_окончанием}| искомое_слово |{искомое_слово_с_окончанием}| ");
                                Some(
                                    (искомое_слово_с_окончанием,слово_замена_с_окончанием)
                                )
                                //
                            } else {
                                None
                            }
                        })
                        .collect::<RapidHashMap<String,String>>()
                })
                .collect::<RapidHashMap<String,String>>()
        })
        .collect();
    //кучу в общий вид привести с упорядочиванием
    let стопка_недостающих_слов: Vec<Слово_с_заменой> =
        sz_упорядочить_hashmap_в_слова_с_заменой(стопка_недостающих_слов);
    //вывод количества времени
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта_недостающих_окончаний.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    /*for ошибка in ряд_упорядоченный.iter() {
        println!(
            "{}{}{}{}",
            style(format!("Словарь ")),
            style(format!("|{вид_словаря}|")).red(),
            style(format!("не содержит ")),
            style(format!("|{ошибка}|")).cyan(),
        );
    }*/

    /*println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
    );*/

    let время_отсчёта_недопустимых_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недопустимых окончаний")).yellow(),
    );
    //
    let mut ряд_недопустимых_окончаний_общий: Vec<String> = Vec::new();
    //
    for образец in RE_ЛОЖНЫЕ_ОКОНЧАНИЯ.iter() {
        //
        let куча_1: rapidhash::fast::RapidHashSet<String> = основной_словарь.кучи_полные.искомые[0]
            .простое
            .iter()
            .filter_map(|слово_в_куче| {
                if образец.is_match(слово_в_куче.0.as_str()) {
                    Some(слово_в_куче.0.clone())
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<String>>();
        //
        let ряд_недопустимых_окончаний: Vec<String> =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча_1);
        //
        ряд_недопустимых_окончаний_общий.extend(ряд_недопустимых_окончаний);
        //
    }
    //
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск недопустимых окончаний (от начала до конца): {:.2?}",
            время_отсчёта_недопустимых_окончаний.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    вывод_недопустимых_и_недостающих_окончаний_в_xlsx(
        &стопка_недостающих_слов,
        &ряд_недопустимых_окончаний_общий,
        &вид_словаря,
        &данные_при_загрузке,
        &пути_общие,
    )
    .unwrap();
    //output времени затраченного в итоге
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск и вывод недопустимых/недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    Ok(())
}
#[allow(non_camel_case_types)]
pub fn проверка_что_нет_пересечений_искомых_слов(
    основной_словарь: &Text_Changer::Полный_Словарь,
    куча_словарь_искомые: &[Text_Changer::Куча_Словарь_Искомые_простые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
    вид_словаря: &Text_Changer::Вид_Словаря,
) -> Result<(), ()> {
    use Text_Changer::Ячейка_словаря;
    let точка_отсчёта_по_времени_2: Instant = Instant::now();
    //
    const КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ: usize = 8;
    //
    pub struct Подробный_Раздел_Словаря<'a> {
        pub ячейки: &'a Vec<Ячейка_словаря>,
        pub куча: &'a rapidhash::fast::RapidHashSet<String>,
        pub имя_раздела: Text_Changer::Раздел_Словаря,
    }
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    //
    let указатели_раздела_словаря: [Подробный_Раздел_Словаря;
        КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ] = [
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное,
            куча: &куча_словарь_искомые[0].составное,
            имя_раздела: Text_Changer::Раздел_Словаря::Составные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_важное,
            куча: &куча_словарь_искомые[0].составное_важное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_важные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_длинное,
            куча: &куча_словарь_искомые[0].составное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые,
            куча: &куча_словарь_искомые[0].запятые,
            имя_раздела: Text_Changer::Раздел_Словаря::Запятые,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые_длинные,
            куча: &куча_словарь_искомые[0].запятые_длинные,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Запятые_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное,
            куча: &куча_словарь_искомые[0].неизменное,
            имя_раздела: Text_Changer::Раздел_Словаря::Неизменные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_короткое,
            куча: &куча_словарь_искомые[0].неизменное_короткое,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_длинное,
            куча: &куча_словарь_искомые[0].неизменное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_длинные,
        },
    ];
    //сама проверка
    for указатель_уровня in 0..КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ {
        let условие_поиска_заглавных: bool =
            match указатели_раздела_словаря[указатель_уровня].имя_раздела
            {
                Text_Changer::Раздел_Словаря::Составные
                | Text_Changer::Раздел_Словаря::Составные_важные
                | Text_Changer::Раздел_Словаря::Составные_длинные
                | Text_Changer::Раздел_Словаря::Запятые
                | Text_Changer::Раздел_Словаря::Запятые_длинные => true,
                _ => false,
            };
        //составные слова,запятые не надо проверять - там замена идёт по полному совпадению. Проверяем только неизменные
        /*if условие_поиска_заглавных {
            continue;
        }*/
        //
        /*println!(
            "Прооверка на пересечение искомых слов внутри себя - Длина раздела |{}| слов  |{}|  ",
            указатели_раздела_словаря[указатель_уровня].имя_раздела,
            if условие_поиска_заглавных {
                указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
            } else {
                указатели_раздела_словаря[указатель_уровня].ячейки.len()
            },
        );*/
        /*println!(
            "{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}|",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan()
        );*/
        //
        let указатель_раздела_словаря = &указатели_раздела_словаря[указатель_уровня];
        let указатель_раздела_кучи = &указатели_раздела_словаря[указатель_уровня];

        //
        //
        let куча_сообщений: rapidhash::fast::RapidHashSet<String> =
            указатель_раздела_словаря
                .ячейки
                .iter()
                .filter(|ячейка| {
                    if условие_поиска_заглавных {
                        let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                        //если первый знак большой - вернуть отказ
                        !ряд_знаков[0].is_uppercase()
                    } else {
                        true
                    }
                })
                .flat_map(|ячейка| {
                    //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                    //счётчик заглавных букв, 1 раз можно его поменять - дальше выдаст ошибку, что повторное слово
                    let счётчик: AtomicBool = AtomicBool::new(false);
                    //если протсые слова в главном словаре не содержат слово переведённое - вывести
                    указатель_раздела_кучи
                        .куча
                        .iter()
                        .filter_map(|слово_в_куче| {
                            //есть ли совпадение
                            if sz_найти(слово_в_куче, ячейка.искомое_слово.получить_ссылку())
                            {
                                if слово_в_куче.as_str() != ячейка.искомое_слово.as_str()
                                {
                                    //проверка было ли совпадение ранее 1
                                    let уже_было_совпадение =
                                        счётчик.fetch_or(true, Ordering::Relaxed);
                                    //если это 1 случай
                                    if !уже_было_совпадение {
                                        счётчик.fetch_and(true, Ordering::Relaxed);
                                        None
                                    }
                                    //если это не первый случай
                                    else {
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| повторно содержит себя |{}|",
                                            указатели_раздела_словаря
                                                [указатель_уровня]
                                                .имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                    };
                                    //если заглавные буквы (составные) - то проверять количество слов в слове  - то тут заменят полностью всё слово
                                    // соответственно надо првоерять если только слов больше
                                    match условие_поиска_заглавных {
                                        //
                                        true=> {//если есть совпадение - указать
                                        let количество_слов_в_искомом_слове =
                                            ячейка.искомое_слово.split_whitespace().count();
                                        //
                                        let количество_слов_в_слове_из_кучи =
                                            слово_в_куче.split_whitespace().count();
                                        //если разное количество слов - то вывести
                                        if количество_слов_в_слове_из_кучи!=количество_слов_в_искомом_слове{
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                        }
                                            //если одинаковое количество сллов - ничего не делать
                                        else {None}},
                                        //если неизменные - то тут заменят частично всё что ухавтит
                                        false=> Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        )),
                                        //
                                    }

                                } else {
                                    None
                                }
                            } else {
                                None
                            }
                        })
                        .collect::<rapidhash::fast::RapidHashSet<String>>()
                })
                .collect::<rapidhash::fast::RapidHashSet<String>>();
        //
        //if куча_сообщений.len() > 0 {
        //
        println!(
            "{}{}{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела словаря ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}| ",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan(),
            style(format!("Длина раздела кучи ",)).true_color(0, 255, 0),
            style(format!(
                "|{}| ",
                указатели_раздела_словаря[указатель_уровня].куча.len(),
            ))
            .red(),
        );
        //
        куча_сообщений.iter().for_each(|сообщение| {
            println!("{}", сообщение);
        })
        //
        //}
    }
    //
    println!("{}",
             style(format!("⏰ |{}| Время занятое на соответствие проверку, что искомые слова не имеют схождений (итого): {:.2?}",
                                вид_словаря,
                                точка_отсчёта_по_времени_2.elapsed())).true_color(154, 136, 252)
    );
    //
    Ok(())
}
