use crate::ui_gpui::gpui_main::Данные_при_загрузке;
use rapidhash::RapidHashMap;
use regex::Regex;
use std::sync::LazyLock;
use std::sync::atomic::{AtomicBool, Ordering};
use std::time::Instant;
//use clap::builder::Str;
//use convert_case::{Case, Casing};
//use rapidhash::*;
use crate::utils::stringzilla::sz_найти;
use console::style;
use rayon::prelude::*;
pub fn сравнить_основной_и_запасной_словари(
    основной_словарь: &Text_Changer::Полный_Словарь,
    запасной_словарь: &Text_Changer::Полный_Словарь,
) -> Result<(), ()> {
    println!(
        "Длина простых слов (всего): Основной - |{}| Запасной - |{}| поделажщих переводу |{}|",
        основной_словарь.простое.len() / 3,
        запасной_словарь.простое.len(),
        основной_словарь.перевести.len(),
    );
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    let куча_переведенных_слов_в_запасном_словаре: rapidhash::fast::RapidHashSet<&str> =
        запасной_словарь
            .простое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
        куча_переведенных_слов_в_запасном_словаре.len()
    );
    //
    let куча_простых_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .простое
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .составное
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_сложных_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .составное_важное
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    let куча_неизменных_коротких_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .неизменное_короткое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи простых слов - |{}|",
        куча_простых_слов.len() / 3
    );
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_словарь_запасной: rapidhash::fast::RapidHashSet<usize> =
        запасной_словарь
            .простое
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_простых_слов.contains(ячейка.искомое_слово.as_str())
                {
                    //если в составных словах тоже отсутствует
                    if !куча_составных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_составных_сложных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_неизменных_коротких_слов.contains(ячейка.искомое_слово.as_str())
                    {
                        Some(указатель)
                    } else {
                        None
                    }
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_страницу_не_переведённых_слов_главного_словаря: rapidhash::fast::RapidHashSet<usize> =
        основной_словарь
            .перевести
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_переведенных_слов_в_запасном_словаре.contains(ячейка.искомое_слово.as_str())
                {
                    Some(указатель)
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //
    println!(
        "Количество слов запасного словаря, которые отсутствуют в основном - |{}|",
        куча_указателей_на_словарь_запасной.len(),
    );
    println!(
        "куча_указателей_на_страницу_не_переведённых_слов_главного_словаря - |{}|",
        куча_указателей_на_страницу_не_переведённых_слов_главного_словаря.len(),
    );
    //
    crate::output::write::вывод_запасного_словаря_почищенного(
        &запасной_словарь,
        &куча_указателей_на_словарь_запасной,
        //
        &куча_указателей_на_страницу_не_переведённых_слов_главного_словаря,
        &основной_словарь,
        //
    )
    .unwrap();

    Ok(())
}
pub fn получить_замену(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    слово_искомое: &String,
) -> Result<String, String> {
    //
    let mut слово_замена: Text_Changer::Умная_Строка =
        Text_Changer::Умная_Строка::Пусто;
    //
    if let Some(значения) = основной_словарь.кучи_полные.искомые[0]
        .простое
        .get(слово_искомое)
    {
        let указатель: usize = значения.iter().copied().next().unwrap();
        //
        слово_замена = Text_Changer::Умная_Строка::создать_значение(
            основной_словарь.сам.простое[указатель].замена.clone(),
        );
        // }
    };
    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", слово_искомое));
        }
    }
}
pub fn получить_замену_по_указателю(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    ячейка: (
        &String,
        &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>,
    ),
) -> Result<String, String> {
    //
    //
    let указатель: usize = ячейка.1.iter().copied().next().unwrap();
    //
    let слово_замена = Text_Changer::Умная_Строка::создать_значение(
        основной_словарь.сам.простое[указатель].замена.clone(),
    );
    // }

    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", ячейка.0));
        }
    }
}
//
pub fn найти_недостающие_слова(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
    пути_общие: &Text_Changer::Пути_Общие,
) -> Result<(), ()> {
    use Text_Changer::Вид_Окончания;
    //#![allow(non_snake_case, non_camel_case_types)]
    let время_отсчёта: Instant = Instant::now();
    // use crate::dictionary::выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания;
    use crate::output::write::вывод_недопустимых_и_недостающих_окончаний_в_xlsx;
    use crate::utils::stringzilla::sz_упорядочить_hashmap_в_слова_с_заменой;
    use Text_Changer::Слово_с_заменой;
    //

    //
    /*let куча_искомых_слов_с_указателями:rapidhash::fast::RapidHashMap<String, rapidhash::fast::RapidHashSet<usize>>=
    выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания(&основной_словарь.кучи.куча_словарь_искомые[0].простое,&основной_словарь.сам.простое);*/
    //
    #[derive(Debug, Clone)]
    pub struct Окончания_включающие {
        начально: &'static [Re_образцы],
        конец: &'static [&'static str],
    }
    #[derive(Debug, Clone)]
    pub struct Два_RE {
        pub re_образец_для_поиска: Regex,
        pub re_образец_для_замены: Regex,
        pub окончание_строка: &'static str,
        pub вид_окончания: Вид_Окончания,
    }

    #[derive(Debug, Clone)]
    pub struct Re_образцы {
        pub главная: Два_RE,
        pub re_ряд_замен_частных: &'static [RE_исключающее_окончание],
    }
    #[derive(Debug, Clone)]
    pub struct RE_исключающее_окончание {
        pub re_образец: Regex,
        pub окончание_строка: &'static str,
        pub вид_окончания: Вид_Окончания,
    }

    impl Default for RE_исключающее_окончание {
        fn default() -> Self {
            Self {
                re_образец: Regex::new(r"").unwrap(),
                окончание_строка: "",
                вид_окончания: Вид_Окончания::Не_определено, // какой-то дефолтный вариант
            }
        }
    }
    static ПУСТОЕ_RE_ИСКЛЮЧАЮЩЕЕ_ОКОНЧАНИЕ: LazyLock<
        [RE_исключающее_окончание; 0],
    > = LazyLock::new(|| Default::default());
    /*pub struct Regex_с_заменой {
        поиск: Regex,
        замена: Regex,
    }*/

    static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ: LazyLock<
        [RE_исключающее_окончание; 92],
    > = LazyLock::new(|| {
        [
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ана$").unwrap(),
                окончание_строка: "ана",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анная$").unwrap(),
                окончание_строка: "анная",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анную$").unwrap(),
                окончание_строка: "анную",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ано$").unwrap(),
                окончание_строка: "ано",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)аны$").unwrap(),
                окончание_строка: "аны",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анном$").unwrap(),
                окончание_строка: "анном",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анному$").unwrap(),
                окончание_строка: "анному",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анного$").unwrap(),
                окончание_строка: "анно",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анно$").unwrap(),
                окончание_строка: "анного",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)аннок$").unwrap(),
                окончание_строка: "аннок",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анной$").unwrap(),
                окончание_строка: "анной",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анность$").unwrap(),
                окончание_строка: "анность",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анностью$").unwrap(),
                окончание_строка: "анностью",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анности$").unwrap(),
                окончание_строка: "анности",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анностей$").unwrap(),
                окончание_строка: "анностей",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анностям$").unwrap(),
                окончание_строка: "анностями",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анностями$").unwrap(),
                окончание_строка: "анностями",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анностях$").unwrap(),
                окончание_строка: "анностях",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анным$").unwrap(),
                окончание_строка: "анным",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анными$").unwrap(),
                окончание_строка: "анными",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анный$").unwrap(),
                окончание_строка: "анный",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анные$").unwrap(),
                окончание_строка: "анные",
                вид_окончания: Вид_Окончания::Ан,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)анных$").unwrap(),
                окончание_строка: "анных",
                вид_окончания: Вид_Окончания::Ан,
            },
            //ён
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ёна$").unwrap(),
                окончание_строка: "ёна",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённая$").unwrap(),
                окончание_строка: "ённая",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённую$").unwrap(),
                окончание_строка: "ённую",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ёно$").unwrap(),
                окончание_строка: "ёно",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ёны$").unwrap(),
                окончание_строка: "ёны",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённом$").unwrap(),
                окончание_строка: "ённом",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённому$").unwrap(),
                окончание_строка: "ённому",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённого$").unwrap(),
                окончание_строка: "ённо",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённо$").unwrap(),
                окончание_строка: "ённого",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённок$").unwrap(),
                окончание_строка: "ённок",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённой$").unwrap(),
                окончание_строка: "ённой",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённость$").unwrap(),
                окончание_строка: "ённость",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённостью$").unwrap(),
                окончание_строка: "ённостью",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённости$").unwrap(),
                окончание_строка: "ённости",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённостей$").unwrap(),
                окончание_строка: "ённостей",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённостям$").unwrap(),
                окончание_строка: "ённостями",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённостями$").unwrap(),
                окончание_строка: "ённостями",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённостях$").unwrap(),
                окончание_строка: "ённостях",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённым$").unwrap(),
                окончание_строка: "ённым",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ёнными$").unwrap(),
                окончание_строка: "ёнными",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённый$").unwrap(),
                окончание_строка: "ённый",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённые$").unwrap(),
                окончание_строка: "ённые",
                вид_окончания: Вид_Окончания::Ён,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ённых$").unwrap(),
                окончание_строка: "ённых",
                вид_окончания: Вид_Окончания::Ён,
            },
            //енн
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ена$").unwrap(),
                окончание_строка: "ена",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енная$").unwrap(),
                окончание_строка: "енная",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енную$").unwrap(),
                окончание_строка: "енную",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ено$").unwrap(),
                окончание_строка: "ено",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)ены$").unwrap(),
                окончание_строка: "ены",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енном$").unwrap(),
                окончание_строка: "енном",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енному$").unwrap(),
                окончание_строка: "енному",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енного$").unwrap(),
                окончание_строка: "енно",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енно$").unwrap(),
                окончание_строка: "енного",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)еннок$").unwrap(),
                окончание_строка: "еннок",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енной$").unwrap(),
                окончание_строка: "енной",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енность$").unwrap(),
                окончание_строка: "енность",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енностью$").unwrap(),
                окончание_строка: "енностью",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енности$").unwrap(),
                окончание_строка: "енности",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енностей$").unwrap(),
                окончание_строка: "енностей",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енностям$").unwrap(),
                окончание_строка: "енностями",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енностями$").unwrap(),
                окончание_строка: "енностями",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енностях$").unwrap(),
                окончание_строка: "енностях",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енным$").unwrap(),
                окончание_строка: "енным",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енными$").unwrap(),
                окончание_строка: "енными",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енный$").unwrap(),
                окончание_строка: "енный",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енные$").unwrap(),
                окончание_строка: "енные",
                вид_окончания: Вид_Окончания::Ен,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)енных$").unwrap(),
                окончание_строка: "енных",
                вид_окончания: Вид_Окончания::Ен,
            },
            //онн
            //енн
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)она$").unwrap(),
                окончание_строка: "она",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онная$").unwrap(),
                окончание_строка: "онная",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онную$").unwrap(),
                окончание_строка: "онную",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)оно$").unwrap(),
                окончание_строка: "оно",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)оны$").unwrap(),
                окончание_строка: "оны",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онном$").unwrap(),
                окончание_строка: "онном",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онному$").unwrap(),
                окончание_строка: "онному",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онного$").unwrap(),
                окончание_строка: "онно",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онно$").unwrap(),
                окончание_строка: "онного",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)оннок$").unwrap(),
                окончание_строка: "оннок",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онной$").unwrap(),
                окончание_строка: "онной",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онность$").unwrap(),
                окончание_строка: "онность",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онностью$").unwrap(),
                окончание_строка: "онностью",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онности$").unwrap(),
                окончание_строка: "онности",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онностей$").unwrap(),
                окончание_строка: "онностей",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онностям$").unwrap(),
                окончание_строка: "онностями",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онностями$").unwrap(),
                окончание_строка: "онностями",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онностях$").unwrap(),
                окончание_строка: "онностях",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онным$").unwrap(),
                окончание_строка: "онным",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онными$").unwrap(),
                окончание_строка: "онными",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онный$").unwrap(),
                окончание_строка: "онный",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онные$").unwrap(),
                окончание_строка: "онные",
                вид_окончания: Вид_Окончания::Он,
            },
            RE_исключающее_окончание {
                re_образец: Regex::new(r"(?i)онных$").unwrap(),
                окончание_строка: "онных",
                вид_окончания: Вид_Окончания::Он,
            },
        ]
    });
    //
    static ПУСТОЙ_РЯД_RE: LazyLock<[Regex; 0]> = LazyLock::new(|| Default::default());
    //
    static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН: LazyLock<[Regex; 42]> = LazyLock::new(|| {
        [
            //ен
            //а
            Regex::new(r"(?i)еная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)енн$").unwrap(),
            Regex::new(r"(?i)енна$").unwrap(),
            Regex::new(r"(?i)енно$").unwrap(),
            Regex::new(r"(?i)енны$").unwrap(),
            //ую
            Regex::new(r"(?i)еную$").unwrap(),
            //о
            Regex::new(r"(?i)еное$").unwrap(),
            Regex::new(r"(?i)еного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)еном$").unwrap(),
            Regex::new(r"(?i)еному$").unwrap(),
            Regex::new(r"(?i)еность$").unwrap(),
            Regex::new(r"(?i)еностью$").unwrap(),
            Regex::new(r"(?i)ености$").unwrap(),
            Regex::new(r"(?i)еностей$").unwrap(),
            Regex::new(r"(?i)еностям$").unwrap(),
            Regex::new(r"(?i)еностями$").unwrap(),
            Regex::new(r"(?i)еностях$").unwrap(),
            //ы
            Regex::new(r"(?i)еным$").unwrap(),
            Regex::new(r"(?i)еными$").unwrap(),
            Regex::new(r"(?i)еных$").unwrap(),
            Regex::new(r"(?i)еные$").unwrap(),
            //----------------------------------);
            //ён
            //а
            Regex::new(r"(?i)ёная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)ённ$").unwrap(),
            Regex::new(r"(?i)ённа$").unwrap(),
            Regex::new(r"(?i)ённо$").unwrap(),
            Regex::new(r"(?i)ённы$").unwrap(),
            //ую
            Regex::new(r"(?i)ёную$").unwrap(),
            //о
            Regex::new(r"(?i)ёное$").unwrap(),
            Regex::new(r"(?i)ёного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)ёном$").unwrap(),
            Regex::new(r"(?i)ёному$").unwrap(),
            Regex::new(r"(?i)ёность$").unwrap(),
            Regex::new(r"(?i)ёностью$").unwrap(),
            Regex::new(r"(?i)ёности$").unwrap(),
            Regex::new(r"(?i)ёностей$").unwrap(),
            Regex::new(r"(?i)ёностям$").unwrap(),
            Regex::new(r"(?i)ёностями$").unwrap(),
            Regex::new(r"(?i)ёностях$").unwrap(),
            //ы
            Regex::new(r"(?i)ёным$").unwrap(),
            Regex::new(r"(?i)ёными$").unwrap(),
            Regex::new(r"(?i)ёных$").unwrap(),
            Regex::new(r"(?i)ёные$").unwrap(),
            //----------------------------------);
            //
        ]
    });
    //
    static RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Re_образцы; 23]> = LazyLock::new(|| {
        [
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ван)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ван)$").unwrap(),
                    окончание_строка: "ван",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(вана)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(вана)$").unwrap(),
                    окончание_строка: "вана",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(вано)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(вано)$").unwrap(),
                    окончание_строка: "вано",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ваны)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ваны)$").unwrap(),
                    окончание_строка: "ваны",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванная)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванная)$").unwrap(),
                    окончание_строка: "ванная",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванную)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванную)$").unwrap(),
                    окончание_строка: "ванную",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванной)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванной)$").unwrap(),
                    окончание_строка: "ванной",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванное)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванное)$").unwrap(),
                    окончание_строка: "ванное",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванного)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванного)$").unwrap(),
                    окончание_строка: "ванного",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванном)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванном)$").unwrap(),
                    окончание_строка: "ванном",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванному)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванному)$").unwrap(),
                    окончание_строка: "ваннному",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванность)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванность)$").unwrap(),
                    окончание_строка: "ванность",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванностью)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванностью)$").unwrap(),
                    окончание_строка: "ванностью",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванности)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванности)$").unwrap(),
                    окончание_строка: "ванности",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванностей)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванностей)$").unwrap(),
                    окончание_строка: "ванностей",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванностям)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванностям)$").unwrap(),
                    окончание_строка: "ванностям",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванностями)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванностями)$")
                        .unwrap(),
                    окончание_строка: "ванностями",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванностях)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванностях)$").unwrap(),
                    окончание_строка: "ванностях",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванным)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванным)$").unwrap(),
                    окончание_строка: "ванным",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванными)$")
                        .unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванными)$").unwrap(),
                    окончание_строка: "ванными",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванных)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванных)$").unwrap(),
                    окончание_строка: "ванных",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванные)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванные)$").unwrap(),
                    окончание_строка: "ванные",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
            Re_образцы {
                главная: Два_RE {
                    re_образец_для_поиска: Regex::new(r"(?i)\w+(ванный)$").unwrap(),
                    re_образец_для_замены: Regex::new(r"(?i)(ванный)$").unwrap(),
                    окончание_строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                },
                re_ряд_замен_частных:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
            },
        ]
    });
    //
    const КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН: [&'static str; 23] = [
        "ван",
        "вана",
        "вано",
        "ваны",
        //
        "ванная",
        "ванную",
        //о
        "ванной",
        "ванное",
        "ванного",
        //глаголы
        "ванном",
        "ванному",
        //ст
        "ванность",
        "ванностью",
        "ванности",
        "ванностей",
        "ванностям",
        "ванностями",
        "ванностях",
        //ы
        "ванным",
        "ванными",
        "ванных",
        "ванные",
        "ванный",
    ];
    #[derive(Debug)]
    pub struct Вид_Окончания_со_строкой {
        pub строка: &'static str,
        pub re_выдер: Regex,
        pub вид_окончания: Вид_Окончания,
    }

    #[derive(Debug)]
    pub struct Виды_Окончаний_сборные {
        pub ряд: [Вид_Окончания_со_строкой; 5],
        pub куча_окончаний: rapidhash::fast::RapidHashSet<&'static str>,
    }
    pub trait Возможности_торжка {
        fn найти_окончание(
            &self,
            исключающее_окончание: &RE_исключающее_окончание,
            изначальное_окончание: &Два_RE,
        ) -> Result<&Вид_Окончания_со_строкой, String>;
    }
    impl Возможности_торжка for [Виды_Окончаний_сборные] {
        fn найти_окончание(
            &self,
            исключающее_окончание: &RE_исключающее_окончание,
            изначальное_окончание: &Два_RE,
        ) -> Result<&Вид_Окончания_со_строкой, String> {
            //перебор внутри
            for раздел in self.iter() {
                //если содержит окончание
                if раздел
                    .куча_окончаний
                    .contains(&изначальное_окончание.окончание_строка)
                {
                    //
                    for ячейка in раздел.ряд.iter() {
                        if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                        {
                            return Ok(&ячейка);
                        }
                    }
                }
            }
            Err(format!(
                "не нашло окончание для |{}|",
                изначальное_окончание.re_образец_для_поиска
            ))
        }
    }
    static ТОРЖОК_ОКОНЧАНИЙ: LazyLock<[Виды_Окончаний_сборные; 23]> = LazyLock::new(|| {
        [
            //
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ван", "ен", "ён", "он", "ан",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ван",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ван)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ен",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ён",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ён)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "он",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(он)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ан",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(ан)$").unwrap(),
                    },
                ],
            },
            //вана
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "вана", "ена", "ёна", "она", "ана",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "вана",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(вана)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ена",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ёна",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ёна)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "она",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(она)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ана",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(ана)$").unwrap(),
                    },
                ],
            },
            //
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "вано", "ено", "ёно", "оно", "ано",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "вано",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(вано)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ено",
                        вид_окончания: Вид_Окончания::Ен,

                        re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ёно",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ёно)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "оно",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(оно)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ано",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(ано)$").unwrap(),
                    },
                ],
            },
            //оны
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ваны", "ены", "ёны", "оны", "аны",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ваны",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ваны)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ены",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ёны",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ёны)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "оны",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(оны)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "аны",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(аны)$").unwrap(),
                    },
                ],
            },
            //ванный
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванный",
                    "енный",
                    "ённый",
                    "онный",
                    "анный",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванный",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енный",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённый",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онный",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анный",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                    },
                ],
            },
            //ванных
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванных",
                    "енных",
                    "ённых",
                    "онных",
                    "анных",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванных",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванных)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енных",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енных)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённых",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённых)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онных",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онных)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анных",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анных)$").unwrap(),
                    },
                ],
            },
            //ванным
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванным",
                    "енным",
                    "ённым",
                    "онным",
                    "анным",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванным",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванным)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енным",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енным)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённым",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённым)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онным",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онным)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анным",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анным)$").unwrap(),
                    },
                ],
            },
            //ванными
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванными",
                    "енными",
                    "ёнными",
                    "онными",
                    "анными",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванными",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванными)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енными",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енными)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ёнными",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ёнными)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онными",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онными)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анными",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анными)$").unwrap(),
                    },
                ],
            },
            //ванный
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванный",
                    "енный",
                    "ённый",
                    "онный",
                    "анный",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванный",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енный",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённый",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онный",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анный",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                    },
                ],
            },
            //ванная
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванная",
                    "енная",
                    "ённая",
                    "онная",
                    "анная",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванная",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванная)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енная",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енная)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённая",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённая)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онная",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онная)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анная",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анная)$").unwrap(),
                    },
                ],
            },
            //ванную
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванную",
                    "еннуя",
                    "ённуя",
                    "оннуя",
                    "анную",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванную",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванную)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "еннуя",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(еннуя)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённуя",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённуя)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "оннуя",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(оннуя)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анную",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анную)$").unwrap(),
                    },
                ],
            },
            //ванном
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванном",
                    "енном",
                    "ённом",
                    "онном",
                    "анном",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванном",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванном)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енном",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енном)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённом",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённом)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онном",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онном)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анном",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анном)$").unwrap(),
                    },
                ],
            },
            //ванному
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванному",
                    "енному",
                    "ённому",
                    "онному",
                    "анному",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванному",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванному)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енному",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енному)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённому",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённому)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онному",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онному)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анному",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анному)$").unwrap(),
                    },
                ],
            },
            //ванного
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванного",
                    "енного",
                    "ённого",
                    "онного",
                    "анного",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванного",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванного)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енного",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енного)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённого",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённого)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онного",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онного)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анного",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анного)$").unwrap(),
                    },
                ],
            },
            //ванное
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванное",
                    "енное",
                    "ённое",
                    "онное",
                    "анное",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванное",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванное)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енное",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енное)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённое",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённое)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онное",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онное)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анное",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анное)$").unwrap(),
                    },
                ],
            },
            //ванной
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванной",
                    "енной",
                    "ённой",
                    "онной",
                    "анной",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванной",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванной)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енной",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енной)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённой",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённой)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онной",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онной)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анной",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анной)$").unwrap(),
                    },
                ],
            },
            //ванность
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванность",
                    "енность",
                    "ённость",
                    "онность",
                    "анность",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванность",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванность)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енность",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енность)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённость",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённость)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онность",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онность)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анность",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анность)$").unwrap(),
                    },
                ],
            },
            //ванностью
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванностью",
                    "енностью",
                    "ённостью",
                    "онностью",
                    "анностью",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванностью",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванностью)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енностью",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енностью)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённостью",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённостью)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онностью",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онностью)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анностью",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анностью)$").unwrap(),
                    },
                ],
            },
            //ванности
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванности",
                    "енности",
                    "ённости",
                    "онности",
                    "анности",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванности",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванности)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енности",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енности)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённости",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённости)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онности",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онности)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анности",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анности)$").unwrap(),
                    },
                ],
            },
            //ванностей
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванностей",
                    "енностей",
                    "ённостей",
                    "онностей",
                    "анностей",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванностей",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванностей)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енностей",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енностей)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённостей",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённостей)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онностей",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онностей)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анностей",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анностей)$").unwrap(),
                    },
                ],
            },
            //ванностям
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванностям",
                    "енностям",
                    "ённостям",
                    "онностям",
                    "анностям",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванностям",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванностям)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енностям",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енностям)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённостям",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённостям)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онностям",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онностям)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анностям",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анностям)$").unwrap(),
                    },
                ],
            },
            //ванностями
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванностями",
                    "енностями",
                    "ённостями",
                    "онностями",
                    "анностями",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванностями",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванностями)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енностями",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енностями)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённостями",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённостями)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онностями",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онностями)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анностями",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анностями)$").unwrap(),
                    },
                ],
            },
            //ванностях
            Виды_Окончаний_сборные {
                куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                    "ванностях",
                    "енностях",
                    "ённостях",
                    "онностях",
                    "анностях",
                ]),
                ряд: [
                    Вид_Окончания_со_строкой {
                        строка: "ванностях",
                        вид_окончания: Вид_Окончания::Ван,
                        re_выдер: Regex::new(r"(?i)(ванностях)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "енностях",
                        вид_окончания: Вид_Окончания::Ен,
                        re_выдер: Regex::new(r"(?i)(енностях)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "ённостях",
                        вид_окончания: Вид_Окончания::Ён,
                        re_выдер: Regex::new(r"(?i)(ённостях)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "онностях",
                        вид_окончания: Вид_Окончания::Он,
                        re_выдер: Regex::new(r"(?i)(онностях)$").unwrap(),
                    },
                    Вид_Окончания_со_строкой {
                        строка: "анностях",
                        вид_окончания: Вид_Окончания::Ан,
                        re_выдер: Regex::new(r"(?i)(анностях)$").unwrap(),
                    },
                ],
            },
        ]
    });

    // где-то в коде, один раз:
    let стопка_ван: Окончания_включающие = Окончания_включающие {
        начально: &*RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН, // &[Regex; 1] → &[Regex] через coercion
        конец: &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
    };
    //
    //
    //
    let время_отсчёта_недостающих_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недостающих окончаний")).true_color(127, 255, 212),
    );
    //
    /*for ячейка in основной_словарь.кучи_полные.искомые[0].простое.iter()
    {
        println!("слово |{}| куча-указатели |{:?}|", ячейка.0, ячейка.1);
    }*/
    let mut куча_сообщений: rapidhash::fast::RapidHashSet<String> =
        rapidhash::fast::RapidHashSet::default();
    //
    let стопка_недостающих_слов: RapidHashMap<String,String> = основной_словарь.кучи_полные.искомые[0]
        .простое
        .iter()
        .flat_map(|слово_в_куче: (&String, &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>)| {
            стопка_ван
                .начально
                .iter()
                .flat_map(|образец_re| {
                    if слово_в_куче.0.is_empty() {panic!("Есть пустое слово в перерводом |{}|",
                       получить_замену_по_указателю(
                            &основной_словарь,
                            слово_в_куче,
                        )
                        .unwrap()
                    )}
                    //есть ли окончание по образцу в слове из кучи - если нет, то следующее слово
                    if !образец_re.главная.re_образец_для_поиска.is_match(слово_в_куче.0) {
                        //вернуть пустую
                        return rapidhash::fast::RapidHashMap::default();
                    }
                    //
                    let слово_замена = получить_замену_по_указателю(
                        &основной_словарь,
                        слово_в_куче,
                    )
                    .unwrap();
                    //искомое слово всегда обрезается успешно
                    let  обрезок_искомого_слова=образец_re.главная.re_образец_для_замены.replace(слово_в_куче.0.as_str(), "").to_string();
                    //если нет такого окончания в слове - то следующее
                     let удачная_замена:bool;
                    //замена окончания
                        //объявляем обрезок
                         let mut обрезок_слова_замены: String=String::new();
                         //если обычный образец не подходит
                        if !образец_re.главная.re_образец_для_поиска.is_match(&слово_замена) {
                            //вернуть пустую
                            обрезок_слова_замены=слово_замена.clone();
                            удачная_замена=false;
                        } else {
                            образец_re.главная.re_образец_для_замены.replace(слово_замена.as_str(), "").to_string();
                    удачная_замена=true;
                        }
                        //
                        if данные_при_загрузке.общий_ход {
                            println!("обрезок искомого слова |{обрезок_искомого_слова}| само слово исходное изначально |{}|",слово_в_куче.0);
                                println!("обрезок_слова_замены |{обрезок_слова_замены}| само слово замена изначально |{}|",слово_замена);
                        }
                    //
                    //проверяем всю кучу на предмет недостающих окончаний
                    стопка_ван
                        .конец
                        .iter()
                        .filter_map(|образец| {
                            let искомое_слово_с_окончанием =
                                format!("{обрезок_искомого_слова}{образец}");
                            let mut поиск_в_куче:bool=false;
                            let mut внутр_образец_1:RE_исключающее_окончание=Default::default();
                            //
                            let слово_замена_с_окончанием =
                            match удачная_замена {
                                true=>
                                format!("{обрезок_слова_замены}{образец}"),
                                false=>{//обрезок_слова_замены.clone();
                                    let mut замена_итог:String=обрезок_слова_замены.clone();
                                    //проверка исключающих окончаний
                                    for внутр_образец in образец_re.re_ряд_замен_частных.iter() {
                                        //если есть совпадение
                                        if внутр_образец.re_образец.is_match(&обрезок_слова_замены) {

                                            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание(&внутр_образец, &образец_re.главная) {
                                                Ok(успех)=>{
                                                    //let окончание_поиск:&Вид_Окончания_со_строкой =ТОРЖОК_ОКОНЧАНИЙ.найти_окончание(&внутр_образец, &образец_re.главная).unwrap();
                                                    let выдер:String=внутр_образец.re_образец.replace(слово_замена.as_str(), "").to_string();
                                                    замена_итог=format!("{выдер}{}",успех.строка);
                                                    поиск_в_куче=true;
                                                    внутр_образец_1=внутр_образец.clone();
                                                    //замена_итог
                                                },
                                                Err(_)=>(),
                                                    /*Some(
                                                        (искомое_слово_с_окончанием,обрезок_слова_замены.clone())
                                                    )*/
                                            }
                                        }
                                    }
                                        замена_итог
                                    //
                                },
                            };
                            if поиск_в_куче {
                                куча_сообщений.insert(
                                format!("искомое слово |{}| замена изнач: |{}| найдено окончание |{}| итог |{слово_замена_с_окончанием}| искомый re |{}|",слово_в_куче.0,
                                    обрезок_слова_замены,внутр_образец_1.re_образец,образец_re.главная.re_образец_для_поиска));
                            }
                            //
                            if данные_при_загрузке.общий_ход {
                                println!(" слово_в_куче.0 |{}| искомое_слово_с_окончанием |{искомое_слово_с_окончанием}| - слово_замена_с_окончанием |{слово_замена_с_окончанием}| ",слово_в_куче.0);

                            }
                            //
                            if !основной_словарь.кучи_полные.искомые[0]
                                .простое
                                .contains_key(&искомое_слово_с_окончанием)
                            {
                                //println!(" слово_замена_с_окончанием |{слово_замена_с_окончанием}| искомое_слово |{искомое_слово_с_окончанием}| ");
                                Some(
                                    (искомое_слово_с_окончанием,слово_замена_с_окончанием)
                                )
                                //
                            } else {
                                None
                            }
                        })
                        .collect::<RapidHashMap<String,String>>()
                })
                .collect::<RapidHashMap<String,String>>()
        })
        .collect();
    //
    for сообщение in куча_сообщений.iter() {
        println!("{}", сообщение);
    }
    //кучу в общий вид привести с упорядочиванием
    let стопка_недостающих_слов: Vec<Слово_с_заменой> =
        sz_упорядочить_hashmap_в_слова_с_заменой(стопка_недостающих_слов);
    //вывод количества времени
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта_недостающих_окончаний.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    /*for ошибка in ряд_упорядоченный.iter() {
        println!(
            "{}{}{}{}",
            style(format!("Словарь ")),
            style(format!("|{вид_словаря}|")).red(),
            style(format!("не содержит ")),
            style(format!("|{ошибка}|")).cyan(),
        );
    }*/

    /*println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
    );*/
    let ряд_недопустимых_окончаний_общий =
        определение_недопустимых_окончаний(
            &основной_словарь,
            &вид_словаря,
            &данные_при_загрузке,
        );
    //
    вывод_недопустимых_и_недостающих_окончаний_в_xlsx(
        &стопка_недостающих_слов,
        &ряд_недопустимых_окончаний_общий,
        &вид_словаря,
        &данные_при_загрузке,
        &пути_общие,
    )
    .unwrap();
    //output времени затраченного в итоге
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск и вывод недопустимых/недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    Ok(())
}
#[allow(non_camel_case_types)]
pub fn проверка_что_нет_пересечений_искомых_слов(
    основной_словарь: &Text_Changer::Полный_Словарь,
    куча_словарь_искомые: &[Text_Changer::Куча_Словарь_Искомые_простые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
    вид_словаря: &Text_Changer::Вид_Словаря,
) -> Result<(), ()> {
    use Text_Changer::Ячейка_словаря;
    let точка_отсчёта_по_времени_2: Instant = Instant::now();
    //
    const КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ: usize = 8;
    //
    pub struct Подробный_Раздел_Словаря<'a> {
        pub ячейки: &'a Vec<Ячейка_словаря>,
        pub куча: &'a rapidhash::fast::RapidHashSet<String>,
        pub имя_раздела: Text_Changer::Раздел_Словаря,
    }
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    //
    let указатели_раздела_словаря: [Подробный_Раздел_Словаря;
        КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ] = [
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное,
            куча: &куча_словарь_искомые[0].составное,
            имя_раздела: Text_Changer::Раздел_Словаря::Составные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_важное,
            куча: &куча_словарь_искомые[0].составное_важное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_важные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_длинное,
            куча: &куча_словарь_искомые[0].составное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые,
            куча: &куча_словарь_искомые[0].запятые,
            имя_раздела: Text_Changer::Раздел_Словаря::Запятые,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые_длинные,
            куча: &куча_словарь_искомые[0].запятые_длинные,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Запятые_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное,
            куча: &куча_словарь_искомые[0].неизменное,
            имя_раздела: Text_Changer::Раздел_Словаря::Неизменные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_короткое,
            куча: &куча_словарь_искомые[0].неизменное_короткое,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_длинное,
            куча: &куча_словарь_искомые[0].неизменное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_длинные,
        },
    ];
    //сама проверка
    for указатель_уровня in 0..КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ {
        let условие_поиска_заглавных: bool =
            match указатели_раздела_словаря[указатель_уровня].имя_раздела
            {
                Text_Changer::Раздел_Словаря::Составные
                | Text_Changer::Раздел_Словаря::Составные_важные
                | Text_Changer::Раздел_Словаря::Составные_длинные
                | Text_Changer::Раздел_Словаря::Запятые
                | Text_Changer::Раздел_Словаря::Запятые_длинные => true,
                _ => false,
            };
        //составные слова,запятые не надо проверять - там замена идёт по полному совпадению. Проверяем только неизменные
        /*if условие_поиска_заглавных {
            continue;
        }*/
        //
        /*println!(
            "Прооверка на пересечение искомых слов внутри себя - Длина раздела |{}| слов  |{}|  ",
            указатели_раздела_словаря[указатель_уровня].имя_раздела,
            if условие_поиска_заглавных {
                указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
            } else {
                указатели_раздела_словаря[указатель_уровня].ячейки.len()
            },
        );*/
        /*println!(
            "{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}|",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan()
        );*/
        //
        let указатель_раздела_словаря = &указатели_раздела_словаря[указатель_уровня];
        let указатель_раздела_кучи = &указатели_раздела_словаря[указатель_уровня];

        //
        //
        let куча_сообщений: rapidhash::fast::RapidHashSet<String> =
            указатель_раздела_словаря
                .ячейки
                .iter()
                .filter(|ячейка| {
                    if условие_поиска_заглавных {
                        let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                        //если первый знак большой - вернуть отказ
                        !ряд_знаков[0].is_uppercase()
                    } else {
                        true
                    }
                })
                .flat_map(|ячейка| {
                    //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                    //счётчик заглавных букв, 1 раз можно его поменять - дальше выдаст ошибку, что повторное слово
                    let счётчик: AtomicBool = AtomicBool::new(false);
                    //если протсые слова в главном словаре не содержат слово переведённое - вывести
                    указатель_раздела_кучи
                        .куча
                        .iter()
                        .filter_map(|слово_в_куче| {
                            //есть ли совпадение
                            if sz_найти(слово_в_куче, ячейка.искомое_слово.получить_ссылку())
                            {
                                if слово_в_куче.as_str() != ячейка.искомое_слово.as_str()
                                {
                                    //проверка было ли совпадение ранее 1
                                    let уже_было_совпадение =
                                        счётчик.fetch_or(true, Ordering::Relaxed);
                                    //если это 1 случай
                                    if !уже_было_совпадение {
                                        счётчик.fetch_and(true, Ordering::Relaxed);
                                        None
                                    }
                                    //если это не первый случай
                                    else {
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| повторно содержит себя |{}|",
                                            указатели_раздела_словаря
                                                [указатель_уровня]
                                                .имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                    };
                                    //если заглавные буквы (составные) - то проверять количество слов в слове  - то тут заменят полностью всё слово
                                    // соответственно надо првоерять если только слов больше
                                    match условие_поиска_заглавных {
                                        //
                                        true=> {//если есть совпадение - указать
                                        let количество_слов_в_искомом_слове =
                                            ячейка.искомое_слово.split_whitespace().count();
                                        //
                                        let количество_слов_в_слове_из_кучи =
                                            слово_в_куче.split_whitespace().count();
                                        //если разное количество слов - то вывести
                                        if количество_слов_в_слове_из_кучи!=количество_слов_в_искомом_слове{
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                        }
                                            //если одинаковое количество сллов - ничего не делать
                                        else {None}},
                                        //если неизменные - то тут заменят частично всё что ухавтит
                                        false=> Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        )),
                                        //
                                    }

                                } else {
                                    None
                                }
                            } else {
                                None
                            }
                        })
                        .collect::<rapidhash::fast::RapidHashSet<String>>()
                })
                .collect::<rapidhash::fast::RapidHashSet<String>>();
        //
        //if куча_сообщений.len() > 0 {
        //
        println!(
            "{}{}{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела словаря ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}| ",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan(),
            style(format!("Длина раздела кучи ",)).true_color(0, 255, 0),
            style(format!(
                "|{}| ",
                указатели_раздела_словаря[указатель_уровня].куча.len(),
            ))
            .red(),
        );
        //
        куча_сообщений.iter().for_each(|сообщение| {
            println!("{}", сообщение);
        })
        //
        //}
    }
    //
    println!("{}",
             style(format!("⏰ |{}| Время занятое на соответствие проверку, что искомые слова не имеют схождений (итого): {:.2?}",
                                вид_словаря,
                                точка_отсчёта_по_времени_2.elapsed())).true_color(154, 136, 252)
    );
    //
    Ok(())
}

pub fn определение_недопустимых_окончаний(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
) -> Vec<String> {
    use crate::utils::stringzilla::sz_упорядочить_кучу_строк_rapid_в_ряд_строк;
    struct Ложные_окончания_с_исключениями {
        pub ряд_re: &'static [Regex],
        pub ряд_исключений: &'static rapidhash::fast::RapidHashSet<&'static str>,
    }
    static СТОПКА_ЛОЖНЫХ_ОКОНЧАНИЙ: LazyLock<
        [Ложные_окончания_с_исключениями; 4],
    > = LazyLock::new(|| {
        [
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ВАН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ВАН,
            },
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЕН,
            },
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ОН,
            },
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЁН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЁН,
            },
        ]
    });
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Regex; 31]> = LazyLock::new(|| {
        [
            //----------------------------------
            //ван
            //а
            Regex::new(r"(?i)ваная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)ванн$").unwrap(),
            Regex::new(r"(?i)ванние$").unwrap(),
            Regex::new(r"(?i)ваннием$").unwrap(),
            Regex::new(r"(?i)ванния$").unwrap(),
            Regex::new(r"(?i)ваннию$").unwrap(),
            Regex::new(r"(?i)ваннии$").unwrap(),
            Regex::new(r"(?i)ванний$").unwrap(),
            Regex::new(r"(?i)ванниям$").unwrap(),
            Regex::new(r"(?i)ванниями$").unwrap(),
            Regex::new(r"(?i)ванниях$").unwrap(),
            //
            Regex::new(r"(?i)ванна$").unwrap(),
            Regex::new(r"(?i)ванно$").unwrap(),
            Regex::new(r"(?i)ванны$").unwrap(),
            //ую
            Regex::new(r"(?i)ваную$").unwrap(),
            //о
            Regex::new(r"(?i)ваное$").unwrap(),
            Regex::new(r"(?i)ваного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)ваном$").unwrap(),
            Regex::new(r"(?i)ваному$").unwrap(),
            Regex::new(r"(?i)ваность$").unwrap(),
            Regex::new(r"(?i)ваностю$").unwrap(),
            Regex::new(r"(?i)ваности$").unwrap(),
            Regex::new(r"(?i)ваностей$").unwrap(),
            Regex::new(r"(?i)ваностям$").unwrap(),
            Regex::new(r"(?i)ваностями$").unwrap(),
            Regex::new(r"(?i)ваностях$").unwrap(),
            //ыа
            Regex::new(r"(?i)ваным$").unwrap(),
            Regex::new(r"(?i)ваными$").unwrap(),
            Regex::new(r"(?i)ваных$").unwrap(),
            Regex::new(r"(?i)ваные$").unwrap(),
            Regex::new(r"(?i)ваный$").unwrap(),
        ]
        //----------------------------------
    });
    static RE_ИСКЛЮЧЕНИЯ_ВАН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter(["диваном"]));
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕН: LazyLock<[Regex; 18]> = LazyLock::new(|| {
        [
            //ен
            //а
            Regex::new(r"(?i)еная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)енн$").unwrap(),
            //Regex::new(r"(?i)енна$").unwrap(),
            //Regex::new(r"(?i)енно$").unwrap(),
            //Regex::new(r"(?i)енны$").unwrap(),
            //ую
            Regex::new(r"(?i)еную$").unwrap(),
            //о
            Regex::new(r"(?i)еное$").unwrap(),
            Regex::new(r"(?i)еного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)еном$").unwrap(),
            Regex::new(r"(?i)еному$").unwrap(),
            Regex::new(r"(?i)еность$").unwrap(),
            Regex::new(r"(?i)еностью$").unwrap(),
            Regex::new(r"(?i)ености$").unwrap(),
            Regex::new(r"(?i)еностей$").unwrap(),
            Regex::new(r"(?i)еностям$").unwrap(),
            Regex::new(r"(?i)еностями$").unwrap(),
            Regex::new(r"(?i)еностях$").unwrap(),
            //ы
            Regex::new(r"(?i)еным$").unwrap(),
            Regex::new(r"(?i)еными$").unwrap(),
            Regex::new(r"(?i)еных$").unwrap(),
            Regex::new(r"(?i)еные$").unwrap(),
            //----------------------------------
        ]
    });
    static RE_ИСКЛЮЧЕНИЯ_ЕН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| {
            rapidhash::fast::RapidHashSet::from_iter([
                "рекордсмен",
                "манекен",
                "орден",
                "концераген",
                "геном",
                "бизнесмен",
                "бармен",
                "антенн",
                "суперменом",
                "феноменом",
                "шатеном",
                "экзаменом",
                "доменом",
                "джентльменом",
                "голоценом",
                "авиазвеном",
                "промоушеном",
            ])
        });

    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЁН: LazyLock<[Regex; 18]> = LazyLock::new(|| {
        [
            //ён
            //а
            Regex::new(r"(?i)ёная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)ённ$").unwrap(),
            //Regex::new(r"(?i)ённа$").unwrap(),
            //Regex::new(r"(?i)ённо$").unwrap(),
            //Regex::new(r"(?i)ённы$").unwrap(),
            //ую
            Regex::new(r"(?i)ёную$").unwrap(),
            //о
            Regex::new(r"(?i)ёное$").unwrap(),
            Regex::new(r"(?i)ёного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)ёном$").unwrap(),
            Regex::new(r"(?i)ёному$").unwrap(),
            Regex::new(r"(?i)ёность$").unwrap(),
            Regex::new(r"(?i)ёностью$").unwrap(),
            Regex::new(r"(?i)ёности$").unwrap(),
            Regex::new(r"(?i)ёностей$").unwrap(),
            Regex::new(r"(?i)ёностям$").unwrap(),
            Regex::new(r"(?i)ёностями$").unwrap(),
            Regex::new(r"(?i)ёностях$").unwrap(),
            //ы
            Regex::new(r"(?i)ёным$").unwrap(),
            Regex::new(r"(?i)ёными$").unwrap(),
            Regex::new(r"(?i)ёных$").unwrap(),
            Regex::new(r"(?i)ёные$").unwrap(),
            //----------------------------------
            //----------------------------------
        ]
    });
    //
    static RE_ИСКЛЮЧЕНИЯ_ЁН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОН: LazyLock<[Regex; 17]> = LazyLock::new(|| {
        [
            //он
            Regex::new(r"(?i)оная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)онн$").unwrap(),
            //Regex::new(r"(?i)онна$").unwrap(),
            // Regex::new(r"(?i)онно$").unwrap(),
            //Regex::new(r"(?i)онны$").unwrap(),
            //ую
            Regex::new(r"(?i)оную$").unwrap(),
            //о
            Regex::new(r"(?i)оное$").unwrap(),
            Regex::new(r"(?i)оного$").unwrap(),
            //глаголы
            //Regex::new(r"(?i)оном$").unwrap(),
            Regex::new(r"(?i)оному$").unwrap(),
            Regex::new(r"(?i)оность$").unwrap(),
            Regex::new(r"(?i)оностью$").unwrap(),
            Regex::new(r"(?i)оности$").unwrap(),
            Regex::new(r"(?i)оностей$").unwrap(),
            Regex::new(r"(?i)оностям$").unwrap(),
            Regex::new(r"(?i)оностями$").unwrap(),
            Regex::new(r"(?i)оностях$").unwrap(),
            //ы
            Regex::new(r"(?i)оным$").unwrap(),
            Regex::new(r"(?i)оными$").unwrap(),
            Regex::new(r"(?i)оных$").unwrap(),
            Regex::new(r"(?i)оные$").unwrap(),
        ]
    });
    static RE_ИСКЛЮЧЕНИЯ_ОН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter(["скомпоную", "астроному"]));
    //
    let время_отсчёта_недопустимых_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недопустимых окончаний")).yellow(),
    );
    //
    let mut куча_недопустимых_окончаний_общий: rapidhash::fast::RapidHashSet<String> =
        rapidhash::fast::RapidHashSet::default();
    //
    for раздел in СТОПКА_ЛОЖНЫХ_ОКОНЧАНИЙ.iter() {
        //
        for образец in раздел.ряд_re.iter() {
            //
            let куча_1: rapidhash::fast::RapidHashSet<String> =
                основной_словарь.кучи_полные.искомые[0]
                    .простое
                    .iter()
                    .filter_map(|слово_в_куче| {
                        //
                        for исключающее_слово in раздел.ряд_исключений.iter()
                        {
                            if sz_найти(&слово_в_куче.0, исключающее_слово)
                                && !исключающее_слово.is_empty()
                            {
                                return None;
                            }
                        }
                        //
                        if образец.is_match(слово_в_куче.0.as_str()) {
                            Some(слово_в_куче.0.clone())
                        } else {
                            None
                        }
                    })
                    .collect::<rapidhash::fast::RapidHashSet<String>>();
            //
            /*let ряд_недопустимых_окончаний: Vec<String> =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча_1);*/
            //
            куча_недопустимых_окончаний_общий.extend(куча_1);
            //
        }
        //
    }
    let ряд_недопустимых_окончаний_общий =
        sz_упорядочить_кучу_строк_rapid_в_ряд_строк(
            куча_недопустимых_окончаний_общий,
        );
    //
    println!(
            "{}",
            style(format!(
                "⌚  Время занятое всего выполнения поиск недопустимых окончаний (от начала до конца): {:.2?}",
                время_отсчёта_недопустимых_окончаний.elapsed()
            ))
            .true_color(198, 100, 72)
        );
    return ряд_недопустимых_окончаний_общий;
}
