use crate::ui_gpui::gpui_main::Данные_при_загрузке;
use console::style;
use rapidhash::RapidHashMap;
use regex::Regex;
use std::sync::LazyLock;
use std::sync::atomic::{AtomicBool, Ordering};
use std::time::Instant;
//use clap::builder::Str;
//use convert_case::{Case, Casing};
//use rapidhash::*;
use crate::utils::stringzilla::{
    sz_найти, sz_найти_в_str, sz_упорядочить_кучу_строк_rapid_в_ряд_строк,
};
use Text_Changer::Вид_Окончания;
use rayon::prelude::*;

//
#[derive(Debug, Clone)]
pub struct Окончания_включающие {
    ячейка_re: &'static [Re_образцы],
    срез_окончаний: &'static [&'static str],
}
#[derive(Debug, Clone)]
pub struct RE_Окончания_Поиск {
    pub re_поиска: Regex,
    pub re_замена: Regex,
    pub окончание_строка: &'static str,
    pub вид_окончания: Вид_Окончания,
}

#[derive(Debug, Clone)]
pub struct Re_образцы {
    pub содержимое: RE_Окончания_Поиск,
    pub исключения_первой_очереди: &'static [RE_исключающее_окончание],
    pub исключения_второй_очереди: &'static [RE_исключающее_окончание],
}
#[derive(Debug, Clone)]
pub struct RE_исключающее_окончание {
    pub re_образец: Regex,
    pub окончание_строка: &'static str,
    pub вид_окончания: Вид_Окончания,
}

impl Default for RE_исключающее_окончание {
    fn default() -> Self {
        Self {
            re_образец: Regex::new(r"").unwrap(),
            окончание_строка: "",
            вид_окончания: Вид_Окончания::Не_определено, // какой-то дефолтный вариант
        }
    }
}
pub static ПУСТОЕ_RE_ИСКЛЮЧАЮЩЕЕ_ОКОНЧАНИЕ: LazyLock<
    [RE_исключающее_окончание; 0],
> = LazyLock::new(|| Default::default());
/*pub struct Regex_с_заменой {
    поиск: Regex,
    замена: Regex,
}*/

pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ: LazyLock<
    [RE_исключающее_окончание; 52],
> = LazyLock::new(|| {
    [
//под конец уже идут исключения
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)на$").unwrap(),
    окончание_строка: "на",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ная$").unwrap(),
    окончание_строка: "ная",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ную$").unwrap(),
    окончание_строка: "ную",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)но$").unwrap(),
    окончание_строка: "но",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ны$").unwrap(),
    окончание_строка: "ны",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ном$").unwrap(),
    окончание_строка: "ном",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ному$").unwrap(),
    окончание_строка: "ному",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)нно$").unwrap(),
    окончание_строка: "нно",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)но$").unwrap(),
    окончание_строка: "но",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ное$").unwrap(),
    окончание_строка: "ное",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ной$").unwrap(),
    окончание_строка: "ной",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ность$").unwrap(),
    окончание_строка: "ность",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностью$").unwrap(),
    окончание_строка: "ностью",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ности$").unwrap(),
    окончание_строка: "ности",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностей$").unwrap(),
    окончание_строка: "ностей",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностям$").unwrap(),
    окончание_строка: "ностям",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностями$").unwrap(),
    окончание_строка: "ностями",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ностях$").unwrap(),
    окончание_строка: "ностях",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ным$").unwrap(),
    окончание_строка: "ным",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ными$").unwrap(),
    окончание_строка: "ными",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ный$").unwrap(),
    окончание_строка: "ный",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ные$").unwrap(),
    окончание_строка: "ные",
    вид_окончания: Вид_Окончания::_Н,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ных$").unwrap(),
    окончание_строка: "ных",
      вид_окончания: Вид_Окончания::_Н,
},
//------------------то
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)та$").unwrap(),
    окончание_строка: "та",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тая$").unwrap(),
    окончание_строка: "тая",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тую$").unwrap(),
    окончание_строка: "тую",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ты$").unwrap(),
    окончание_строка: "ты",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)том$").unwrap(),
    окончание_строка: "том",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тому$").unwrap(),
    окончание_строка: "тому",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)то$").unwrap(),
    окончание_строка: "то",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)того$").unwrap(),
    окончание_строка: "того",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тое$").unwrap(),
    окончание_строка: "тое",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)той$").unwrap(),
    окончание_строка: "той",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тость$").unwrap(),
    окончание_строка: "тость",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостью$").unwrap(),
    окончание_строка: "тостью",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тости$").unwrap(),
    окончание_строка: "тости",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостей$").unwrap(),
    окончание_строка: "тостей",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостям$").unwrap(),
    окончание_строка: "тостям",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостями$").unwrap(),
    окончание_строка: "тостями",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тостях$").unwrap(),
    окончание_строка: "тостях",
    вид_окончания: Вид_Окончания::То,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тым$").unwrap(),
    окончание_строка: "тым",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тыми$").unwrap(),
    окончание_строка: "тыми",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тый$").unwrap(),
    окончание_строка: "тый",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тые$").unwrap(),
    окончание_строка: "тые",
    вид_окончания: Вид_Окончания::Ты,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)тых$").unwrap(),
    окончание_строка: "тых",
    вид_окончания: Вид_Окончания::Ты,
},
//
RE_исключающее_окончание {
   re_образец: Regex::new(r"(?i)ыю$").unwrap(),
   окончание_строка: "ыю",
   вид_окончания: Вид_Окончания::_Ы,
},
 RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ые$").unwrap(),
    окончание_строка: "ые",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ыт$").unwrap(),
    окончание_строка: "ыт",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ым$").unwrap(),
    окончание_строка: "ым",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ыми$").unwrap(),
    окончание_строка: "ыми",
    вид_окончания: Вид_Окончания::_Ы,
},
RE_исключающее_окончание {
    re_образец: Regex::new(r"(?i)ых$").unwrap(),
    окончание_строка: "ых",
    вид_окончания: Вид_Окончания::_Ы,
},
]
});
//
pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ: LazyLock<
    [RE_исключающее_окончание; 168],
> = LazyLock::new(|| {
    [
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ан$").unwrap(),
            окончание_строка: "ан",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ана$").unwrap(),
            окончание_строка: "ана",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анная$").unwrap(),
            окончание_строка: "анная",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анную$").unwrap(),
            окончание_строка: "анную",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ано$").unwrap(),
            окончание_строка: "ано",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)аны$").unwrap(),
            окончание_строка: "аны",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анном$").unwrap(),
            окончание_строка: "анном",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анному$").unwrap(),
            окончание_строка: "анному",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анно$").unwrap(),
            окончание_строка: "анно",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анного$").unwrap(),
            окончание_строка: "анного",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анное$").unwrap(),
            окончание_строка: "анное",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анной$").unwrap(),
            окончание_строка: "анной",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анность$").unwrap(),
            окончание_строка: "анность",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностью$").unwrap(),
            окончание_строка: "анностью",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анности$").unwrap(),
            окончание_строка: "анности",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностей$").unwrap(),
            окончание_строка: "анностей",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностям$").unwrap(),
            окончание_строка: "анностям",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностями$").unwrap(),
            окончание_строка: "анностями",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анностях$").unwrap(),
            окончание_строка: "анностях",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анным$").unwrap(),
            окончание_строка: "анным",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анными$").unwrap(),
            окончание_строка: "анными",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анный$").unwrap(),
            окончание_строка: "анный",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анные$").unwrap(),
            окончание_строка: "анные",
            вид_окончания: Вид_Окончания::Ан,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)анных$").unwrap(),
            окончание_строка: "анных",
            вид_окончания: Вид_Окончания::Ан,
        },
        //-------------------------------------ён
        //ён
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ён$").unwrap(),
            окончание_строка: "ён",
            вид_окончания: Вид_Окончания::Ён,
        },
        //ёна
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёна$").unwrap(),
            окончание_строка: "ёна",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённая$").unwrap(),
            окончание_строка: "ённая",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённую$").unwrap(),
            окончание_строка: "ённую",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёно$").unwrap(),
            окончание_строка: "ёно",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёны$").unwrap(),
            окончание_строка: "ёны",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённом$").unwrap(),
            окончание_строка: "ённом",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённому$").unwrap(),
            окончание_строка: "ённому",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённого$").unwrap(),
            окончание_строка: "ённого",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённо$").unwrap(),
            окончание_строка: "ённо",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённое$").unwrap(),
            окончание_строка: "ённое",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённой$").unwrap(),
            окончание_строка: "ённой",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённость$").unwrap(),
            окончание_строка: "ённость",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостью$").unwrap(),
            окончание_строка: "ённостью",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённости$").unwrap(),
            окончание_строка: "ённости",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостей$").unwrap(),
            окончание_строка: "ённостей",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостям$").unwrap(),
            окончание_строка: "ённостям",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостями$").unwrap(),
            окончание_строка: "ённостями",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённостях$").unwrap(),
            окончание_строка: "ённостях",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённым$").unwrap(),
            окончание_строка: "ённым",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ёнными$").unwrap(),
            окончание_строка: "ёнными",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённый$").unwrap(),
            окончание_строка: "ённый",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённые$").unwrap(),
            окончание_строка: "ённые",
            вид_окончания: Вид_Окончания::Ён,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ённых$").unwrap(),
            окончание_строка: "ённых",
            вид_окончания: Вид_Окончания::Ён,
        },
        //ен
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ен$").unwrap(),
            окончание_строка: "ен",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ена$").unwrap(),
            окончание_строка: "ена",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енная$").unwrap(),
            окончание_строка: "енная",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енную$").unwrap(),
            окончание_строка: "енную",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ено$").unwrap(),
            окончание_строка: "ено",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ены$").unwrap(),
            окончание_строка: "ены",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енном$").unwrap(),
            окончание_строка: "енном",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енному$").unwrap(),
            окончание_строка: "енному",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енного$").unwrap(),
            окончание_строка: "енного",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енно$").unwrap(),
            окончание_строка: "енно",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енное$").unwrap(),
            окончание_строка: "енное",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енной$").unwrap(),
            окончание_строка: "енной",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енность$").unwrap(),
            окончание_строка: "енность",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностью$").unwrap(),
            окончание_строка: "енностью",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енности$").unwrap(),
            окончание_строка: "енности",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностей$").unwrap(),
            окончание_строка: "енностей",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностям$").unwrap(),
            окончание_строка: "енностям",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностями$").unwrap(),
            окончание_строка: "енностями",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енностях$").unwrap(),
            окончание_строка: "енностях",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енным$").unwrap(),
            окончание_строка: "енным",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енными$").unwrap(),
            окончание_строка: "енными",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енный$").unwrap(),
            окончание_строка: "енный",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енные$").unwrap(),
            окончание_строка: "енные",
            вид_окончания: Вид_Окончания::Ен,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)енных$").unwrap(),
            окончание_строка: "енных",
            вид_окончания: Вид_Окончания::Ен,
        },
        //онн
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)он$").unwrap(),
            окончание_строка: "он",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)она$").unwrap(),
            окончание_строка: "она",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онная$").unwrap(),
            окончание_строка: "онная",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онную$").unwrap(),
            окончание_строка: "онную",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)оно$").unwrap(),
            окончание_строка: "оно",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)оны$").unwrap(),
            окончание_строка: "оны",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онном$").unwrap(),
            окончание_строка: "онном",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онному$").unwrap(),
            окончание_строка: "онному",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онно$").unwrap(),
            окончание_строка: "онно",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онного$").unwrap(),
            окончание_строка: "онного",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онное$").unwrap(),
            окончание_строка: "онное",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онной$").unwrap(),
            окончание_строка: "онной",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онность$").unwrap(),
            окончание_строка: "онность",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностью$").unwrap(),
            окончание_строка: "онностью",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онности$").unwrap(),
            окончание_строка: "онности",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностей$").unwrap(),
            окончание_строка: "онностей",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностям$").unwrap(),
            окончание_строка: "онностям",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностями$").unwrap(),
            окончание_строка: "онностями",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онностях$").unwrap(),
            окончание_строка: "онностях",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онным$").unwrap(),
            окончание_строка: "онным",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онными$").unwrap(),
            окончание_строка: "онными",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онный$").unwrap(),
            окончание_строка: "онный",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онные$").unwrap(),
            окончание_строка: "онные",
            вид_окончания: Вид_Окончания::Он,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)онных$").unwrap(),
            окончание_строка: "онных",
            вид_окончания: Вид_Окончания::Он,
        },
        //------------------ит
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ит$").unwrap(),
            окончание_строка: "ит",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ита$").unwrap(),
            окончание_строка: "ита",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итая$").unwrap(),
            окончание_строка: "итая",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итую$").unwrap(),
            окончание_строка: "итую",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ито$").unwrap(),
            окончание_строка: "ито",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)иты$").unwrap(),
            окончание_строка: "иты",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итом$").unwrap(),
            окончание_строка: "итом",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итому$").unwrap(),
            окончание_строка: "итому",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ито$").unwrap(),
            окончание_строка: "ито",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итого$").unwrap(),
            окончание_строка: "итого",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итое$").unwrap(),
            окончание_строка: "итое",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итой$").unwrap(),
            окончание_строка: "итой",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итость$").unwrap(),
            окончание_строка: "итость",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостью$").unwrap(),
            окончание_строка: "итостью",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итости$").unwrap(),
            окончание_строка: "итости",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостей$").unwrap(),
            окончание_строка: "итостей",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостям$").unwrap(),
            окончание_строка: "итостям",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостями$").unwrap(),
            окончание_строка: "итостями",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итостях$").unwrap(),
            окончание_строка: "итостях",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итым$").unwrap(),
            окончание_строка: "итым",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итыми$").unwrap(),
            окончание_строка: "итыми",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итый$").unwrap(),
            окончание_строка: "итый",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итые$").unwrap(),
            окончание_строка: "итые",
            вид_окончания: Вид_Окончания::Ит,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)итых$").unwrap(),
            окончание_строка: "итых",
            вид_окончания: Вид_Окончания::Ит,
        },
        //ем
        //----------------
        //онн
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ем$").unwrap(),
            окончание_строка: "ем",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ема$").unwrap(),
            окончание_строка: "ема",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емая$").unwrap(),
            окончание_строка: "емая",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емую$").unwrap(),
            окончание_строка: "емую",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емо$").unwrap(),
            окончание_строка: "емо",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емы$").unwrap(),
            окончание_строка: "емы",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емом$").unwrap(),
            окончание_строка: "емом",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емому$").unwrap(),
            окончание_строка: "емому",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емо$").unwrap(),
            окончание_строка: "емо",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емого$").unwrap(),
            окончание_строка: "емого",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емое$").unwrap(),
            окончание_строка: "емое",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емой$").unwrap(),
            окончание_строка: "емой",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емость$").unwrap(),
            окончание_строка: "емость",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостью$").unwrap(),
            окончание_строка: "емостью",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емости$").unwrap(),
            окончание_строка: "емости",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостей$").unwrap(),
            окончание_строка: "емостей",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостям$").unwrap(),
            окончание_строка: "емостям",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостями$").unwrap(),
            окончание_строка: "емостями",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емостях$").unwrap(),
            окончание_строка: "емостях",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емым$").unwrap(),
            окончание_строка: "емым",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емыми$").unwrap(),
            окончание_строка: "емыми",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емый$").unwrap(),
            окончание_строка: "емый",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емые$").unwrap(),
            окончание_строка: "емые",
            вид_окончания: Вид_Окончания::Ем,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)емых$").unwrap(),
            окончание_строка: "емых",
            вид_окончания: Вид_Окончания::Ем,
        },
        //--------------------
        // ван
        //ен
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ван$").unwrap(),
            окончание_строка: "ван",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)вана$").unwrap(),
            окончание_строка: "вана",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванная$").unwrap(),
            окончание_строка: "ванная",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванную$").unwrap(),
            окончание_строка: "ванную",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)вано$").unwrap(),
            окончание_строка: "вано",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ваны$").unwrap(),
            окончание_строка: "ваны",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванном$").unwrap(),
            окончание_строка: "ванном",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванному$").unwrap(),
            окончание_строка: "ванному",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванного$").unwrap(),
            окончание_строка: "ванного",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванно$").unwrap(),
            окончание_строка: "ванно",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванное$").unwrap(),
            окончание_строка: "ванное",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванной$").unwrap(),
            окончание_строка: "ванной",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванность$").unwrap(),
            окончание_строка: "ванность",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностью$").unwrap(),
            окончание_строка: "ванностью",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванности$").unwrap(),
            окончание_строка: "ванности",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностей$").unwrap(),
            окончание_строка: "ванностей",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностям$").unwrap(),
            окончание_строка: "ванностям",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностями$").unwrap(),
            окончание_строка: "ванностями",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванностях$").unwrap(),
            окончание_строка: "ванностях",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванным$").unwrap(),
            окончание_строка: "ванным",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванными$").unwrap(),
            окончание_строка: "ванными",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванный$").unwrap(),
            окончание_строка: "ванный",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванные$").unwrap(),
            окончание_строка: "ванные",
            вид_окончания: Вид_Окончания::Ван,
        },
        RE_исключающее_окончание {
            re_образец: Regex::new(r"(?i)ванных$").unwrap(),
            окончание_строка: "ванных",
            вид_окончания: Вид_Окончания::Ван,
        },
        //
    ]
});
pub fn проверка_окончания_re_и_слова_через_sz_RE_исключающее_окончание(
    ячейка: &RE_исключающее_окончание,
) -> Result<(), String> {
    if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        return Err(format!(
            "В образце |{}| нет |{}|",
            &ячейка.re_образец.to_string(),
            ячейка.окончание_строка
        ));
    } else {
        return Ok(());
    }
}
pub fn проверка_окончания_re_и_слова_через_re_RE_исключающее_окончание(
    ячейка: &RE_исключающее_окончание,
) -> Result<(), String> {
    if !ячейка.re_образец.is_match(ячейка.окончание_строка)
    // if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        return Err(format!(
            "Образец RE |{}| не сходится с  |{}|",
            &ячейка.re_образец.to_string(),
            ячейка.окончание_строка
        ));
    } else {
        return Ok(());
    }
}
//
pub fn проверка_окончания_re_и_слова_RE_Окончания_Поиск(
    ячейка: &RE_Окончания_Поиск,
) -> Result<(), rapidhash::fast::RapidHashSet<String>> {
    let mut куча: rapidhash::fast::RapidHashSet<String> = rapidhash::fast::RapidHashSet::default();
    if !sz_найти_в_str(ячейка.re_поиска.as_str(), &ячейка.вид_окончания.to_string())
    {
        куча.insert(format!(
            "0-В образце re поиска |{}| нет окончания |{}|",
            ячейка.re_поиска.as_str(),
            ячейка.окончание_строка
        ));
    }
    if !sz_найти_в_str(ячейка.re_замена.as_str(), &ячейка.вид_окончания.to_string())
    {
        куча.insert(format!(
            "1-В образце re замены |{}| нет окончания |{}|",
            ячейка.re_замена.as_str(),
            ячейка.окончание_строка
        ));
    }
    if !sz_найти_в_str(&ячейка.вид_окончания.to_string(), &ячейка.окончание_строка)
    {
        куча.insert(format!(
            "2-В образце (окончание_строка) |{}| нет окончания |{}|",
            &ячейка.re_поиска.to_string(),
            ячейка.окончание_строка
        ));
    }
    //
    if !sz_найти_в_str(&ячейка.re_поиска.as_str(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "3-В образце re поиска |{}| нет |{}|",
            &ячейка.re_поиска.to_string(),
            ячейка.окончание_строка
        ));
    }
    if !sz_найти_в_str(&ячейка.re_замена.as_str(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "4-В образце re замены |{}| нет |{}|",
            &ячейка.re_замена.to_string(),
            ячейка.окончание_строка
        ));
    }
    if !ячейка
        .re_поиска
        .is_match(&format!("добавка{}", ячейка.окончание_строка))
    // if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "5-Образец RE поиска |{}| не сходится с  |{}|",
            &ячейка.re_поиска.to_string(),
            format!("добавка{}", ячейка.окончание_строка)
        ));
    }
    if !ячейка.re_замена.is_match(ячейка.окончание_строка)
    // if !sz_найти(&ячейка.re_образец.to_string(), ячейка.окончание_строка)
    {
        куча.insert(format!(
            "6-Образец RE замены |{}| не сходится с  |{}|",
            &ячейка.re_замена.to_string(),
            ячейка.окончание_строка
        ));
    }
    match куча.is_empty() {
        true => Ok(()),
        false => return Err(куча),
    }
}
pub fn проверка_окончаний_включающих_re_образцов(//  стопка: &Окончания_включающие
) {
    проверка_конечных_окончаний_re_образцов();
    проверка_начальных_окончаний_re_образцов();
}
//
pub fn проверка_начальных_окончаний_re_образцов() {
    use crate::utils::functions::вывод_сообщений_на_экран;
    //RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ
    //if счётчик_входа.load(Ordering::Relaxed) == 0 {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    //сама проверка
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        //println!("Заход проверки lazy static");
        //проверка на повторы
        let куча: rapidhash::fast::RapidHashSet<String> =
            RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН
                .iter()
                .flat_map(|ячейка| {
                    проверка_окончания_re_и_слова_RE_Окончания_Поиск(
                               &ячейка.содержимое,
                           )
                           .err()
                           .into_iter()
                           .flatten()
                })
                .collect();

        let упорядоченный_ряд =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча);
        if упорядоченный_ряд.len() > 0 {
            //
            вывод_сообщений_на_экран(
                "RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН ошибки",
                &упорядоченный_ряд,
            );
        }
    }
    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}
//
pub fn проверка_окончаний_в_заменах_ен_исключениях() {
    use crate::utils::functions::вывод_сообщений_на_экран;
    //RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ
    //if счётчик_входа.load(Ordering::Relaxed) == 0 {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    //сама проверка
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        //println!("Заход проверки lazy static");
        //проверка на повторы
        let куча_1: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_sz_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //проверка на повторы
        let куча_2: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_re_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //
        let куча: rapidhash::fast::RapidHashSet<String> =
            куча_1.into_iter().chain(куча_2).collect();
        //
        //проверка на повторы
        let куча_1: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_sz_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //проверка на повторы
        let куча_2: rapidhash::fast::RapidHashSet<String> =
            RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ
                .iter()
                .filter_map(|ячейка| {
                    match проверка_окончания_re_и_слова_через_re_RE_исключающее_окончание(ячейка)
                    {
                        Ok(()) => None,
                        Err(ошибка) => Some(ошибка),
                    }
                })
                .collect();
        //
        let куча2: rapidhash::fast::RapidHashSet<String> =
            куча_1.into_iter().chain(куча_2).collect();
        //
        let куча: rapidhash::fast::RapidHashSet<String> = куча.into_iter().chain(куча2).collect();
        //
        let упорядоченный_ряд =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча);
        if упорядоченный_ряд.len() > 0 {
            //
            вывод_сообщений_на_экран(
                "RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ+RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ ошибки",
                &упорядоченный_ряд,
            );
        }
    }
    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}

//
pub static ПУСТОЙ_РЯД_RE: LazyLock<[Regex; 0]> = LazyLock::new(|| Default::default());
//
pub static RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН: LazyLock<[Regex; 42]> = LazyLock::new(|| {
    [
        //ен
        //а
        Regex::new(r"(?i)еная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)енн$").unwrap(),
        Regex::new(r"(?i)енна$").unwrap(),
        Regex::new(r"(?i)енно$").unwrap(),
        Regex::new(r"(?i)енны$").unwrap(),
        //ую
        Regex::new(r"(?i)еную$").unwrap(),
        //о
        Regex::new(r"(?i)еное$").unwrap(),
        Regex::new(r"(?i)еного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)еном$").unwrap(),
        Regex::new(r"(?i)еному$").unwrap(),
        Regex::new(r"(?i)еность$").unwrap(),
        Regex::new(r"(?i)еностью$").unwrap(),
        Regex::new(r"(?i)ености$").unwrap(),
        Regex::new(r"(?i)еностей$").unwrap(),
        Regex::new(r"(?i)еностям$").unwrap(),
        Regex::new(r"(?i)еностями$").unwrap(),
        Regex::new(r"(?i)еностях$").unwrap(),
        //ы
        Regex::new(r"(?i)еным$").unwrap(),
        Regex::new(r"(?i)еными$").unwrap(),
        Regex::new(r"(?i)еных$").unwrap(),
        Regex::new(r"(?i)еные$").unwrap(),
        //----------------------------------);
        //ён
        //а
        Regex::new(r"(?i)ёная$").unwrap(),
        //одиночн
        Regex::new(r"(?i)ённ$").unwrap(),
        Regex::new(r"(?i)ённа$").unwrap(),
        Regex::new(r"(?i)ённо$").unwrap(),
        Regex::new(r"(?i)ённы$").unwrap(),
        //ую
        Regex::new(r"(?i)ёную$").unwrap(),
        //о
        Regex::new(r"(?i)ёное$").unwrap(),
        Regex::new(r"(?i)ёного$").unwrap(),
        //глаголы
        Regex::new(r"(?i)ёном$").unwrap(),
        Regex::new(r"(?i)ёному$").unwrap(),
        Regex::new(r"(?i)ёность$").unwrap(),
        Regex::new(r"(?i)ёностью$").unwrap(),
        Regex::new(r"(?i)ёности$").unwrap(),
        Regex::new(r"(?i)ёностей$").unwrap(),
        Regex::new(r"(?i)ёностям$").unwrap(),
        Regex::new(r"(?i)ёностями$").unwrap(),
        Regex::new(r"(?i)ёностях$").unwrap(),
        //ы
        Regex::new(r"(?i)ёным$").unwrap(),
        Regex::new(r"(?i)ёными$").unwrap(),
        Regex::new(r"(?i)ёных$").unwrap(),
        Regex::new(r"(?i)ёные$").unwrap(),
        //----------------------------------);
        //
    ]
});
//
static RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Re_образцы; 23]> = LazyLock::new(|| {
    [
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ван)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ван)$").unwrap(),
                окончание_строка: "ван",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вана)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вана)$").unwrap(),
                окончание_строка: "вана",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(вано)$").unwrap(),
                re_замена: Regex::new(r"(?i)(вано)$").unwrap(),
                окончание_строка: "вано",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ваны)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ваны)$").unwrap(),
                окончание_строка: "ваны",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванная)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванная)$").unwrap(),
                окончание_строка: "ванная",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванную)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванную)$").unwrap(),
                окончание_строка: "ванную",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванной)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванной)$").unwrap(),
                окончание_строка: "ванной",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванное)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванное)$").unwrap(),
                окончание_строка: "ванное",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванного)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванного)$").unwrap(),
                окончание_строка: "ванного",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванном)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванном)$").unwrap(),
                окончание_строка: "ванном",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванному)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванному)$").unwrap(),
                окончание_строка: "ванному",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванность)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванность)$").unwrap(),
                окончание_строка: "ванность",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностью)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностью)$").unwrap(),
                окончание_строка: "ванностью",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванности)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванности)$").unwrap(),
                окончание_строка: "ванности",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностей)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностей)$").unwrap(),
                окончание_строка: "ванностей",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностям)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностям)$").unwrap(),
                окончание_строка: "ванностям",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностями)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностями)$").unwrap(),
                окончание_строка: "ванностями",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванностях)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванностях)$").unwrap(),
                окончание_строка: "ванностях",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванным)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванным)$").unwrap(),
                окончание_строка: "ванным",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванными)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванными)$").unwrap(),
                окончание_строка: "ванными",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванных)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванных)$").unwrap(),
                окончание_строка: "ванных",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванные)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванные)$").unwrap(),
                окончание_строка: "ванные",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
        Re_образцы {
            содержимое: RE_Окончания_Поиск {
                re_поиска: Regex::new(r"(?i)\w+(ванный)$").unwrap(),
                re_замена: Regex::new(r"(?i)(ванный)$").unwrap(),
                окончание_строка: "ванный",
                вид_окончания: Вид_Окончания::Ван,
            },
            исключения_первой_очереди:
                &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ЕН_ИСКЛЮЧЕНИЯ,
                исключения_второй_очереди:
                    &*RE_ОКОНЧАНИЯ_В_ЗАМЕНАХ_ИСКЛЮЧЕНИЯ_ВТОРОЙ_ОЧЕРЕДИ,
        },
    ]
});
//
pub const КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН: [&'static str; 23] = [
    "ван",
    "вана",
    "вано",
    "ваны",
    //
    "ванная",
    "ванную",
    //о
    "ванной",
    "ванное",
    "ванного",
    //глаголы
    "ванном",
    "ванному",
    //ст
    "ванность",
    "ванностью",
    "ванности",
    "ванностей",
    "ванностям",
    "ванностями",
    "ванностях",
    //ы
    "ванными",
    "ванным",
    "ванных",
    "ванные",
    "ванный",
];
//
pub fn проверка_среза_строк_на_неповтор(
    срез: &[&'static str],
    имя_кучи: &str,
) {
    let mut куча: rapidhash::fast::RapidHashSet<&str> = rapidhash::fast::RapidHashSet::default();
    //сама проверка
    for ячейка in срез.iter() {
        if !куча.contains(ячейка) {
            куча.insert(ячейка);
        } else {
            println!("Куча |{}| повторно содержит образец |{}|", имя_кучи, ячейка)
        }
    }

    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}
pub fn проверка_конечных_окончаний_re_образцов() {
    static СЧЁТЧИК_ПРОВЕРКИ: AtomicBool = AtomicBool::new(false);
    if !СЧЁТЧИК_ПРОВЕРКИ.swap(true, Ordering::SeqCst) {
        проверка_среза_строк_на_неповтор(
            &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
            "КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН",
        );
    }

    // счётчик_входа.fetch_add(1, Ordering::Relaxed);
}
//
#[derive(Debug)]
pub struct Вид_Окончания_со_строкой {
    pub строка: &'static str,
    pub re_выдер: Regex,
    pub вид_окончания: Вид_Окончания,
}
impl Default for Вид_Окончания_со_строкой {
    fn default() -> Self {
        Self {
            строка: "",
            re_выдер: Regex::new(r"").unwrap(),
            вид_окончания: Вид_Окончания::Не_определено,
        }
    }
}

#[derive(Debug)]
pub struct Виды_Окончаний_сборные {
    pub первая_очередь: Vec<Вид_Окончания_со_строкой>,
    pub вторая_очередь: Vec<Вид_Окончания_со_строкой>,
    pub куча_окончаний: rapidhash::fast::RapidHashSet<&'static str>,
}
pub trait Возможности_торжка {
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_исключающее_окончание,
        изначальное_окончание: &RE_Окончания_Поиск,
    ) -> Result<&Вид_Окончания_со_строкой, String>;
    //
    fn найти_окончание_к_слову_замене(
        &self,
        искомое_окончание: &str,
        ячейка_выдера: &Вид_Окончания_со_строкой,
    ) -> Result<&Вид_Окончания_со_строкой, String>;
    //
}
impl Возможности_торжка for [Виды_Окончаний_сборные] {
    //
    fn найти_окончание_к_слову_замене(
        &self,
        искомое_окончание: &str,
        ячейка_выдера: &Вид_Окончания_со_строкой,
    ) -> Result<&Вид_Окончания_со_строкой, String> {
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел.куча_окончаний.contains(искомое_окончание)
            {
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            /*println!(
                "найти_окончание_к_слову_замене -ищем окончание |{}|  в разделе |{:?}|",
                искомое_окончание,
                // искомое_окончание.as_bytes(),
                раздел.куча_окончаний,
            );*/
            /*for ячейка in раздел.куча_окончаний.iter() {
                println!("окончание |{}| побайтово |{:?}|", ячейка, ячейка.as_bytes());
            }*/
            if раздел.куча_окончаний.contains(искомое_окончание)
            {
                //
                println!(
                    "{}{}{}{}",
                    style(format!("найти_окончание_к_слову_замене - окончание ",)),
                    style(format!("|{}|", искомое_окончание)).cyan(),
                    style(format!(" найдено в разделе ",)),
                    style(format!("|{:?}|", раздел.куча_окончаний)).blue(),
                    /*"найти_окончание_к_слову_замене - окончание |{}| найдено в разделе |{:?}|",
                    искомое_окончание, раздел.куча_окончаний*/
                );
                let mut строка: String = String::new();
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                    строка = format!("{}+{}", строка, ячейка.вид_окончания.to_string());
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == ячейка_выдера.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                    строка = format!("{}+{}", строка, ячейка.вид_окончания.to_string());
                }
                //
                println!(
                    "{}{}{}{}",
                    style(format!("не нашло  вид исходного окончания ",)),
                    style(format!("|{}|", ячейка_выдера.вид_окончания)).cyan(),
                    style(format!(" в ряде ",)),
                    style(format!("|{}|", строка)).blue(),
                    /*"не нашло  вид исходного окончания |{}| в ряде |{}|",
                    ячейка_выдера.вид_окончания,
                    строка*/
                );
                return Err(format!(
                    "{}{}",
                    style(format!(
                        "найти_окончание_к_слову_замене - не нашло окончание для ",
                    )),
                    style(format!("|{}|", искомое_окончание)).cyan(),
                ));
            }
        }
        Err(format!(
            "{}{}",
            style(format!(
                "найти_окончание_к_слову_замене - не нашло окончание для ",
            )),
            style(format!("|{}|", искомое_окончание)).cyan(),
        ))
        //
    }
    //
    fn найти_окончание_выдера(
        &self,
        исключающее_окончание: &RE_исключающее_окончание,
        изначальное_окончание: &RE_Окончания_Поиск,
    ) -> Result<&Вид_Окончания_со_строкой, String> {
        //перебор внутри
        for раздел in self.iter() {
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&изначальное_окончание.окончание_строка)
            {
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        //перебор внутри
        for раздел in self.iter() {
            /*println!(
                "найти_окончание_выдера - ищем окончание |{}| в разделе |{:?}|",
                изначальное_окончание.окончание_строка, раздел.куча_окончаний,
            );*/
            //если содержит окончание  в куче
            if раздел
                .куча_окончаний
                .contains(&изначальное_окончание.окончание_строка)
            {
                //
                println!(
                    "найти_окончание_выдера - окончание |{}| найдено в разделе |{:?}|",
                    изначальное_окончание.окончание_строка, раздел.куча_окончаний
                );
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.первая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
                //перебор ячеек в разделе на предмет соответствия вида окончания
                for ячейка in раздел.вторая_очередь.iter() {
                    if ячейка.вид_окончания == исключающее_окончание.вид_окончания
                    {
                        return Ok(&ячейка);
                    }
                }
            }
        }
        Err(format!(
            "Найти окончание выдера - не нашло окончание для |{}|",
            изначальное_окончание.re_поиска
        ))
    }
}
pub static ТОРЖОК_ОКОНЧАНИЙ: LazyLock<[Виды_Окончаний_сборные; 24]> = LazyLock::new(|| {
    [
        //
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ван", "ен", "ён", "он", "ан", "ит", "ем", "ыт", "т", "н",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ван",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ван)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ен",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ен)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ем",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ем)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ён",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ён)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "он",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(он)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ан",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ан)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ит",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ит)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыт",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыт)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "т",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(т)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)()$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "н",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(н)$").unwrap(),
                },
            ],
        },
        //вана
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вана", "ена", "ема", "ёна", "она", "ана", "на", "ита", "ыта", "та",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "вана",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вана)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ена",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ена)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ема",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(ема)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ёна",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёна)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "она",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(она)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ана",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ана)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ита",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ита)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыта",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыта)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "та",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(та)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "на",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(на)$").unwrap(),
                },
            ],
        },
        //
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "вано", "ено", "емо", "ёно", "оно", "ано", "но", "ито", "ыто", "то",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "вано",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(вано)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ено",
                    вид_окончания: Вид_Окончания::Ен,

                    re_выдер: Regex::new(r"(?i)(ено)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емо",
                    вид_окончания: Вид_Окончания::Ем,

                    re_выдер: Regex::new(r"(?i)(емо)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ёно",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёно)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "оно",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оно)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ано",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(ано)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ито",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(ито)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыто",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыто)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "то",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "то",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(то)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "но",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(но)$").unwrap(),
                },
            ],
        },
        //оны
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ваны", "ены", "емы", "ёны", "оны", "аны", "ны", "иты", "ыты", "те",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ваны",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ваны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ены",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(ены)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емы",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емы)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ёны",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "оны",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(оны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "аны",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(аны)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "иты",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(иты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ыты",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ыты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "те",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(те)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ты",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(ты)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ны",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ны)$").unwrap(),
                },
            ],
        },
        //ванный
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванный",
                "енный",
                "емый",
                "ённый",
                "онный",
                "анный",
                "ный",
                "итый",
                "ытый",
                "авший",
                "той",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авший",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авший)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                },
            ],
        },
        //ванных
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванных",
                "енных",
                "емых",
                "ённых",
                "онных",
                "анных",
                "ных",
                "итых",
                "ваших",
                "ытых",
                "тех",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванных",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енных",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емых",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённых",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онных",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анных",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анных)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итых",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытых",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авших",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авших)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тех",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тех)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тых",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тых)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ных",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ных)$").unwrap(),
                },
            ],
        },
        //ванным
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванным",
                "енным",
                "емым",
                "ённым",
                "онным",
                "анным",
                "ным",
                "итым",
                "авшим",
                "ытым",
                "том",
                "тым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванным",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енным",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емым",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённым",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онным",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анным",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ным",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ным)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итым",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшим",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшим)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытым",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "том",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                },
            ],
            вторая_очередь: vec![Вид_Окончания_со_строкой {
                строка: "тым",
                вид_окончания: Вид_Окончания::Ты,
                re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
            }],
        },
        //ванными
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванными",
                "енными",
                "емыми",
                "ёнными",
                "онными",
                "анными",
                "ными",
                "итыми",
                "авшими",
                "ытыми",
                "тыми",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванными",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енными",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емыми",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ёнными",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ёнными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онными",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анными",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анными)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итыми",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшими",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшими)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытыми",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытыми)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тыми",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тыми)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ными",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ными)$").unwrap(),
                },
            ],
        },
        //ванный
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванный",
                "енный",
                "емый",
                "ённый",
                "онный",
                "анный",
                "ный",
                "итый",
                "авший",
                "ытый",
                "тый",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванный",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емый",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енный",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённый",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онный",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анный",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анный)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итый",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авший",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авший)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытый",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытый)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тый",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тый)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ный",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ный)$").unwrap(),
                },
            ],
        },
        //ванная
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванная",
                "енная",
                "емая",
                "ённая",
                "онная",
                "анная",
                "ная",
                "итая",
                "авшая",
                "ытая",
                "тая",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванная",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емая",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енная",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённая",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онная",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анная",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анная)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итая",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшая",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытая",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытая)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тая",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тая",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тая)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ная",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ная)$").unwrap(),
                },
            ],
        },
        //ванную
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванную",
                "енную",
                "емую",
                "ённую",
                "онную",
                "анную",
                "ную",
                "итую",
                "авшую",
                "ытую",
                "тую",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванную",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емую",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енную",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённую",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онную",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анную",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анную)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итую",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшую",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытую",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытую)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тую",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тую",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тую)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ную",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ную)$").unwrap(),
                },
            ],
        },
        //ванном
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванном",
                "енном",
                "емом",
                "ённом",
                "онном",
                "анном",
                "ном",
                "итом",
                "авшем",
                "ытом",
                "том",
                "тым",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванном",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емом",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енном",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённом",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онном",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анном",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анном)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итом",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итом)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшем",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшем)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытом",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытом)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "том",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(том)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тым",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тым)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ном",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ном)$").unwrap(),
                },
            ],
        },
        //ванному
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванному",
                "енному",
                "емому",
                "ённому",
                "онному",
                "анному",
                "ному",
                "итому",
                "авшему",
                "ытому",
                "тому",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванному",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емому",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енному",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённому",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онному",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анному",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анному)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итому",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшему",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшему)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытому",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытому)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тому",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тому",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тому)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ному",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ному)$").unwrap(),
                },
            ],
        },
        //ванного
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванного",
                "енного",
                "емого",
                "ённого",
                "онного",
                "анного",
                "ного",
                "итого",
                "авшего",
                "ытого",
                "того",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванного",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емого",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енного",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённого",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онного",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анного",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анного)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итого",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итого)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшего",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшего)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытого",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытого)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "того",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "того",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(того)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ного",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ного)$").unwrap(),
                },
            ],
        },
        //ванное
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванное",
                "енное",
                "емое",
                "ённое",
                "онное",
                "анное",
                "ное",
                "итое",
                "авшее",
                "ытое",
                "тое",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванное",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емое",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енное",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённое",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онное",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анное",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анное)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итое",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшее",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшее)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытое",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытое)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тое",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тое",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тое)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ное",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ное)$").unwrap(),
                },
            ],
        },
        //ванные
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванные",
                "енные",
                "емые",
                "ённые",
                "онные",
                "анные",
                "ные",
                "итые",
                "авшие",
                "ытые",
                "тые",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванные",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емые",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енные",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённые",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онные",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анные",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итые",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшие",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшие)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытые",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытые)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ные",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ные)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тые",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тые",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тые)$").unwrap(),
                },
            ],
        },
        //ванной
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванной",
                "енной",
                "емой",
                "ённой",
                "онной",
                "анной",
                "ной",
                "итой",
                "авшей",
                "ытой",
                "той",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванной",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емой",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енной",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённой",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онной",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анной",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анной)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итой",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итой)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшей",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытой",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытой)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "той",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(той)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ной",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ной)$").unwrap(),
                },
            ],
        },
        //ванность
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванность",
                "енность",
                "емость",
                "ённость",
                "онность",
                "анность",
                "ность",
                "итость",
                "авшесть",
                "ытость",
                "тость",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванность",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емость",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енность",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённость",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онность",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анность",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анность)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итость",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшесть",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшесть)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытость",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытость)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тость",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тость",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тость)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ность",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ность)$").unwrap(),
                },
            ],
        },
        //ванностью
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностью",
                "енностью",
                "емостью",
                "ённостью",
                "онностью",
                "анностью",
                "ностью",
                "итостью",
                "авшестью",
                "ытостью",
                "тостью",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностью",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостью",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енностью",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостью",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностью",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностью",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостью",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестью",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостью",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостью)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостью",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостью)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностью",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностью)$").unwrap(),
                },
            ],
        },
        //ванности
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванности",
                "емости",
                "енности",
                "ённости",
                "онности",
                "анности",
                "ности",
                "итости",
                "авшести",
                "ытости",
                "тости",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванности",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емости",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енности",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённости",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онности",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анности",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анности)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итости",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшести",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшести)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытости",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытости)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тости",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тости",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тости)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ности",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ности)$").unwrap(),
                },
            ],
        },
        //ванностей
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностей",
                "енностей",
                "емостей",
                "ённостей",
                "онностей",
                "анностей",
                "ностей",
                "итостей",
                "авшестей",
                "ытостей",
                "тостей",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностей",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостей",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енностей",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостей",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностей",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностей",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостей",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестей",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостей",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостей)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостей",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостей)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностей",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностей)$").unwrap(),
                },
            ],
        },
        //ванностям
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностям",
                "енностям",
                "емостям",
                "ённостям",
                "онностям",
                "анностям",
                "ностям",
                "итостям",
                "авшестям",
                "ытостям",
                "тостям",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностям",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостям",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енностям",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостям",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностям",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностям",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостям",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестям",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостям",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостям)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостям",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостям)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностям",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностям)$").unwrap(),
                },
            ],
        },
        //ванностями
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностями",
                "енностями",
                "емостями",
                "ённостями",
                "онностями",
                "анностями",
                "ностями",
                "итостями",
                "авшестями",
                "ытостями",
                "тостями",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностями",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостями",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енностями",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостями",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностями",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностями",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостями",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестями",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостями",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостями)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостями",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостями)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностями",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностями)$").unwrap(),
                },
            ],
        },
        //ванностях
        Виды_Окончаний_сборные {
            куча_окончаний: rapidhash::fast::RapidHashSet::from_iter([
                "ванностях",
                "енностях",
                "емостях",
                "ённостях",
                "онностях",
                "анностях",
                "ностях",
                "итостях",
                "авшестях",
                "ытостях",
                "тостях",
            ]),
            первая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "ванностях",
                    вид_окончания: Вид_Окончания::Ван,
                    re_выдер: Regex::new(r"(?i)(ванностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "емостях",
                    вид_окончания: Вид_Окончания::Ем,
                    re_выдер: Regex::new(r"(?i)(емостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "енностях",
                    вид_окончания: Вид_Окончания::Ен,
                    re_выдер: Regex::new(r"(?i)(енностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ённостях",
                    вид_окончания: Вид_Окончания::Ён,
                    re_выдер: Regex::new(r"(?i)(ённостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "онностях",
                    вид_окончания: Вид_Окончания::Он,
                    re_выдер: Regex::new(r"(?i)(онностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "анностях",
                    вид_окончания: Вид_Окончания::Ан,
                    re_выдер: Regex::new(r"(?i)(анностях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "итостях",
                    вид_окончания: Вид_Окончания::Ит,
                    re_выдер: Regex::new(r"(?i)(итостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "авшестях",
                    вид_окончания: Вид_Окончания::Авш,
                    re_выдер: Regex::new(r"(?i)(авшестях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ытостях",
                    вид_окончания: Вид_Окончания::_Ы,
                    re_выдер: Regex::new(r"(?i)(ытостях)$").unwrap(),
                },
            ],
            вторая_очередь: vec![
                Вид_Окончания_со_строкой {
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::То,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "тостях",
                    вид_окончания: Вид_Окончания::Ты,
                    re_выдер: Regex::new(r"(?i)(тостях)$").unwrap(),
                },
                Вид_Окончания_со_строкой {
                    строка: "ностях",
                    вид_окончания: Вид_Окончания::_Н,
                    re_выдер: Regex::new(r"(?i)(ностях)$").unwrap(),
                },
            ],
        },
    ]
});

//
pub fn сравнить_основной_и_запасной_словари(
    основной_словарь: &Text_Changer::Полный_Словарь,
    запасной_словарь: &Text_Changer::Полный_Словарь,
) -> Result<(), ()> {
    println!(
        "Длина простых слов (всего): Основной - |{}| Запасной - |{}| поделажщих переводу |{}|",
        основной_словарь.простое.len() / 3,
        запасной_словарь.простое.len(),
        основной_словарь.перевести.len(),
    );
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    let куча_переведенных_слов_в_запасном_словаре: rapidhash::fast::RapidHashSet<&str> =
        запасной_словарь
            .простое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
        куча_переведенных_слов_в_запасном_словаре.len()
    );
    //
    let куча_простых_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .простое
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .составное
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_сложных_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .составное_важное
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    let куча_неизменных_коротких_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .неизменное_короткое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи простых слов - |{}|",
        куча_простых_слов.len() / 3
    );
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_словарь_запасной: rapidhash::fast::RapidHashSet<usize> =
        запасной_словарь
            .простое
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_простых_слов.contains(ячейка.искомое_слово.as_str())
                {
                    //если в составных словах тоже отсутствует
                    if !куча_составных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_составных_сложных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_неизменных_коротких_слов.contains(ячейка.искомое_слово.as_str())
                    {
                        Some(указатель)
                    } else {
                        None
                    }
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_страницу_не_переведённых_слов_главного_словаря: rapidhash::fast::RapidHashSet<usize> =
        основной_словарь
            .перевести
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_переведенных_слов_в_запасном_словаре.contains(ячейка.искомое_слово.as_str())
                {
                    Some(указатель)
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //
    println!(
        "Количество слов запасного словаря, которые отсутствуют в основном - |{}|",
        куча_указателей_на_словарь_запасной.len(),
    );
    println!(
        "куча_указателей_на_страницу_не_переведённых_слов_главного_словаря - |{}|",
        куча_указателей_на_страницу_не_переведённых_слов_главного_словаря.len(),
    );
    //
    crate::output::write::вывод_запасного_словаря_почищенного(
        &запасной_словарь,
        &куча_указателей_на_словарь_запасной,
        //
        &куча_указателей_на_страницу_не_переведённых_слов_главного_словаря,
        &основной_словарь,
        //
    )
    .unwrap();

    Ok(())
}
pub fn получить_замену(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    слово_искомое: &String,
) -> Result<String, String> {
    //
    let mut слово_замена: Text_Changer::Умная_Строка =
        Text_Changer::Умная_Строка::Пусто;
    //
    if let Some(значения) = основной_словарь.кучи_полные.искомые[0]
        .простое
        .get(слово_искомое)
    {
        let указатель: usize = значения.iter().copied().next().unwrap();
        //
        слово_замена = Text_Changer::Умная_Строка::создать_значение(
            основной_словарь.сам.простое[указатель].замена.clone(),
        );
        // }
    };
    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", слово_искомое));
        }
    }
}
pub fn получить_замену_по_указателю(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    ячейка: (
        &String,
        &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>,
    ),
) -> Result<String, String> {
    //
    //
    let указатель: usize = ячейка.1.iter().copied().next().unwrap();
    //
    let слово_замена = Text_Changer::Умная_Строка::создать_значение(
        основной_словарь.сам.простое[указатель].замена.clone(),
    );
    // }

    //
    match слово_замена {
        Text_Changer::Умная_Строка::Значение(_) => {
            return Ok(слово_замена.получить_значение());
        }
        Text_Changer::Умная_Строка::Пусто => {
            return Err(format!("Не нашлось замены для слова |{}|", ячейка.0));
        }
    }
}
//
pub fn найти_недостающие_слова(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
    пути_общие: &Text_Changer::Пути_Общие,
) -> Result<(), ()> {
    use Text_Changer::Вид_Окончания;
    проверка_окончаний_в_заменах_ен_исключениях();
    проверка_окончаний_включающих_re_образцов();
    //#![allow(non_snake_case, non_camel_case_types)]
    let время_отсчёта: Instant = Instant::now();
    // use crate::dictionary::выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания;
    use crate::output::write::вывод_недопустимых_и_недостающих_окончаний_в_xlsx;
    use crate::utils::stringzilla::sz_упорядочить_hashmap_в_слова_с_заменой;
    use Text_Changer::Слово_с_заменой;
    //

    //
    /*let куча_искомых_слов_с_указателями:rapidhash::fast::RapidHashMap<String, rapidhash::fast::RapidHashSet<usize>>=
    выделить_кучу_из_ряда_для_словаря_без_вырезания_окончания(&основной_словарь.кучи.куча_словарь_искомые[0].простое,&основной_словарь.сам.простое);*/
    //

    // где-то в коде, один раз:
    let стопка_ван: Окончания_включающие = Окончания_включающие {
        ячейка_re: &*RE_НАЧАЛЬНЫЕ_ОКОНЧАНИЯ_ВАН, // &[Regex; 1] → &[Regex] через coercion
        срез_окончаний: &КОНЕЧНЫЕ_ОКОНЧАНИЯ_ВАН,
    };
    //
    //
    //
    let время_отсчёта_недостающих_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недостающих окончаний"))
            .true_color(127, 255, 212)
            .bold(),
    );
    //
    /*for ячейка in основной_словарь.кучи_полные.искомые[0].простое.iter()
    {
        println!("слово |{}| куча-указатели |{:?}|", ячейка.0, ячейка.1);
    }*/
    /*let mut куча_сообщений: rapidhash::fast::RapidHashSet<String> =
    rapidhash::fast::RapidHashSet::default();*/
    //
    let стопка_недостающих_слов: RapidHashMap<String,String> = основной_словарь.кучи_полные.искомые[0]
        .простое
        .iter()
        .flat_map(|слово_в_куче: (&String, &std::collections::HashSet<usize, rapidhash::inner::RandomState<false, true, false, false>>)| {
            стопка_ван
                .ячейка_re
                .iter()
                .flat_map(|образец_re| {
                    if слово_в_куче.0.is_empty() {panic!("Есть пустое слово в перерводом |{}|",
                       получить_замену_по_указателю(
                            &основной_словарь,
                            слово_в_куче,
                        )
                        .unwrap()
                    )}
                    //есть ли окончание по образцу в слове из кучи - если нет, то следующее слово
                    if !образец_re.содержимое.re_поиска.is_match(слово_в_куче.0) {
                        //вернуть пустую
                        return rapidhash::fast::RapidHashMap::default();
                    }
                    //
                    let слово_замена_исходное = получить_замену_по_указателю(
                        &основной_словарь,
                        слово_в_куче,
                    )
                    .unwrap();
                    let наличие_пробелов_в_слове_замене = есть_ли_пробелы_в_слове(&слово_замена_исходное);
                    //искомое слово всегда обрезается успешно
                    let  обрезок_искомого_слова=образец_re.содержимое.re_замена.replace(слово_в_куче.0.as_str(), "").to_string();
                    //если нет такого окончания в слове - то следующее
                     let mut удачная_замена_окончания:bool=false;
                    //замена окончания
                        //объявляем обрезок
                         let обрезок_слова_замены: String=
                         match наличие_пробелов_в_слове_замене {
                             //если несколько слов в строке (не считая черты)
                             true=>слово_замена_исходное.clone(),
                             //если 1 слово в строке
                             false=>       {
                                 //
                                 if !образец_re.содержимое.re_поиска.is_match(&слово_замена_исходное) {
                                 //вернуть пустую
                                 //обрезок_слова_замены=слово_замена_исходное.clone();
                                 удачная_замена_окончания=false;
                                 слово_замена_исходное.clone()
                             } else {
                         удачная_замена_окончания=true;
                          образец_re.содержимое.re_замена.replace(слово_замена_исходное.as_str(), "").to_string()
                             }
                         },
                         };
                         //если обычный образец не подходит

                        //
                        if данные_при_загрузке.общий_ход {
                            println!("обрезок искомого слова |{обрезок_искомого_слова}| само слово исходное изначально |{}|\r\n",слово_в_куче.0);
                            if удачная_замена_окончания {
                                println!("удачная замена - обрезок_слова_замены |{обрезок_слова_замены}| само слово замена изначально |{}|\r\n",слово_замена_исходное);
                            } else {
                                 println!("Неудачная замена - обрезок_слова_замены |{обрезок_слова_замены}| образец для выдера |{}|\r\n", образец_re.содержимое.re_замена.to_string());
                            }
                        }
                    //
                    //проверяем всю кучу на предмет недостающих окончаний
                    стопка_ван
                        .срез_окончаний
                        .iter()
                        .filter_map(|образец| {
                            //
                            let искомое_слово_с_окончанием =
                                format!("{обрезок_искомого_слова}{образец}");
                            //если есть слово - то возращаем слово замену как есть
                            if наличие_пробелов_в_слове_замене {
                               return  Some(
                                    (искомое_слово_с_окончанием,обрезок_слова_замены.clone())
                                )
                            }

                            //
                            //теперь меняем окончание в слове-замене
                            let слово_замена_с_окончанием =
                                //
                            match удачная_замена_окончания {
                                //если удачно заменилось всё
                                true=>
                                format!("{обрезок_слова_замены}{образец}"),
                                //если нужно найти окончание в торжке
                                false=>{//обрезок_слова_замены.clone();
                                    let окончание_для_выдера_в_замене:&Вид_Окончания_со_строкой;
                                    match найти_замену_для_выдера(&образец_re,&обрезок_слова_замены,слово_в_куче.0,образец)  {
                                        Ok(успех)=>окончание_для_выдера_в_замене=успех,
                                        Err(ошибка)=>{
                                            println!("{}{}",
                                                style(format!("\r\n\t\t Неудача :")).red().bold(),

                                                 style(format!(" при поиске образца для выдера")).true_color(127, 255, 212).bold());
                                            //
                                              if наличие_пробелов_в_слове_замене {
                                            println!("наличие_пробелов_в_слове_замене |{наличие_пробелов_в_слове_замене}| в слове |{слово_замена_исходное}|");
                                              }
                                            let нужное_нерусское_слово:String=format!("{обрезок_искомого_слова}{образец}");
                                          println!("{}{}{}{}{}{}{}{}{}",
                                                style(format!("\r\nОшибка0:")).yellow(),
                                              style(format!(" не-руское слово ")),
                                                   style(format!("|{}|",слово_в_куче.0)).cyan(),
                                                    style(format!(" слово-замена ")),
                                                       style(format!("|{}|",обрезок_слова_замены)).blue(),
                                                        style(format!(" нужное_нерусское_слово ")),
                                                             style(format!("|{нужное_нерусское_слово}|")).true_color(127,255,212),
                                                               style(format!(" искомое окончание на замену ")),
                                                                 style(format!("|{образец}|")).red(),);

                                              /*\r\nОшибка0:искомое слово |{}| слово-замена |{}| нужное_нерусское_слово |{нужное_нерусское_слово}| искомое окончание на замену |{образец}|",
                                              слово_в_куче.0,обрезок_слова_замены);*/
                                              //
                                                println!("{}{}{}{}{}{}{}{}{}",
                                                        style(format!("Ошибка2:")).yellow(),
                                                    style(format!(" образец_re искомого слова [образец поиска")),
                                                     style(format!("|{}|",образец_re.содержимое.re_поиска)).cyan(),
                                                       style(format!(" re замена ")),
                                                        style(format!("|{}|",образец_re.содержимое.re_замена)).blue(),
                                                           style(format!(" вид окончания ")),
                                                            style(format!("|{}|",образец_re.содержимое.вид_окончания)).true_color(127,255,212),
                                                               style(format!(" окончание строка ")),
                                                                style(format!("|{}|",образец_re.содержимое.окончание_строка)).true_color(127,255,212),

                                                );
                                          /*println!("Ошибка2 :образец_re искомого слова [образец поиска|{}| re замены |{}| вид окончания |{}| окончание строка |{}|]\r\n",
                                              образец_re.содержимое.re_поиска,образец_re.содержимое.re_замена,образец_re.содержимое.вид_окончания,образец_re.содержимое.окончание_строка,
                                          );*/
                                          println!("{}",ошибка);
                                        //panic!("{}",ошибка)
                                        return Some(
                                            (искомое_слово_с_окончанием,слово_замена_исходное.clone())
                                        )
                                        },

                                    };
                                    //
                                      let окончание_добавочное:&Вид_Окончания_со_строкой;
                                      match найти_добавочное_окончание(&образец,&окончание_для_выдера_в_замене,слово_в_куче.0){
                                          Ok(успех)=>окончание_добавочное=успех,
                                          Err(ошибка)=>{
                                              println!("{}{}",
                                                   style(format!("\r\n\t\t Неудача :")).red().bold(),
                                                  style(format!(" при поиске добавочного окончания")).true_color(127, 255, 212).bold());
                                              //
                                              if наличие_пробелов_в_слове_замене {
                                                 println!("наличие_пробелов_в_слове_замене |{наличие_пробелов_в_слове_замене}| в слове |{слово_замена_исходное}|");
                                              }
                                                let нужное_нерусское_слово:String=format!("{обрезок_искомого_слова}{образец}");
                                                 println!("{}{}{}{}{}{}{}{}{}",
                                                      style(format!("\r\nОшибка0")).yellow(),
                                                     style(format!(" не-руское слово ")),
                                                          style(format!("|{}|",слово_в_куче.0)).cyan(),
                                                           style(format!(" слово-замена ")),
                                                              style(format!("|{}|",обрезок_слова_замены)).blue(),
                                                               style(format!(" нужное_нерусское_слово ")),
                                                                    style(format!("|{нужное_нерусское_слово}|")).true_color(127,255,212),
                                                                      style(format!(" искомое окончание на замену ")),
                                                                        style(format!("|{образец}|")).red(),);
                                                 //
                                              /*println!("\r\nОшибка0:искомое слово |{}| слово-замена |{}| нужное_нерусское_слово |{нужное_нерусское_слово}| искомое окончание на замену |{образец}|",
                                                  слово_в_куче.0,обрезок_слова_замены);*/
                                                 println!("{}{}{}{}{}{}{}{}",
                                                          style(format!("Ошибка1:")).yellow(),
                                                      style(format!(" окончание_для_выдера в замене [ re ")),
                                                       style(format!("|{}|",окончание_для_выдера_в_замене.re_выдер)).cyan(),
                                                        style(format!(" вид ")),
                                                                style(format!("|{}|",окончание_для_выдера_в_замене.вид_окончания)).blue(),
                                                                  style(format!(" окончание строка ")),
                                                                  style(format!("|{}|",окончание_для_выдера_в_замене.строка)).true_color(127,255,212),
                                                                    style(format!(" ]")),
                                                 );
                                                 //
                                              /*println!("Ошибка1: окончание_для_выдера в замене [ re |{}| вид |{}| окончание строка |{}|]\r\n",
                                                  окончание_для_выдера_в_замене.re_выдер,окончание_для_выдера_в_замене.вид_окончания,окончание_для_выдера_в_замене.строка
                                              );*/
                                               println!("{}{}{}{}{}{}{}{}{}",
                                                   style(format!("Ошибка2:")).yellow(),
                                               style(format!(" образец_re искомого слова [образец поиска")),
                                                style(format!("|{}|",образец_re.содержимое.re_поиска)).cyan(),
                                                  style(format!(" re замены ")),
                                                           style(format!("|{}|",образец_re.содержимое.re_замена)).blue(),
                                                             style(format!(" вид окончания ")),
                                                               style(format!("|{}|",образец_re.содержимое.вид_окончания)).true_color(127,255,212),
                                                               style(format!(" окончание строка ")),
                                                                 style(format!("|{}|",образец_re.содержимое.окончание_строка)).red(),
                                               );
                                              /*println!("Ошибка2 :образец_re искомого слова [образец поиска|{}| re замены |{}| вид окончания |{}| окончание строка |{}|]\r\n",
                                                  образец_re.содержимое.re_поиска,образец_re.содержимое.re_замена,образец_re.содержимое.вид_окончания,образец_re.содержимое.окончание_строка,
                                              );*/

                                              println!("{ошибка}");
                                              //panic!();
                                              return Some(
                                                  (искомое_слово_с_окончанием,слово_замена_исходное.clone())
                                              )
                                          }
                                      };
                                        let обрезок_замены=окончание_для_выдера_в_замене.re_выдер.replace(&обрезок_слова_замены, "").to_string();
                                         let итог:String=format!("{}{}",обрезок_замены,окончание_добавочное.строка);
                                        //
                                      if данные_при_загрузке.общий_ход {
                                              println!("\r\nОшибка4:слово замена |{}| окончание_для_выдера в замене |{}| окончание_добавочное |{}| итог |{итог}|",
                                                  обрезок_слова_замены,окончание_для_выдера_в_замене.строка,окончание_добавочное.строка);
                                      }
                                      итог
                                },
                            };
                            //если куча окончаний строчных не содержит данное окончание
                            if !основной_словарь.кучи_полные.искомые[0]
                                .простое
                                .contains_key(&искомое_слово_с_окончанием)
                            {
                                if данные_при_загрузке.общий_ход {
                                    println!("Добавляем: искомое_слово_с_окончанием |{искомое_слово_с_окончанием}| - слово_замена_с_окончанием |{слово_замена_с_окончанием}| слово_в_куче.0 |{}|\r\n",слово_в_куче.0);

                                }
                                Some(
                                    (искомое_слово_с_окончанием,слово_замена_с_окончанием)
                                )
                                //
                            } else {
                                None
                            }
                        })
                        .collect::<RapidHashMap<String,String>>()
                })
                .collect::<RapidHashMap<String,String>>()
        })
        .collect();
    //
    /*for сообщение in куча_сообщений.iter() {
        println!("{}", сообщение);
    }*/
    //кучу в общий вид привести с упорядочиванием
    let стопка_недостающих_слов: Vec<Слово_с_заменой> =
        sz_упорядочить_hashmap_в_слова_с_заменой(стопка_недостающих_слов);
    //вывод количества времени
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта_недостающих_окончаний.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    /*for ошибка in ряд_упорядоченный.iter() {
        println!(
            "{}{}{}{}",
            style(format!("Словарь ")),
            style(format!("|{вид_словаря}|")).red(),
            style(format!("не содержит ")),
            style(format!("|{ошибка}|")).cyan(),
        );
    }*/

    /*println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
    );*/
    let ряд_недопустимых_окончаний_общий =
        определение_недопустимых_окончаний(
            &основной_словарь,
            &вид_словаря,
            &данные_при_загрузке,
        );
    //
    вывод_недопустимых_и_недостающих_окончаний_в_xlsx(
        &стопка_недостающих_слов,
        &ряд_недопустимых_окончаний_общий,
        &вид_словаря,
        &данные_при_загрузке,
        &пути_общие,
    )
    .unwrap();
    //output времени затраченного в итоге
    println!(
        "{}",
        style(format!(
            "⌚  Время занятое всего выполнения поиск и вывод недопустимых/недостающих окончаний (от начала до конца): {:.2?}",
            время_отсчёта.elapsed()
        ))
        .true_color(198, 100, 72)
    );
    //
    Ok(())
}
#[allow(non_camel_case_types)]
pub fn проверка_что_нет_пересечений_искомых_слов(
    основной_словарь: &Text_Changer::Полный_Словарь,
    куча_словарь_искомые: &[Text_Changer::Куча_Словарь_Искомые_простые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
    вид_словаря: &Text_Changer::Вид_Словаря,
) -> Result<(), ()> {
    use Text_Changer::Ячейка_словаря;
    let точка_отсчёта_по_времени_2: Instant = Instant::now();
    //
    const КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ: usize = 8;
    //
    pub struct Подробный_Раздел_Словаря<'a> {
        pub ячейки: &'a Vec<Ячейка_словаря>,
        pub куча: &'a rapidhash::fast::RapidHashSet<String>,
        pub имя_раздела: Text_Changer::Раздел_Словаря,
    }
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    //
    let указатели_раздела_словаря: [Подробный_Раздел_Словаря;
        КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ] = [
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное,
            куча: &куча_словарь_искомые[0].составное,
            имя_раздела: Text_Changer::Раздел_Словаря::Составные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_важное,
            куча: &куча_словарь_искомые[0].составное_важное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_важные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_длинное,
            куча: &куча_словарь_искомые[0].составное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые,
            куча: &куча_словарь_искомые[0].запятые,
            имя_раздела: Text_Changer::Раздел_Словаря::Запятые,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые_длинные,
            куча: &куча_словарь_искомые[0].запятые_длинные,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Запятые_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное,
            куча: &куча_словарь_искомые[0].неизменное,
            имя_раздела: Text_Changer::Раздел_Словаря::Неизменные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_короткое,
            куча: &куча_словарь_искомые[0].неизменное_короткое,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_длинное,
            куча: &куча_словарь_искомые[0].неизменное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_длинные,
        },
    ];
    //сама проверка
    for указатель_уровня in 0..КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ {
        let условие_поиска_заглавных: bool =
            match указатели_раздела_словаря[указатель_уровня].имя_раздела
            {
                Text_Changer::Раздел_Словаря::Составные
                | Text_Changer::Раздел_Словаря::Составные_важные
                | Text_Changer::Раздел_Словаря::Составные_длинные
                | Text_Changer::Раздел_Словаря::Запятые
                | Text_Changer::Раздел_Словаря::Запятые_длинные => true,
                _ => false,
            };
        //составные слова,запятые не надо проверять - там замена идёт по полному совпадению. Проверяем только неизменные
        /*if условие_поиска_заглавных {
            continue;
        }*/
        //
        /*println!(
            "Прооверка на пересечение искомых слов внутри себя - Длина раздела |{}| слов  |{}|  ",
            указатели_раздела_словаря[указатель_уровня].имя_раздела,
            if условие_поиска_заглавных {
                указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
            } else {
                указатели_раздела_словаря[указатель_уровня].ячейки.len()
            },
        );*/
        /*println!(
            "{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}|",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan()
        );*/
        //
        let указатель_раздела_словаря = &указатели_раздела_словаря[указатель_уровня];
        let указатель_раздела_кучи = &указатели_раздела_словаря[указатель_уровня];

        //
        //
        let куча_сообщений: rapidhash::fast::RapidHashSet<String> =
            указатель_раздела_словаря
                .ячейки
                .iter()
                .filter(|ячейка| {
                    if условие_поиска_заглавных {
                        let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                        //если первый знак большой - вернуть отказ
                        !ряд_знаков[0].is_uppercase()
                    } else {
                        true
                    }
                })
                .flat_map(|ячейка| {
                    //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                    //счётчик заглавных букв, 1 раз можно его поменять - дальше выдаст ошибку, что повторное слово
                    let счётчик: AtomicBool = AtomicBool::new(false);
                    //если протсые слова в главном словаре не содержат слово переведённое - вывести
                    указатель_раздела_кучи
                        .куча
                        .iter()
                        .filter_map(|слово_в_куче| {
                            //есть ли совпадение
                            if sz_найти(слово_в_куче, ячейка.искомое_слово.получить_ссылку())
                            {
                                if слово_в_куче.as_str() != ячейка.искомое_слово.as_str()
                                {
                                    //проверка было ли совпадение ранее 1
                                    let уже_было_совпадение =
                                        счётчик.fetch_or(true, Ordering::Relaxed);
                                    //если это 1 случай
                                    if !уже_было_совпадение {
                                        счётчик.fetch_and(true, Ordering::Relaxed);
                                        None
                                    }
                                    //если это не первый случай
                                    else {
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| повторно содержит себя |{}|",
                                            указатели_раздела_словаря
                                                [указатель_уровня]
                                                .имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                    };
                                    //если заглавные буквы (составные) - то проверять количество слов в слове  - то тут заменят полностью всё слово
                                    // соответственно надо првоерять если только слов больше
                                    match условие_поиска_заглавных {
                                        //
                                        true=> {//если есть совпадение - указать
                                        let количество_слов_в_искомом_слове =
                                            ячейка.искомое_слово.split_whitespace().count();
                                        //
                                        let количество_слов_в_слове_из_кучи =
                                            слово_в_куче.split_whitespace().count();
                                        //если разное количество слов - то вывести
                                        if количество_слов_в_слове_из_кучи!=количество_слов_в_искомом_слове{
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                        }
                                            //если одинаковое количество сллов - ничего не делать
                                        else {None}},
                                        //если неизменные - то тут заменят частично всё что ухавтит
                                        false=> Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        )),
                                        //
                                    }

                                } else {
                                    None
                                }
                            } else {
                                None
                            }
                        })
                        .collect::<rapidhash::fast::RapidHashSet<String>>()
                })
                .collect::<rapidhash::fast::RapidHashSet<String>>();
        //
        //if куча_сообщений.len() > 0 {
        //
        println!(
            "{}{}{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела словаря ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}| ",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan(),
            style(format!("Длина раздела кучи ",)).true_color(0, 255, 0),
            style(format!(
                "|{}| ",
                указатели_раздела_словаря[указатель_уровня].куча.len(),
            ))
            .red(),
        );
        //
        куча_сообщений.iter().for_each(|сообщение| {
            println!("{}", сообщение);
        })
        //
        //}
    }
    //
    println!("{}",
             style(format!("⏰ |{}| Время занятое на соответствие проверку, что искомые слова не имеют схождений (итого): {:.2?}",
                                вид_словаря,
                                точка_отсчёта_по_времени_2.elapsed())).true_color(154, 136, 252)
    );
    //

    //

    Ok(())
}
pub fn найти_замену_для_выдера<'a>(
    образец_re: &'a Re_образцы,
    слово_замена: &'a String,
    искомое_слово: &String,
    образец_искомого_окончания: &str,
) -> Result<&'a Вид_Окончания_со_строкой, String> {
    let mut есть_ли_вход_1: bool = false;
    let mut есть_ли_вход_2: bool = false;
    //
    for образец_частной_замены in образец_re.исключения_первой_очереди.iter()
    {
        /*println!(
            "образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            есть_ли_вход_1 = true;
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => (), //return Err(ошибка),
            }
        }
    }
    //дальше во второй очереди берём
    for образец_частной_замены in образец_re.исключения_второй_очереди.iter()
    {
        /*println!(
            "образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            есть_ли_вход_2 = true;
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => (), //return Err(ошибка),
            }
        }
    }
    //
    for образец_частной_замены in образец_re.исключения_первой_очереди.iter()
    {
        /*println!(
            "|исключения_первой_очереди|образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|  искомое_слово |{искомое_слово}|",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            //
            /*println!(
                "слово |{}| re образец |{}|",
                слово_замена, образец_частной_замены.re_образец
            );*/
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => (), //return Err(ошибка),
            }
        }
    }
    //
    for образец_частной_замены in образец_re.исключения_второй_очереди.iter()
    {
        /*println!(
            "|исключения_второй_очереди| образец_частной_замены.re_образец |{}| слово_замена |{слово_замена}|  искомое_слово |{искомое_слово}| ",
            образец_частной_замены.re_образец.as_str()
        );*/
        //если есть совпадение
        if образец_частной_замены.re_образец.is_match(&слово_замена)
        {
            //
            /*println!(
                "слово |{}| re образец |{}|",
                слово_замена, образец_частной_замены.re_образец
            );*/
            //идёт в торжок обменивать окончание
            match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_выдера(
                &образец_частной_замены,
                &образец_re.содержимое,
            ) {
                Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
                Err(ошибка) => (), //return Err(ошибка),
            }
        }
    }
    let ошибка: String = format!(
        "{}{}{}{}{}{}{}{}{}{}{}{}{}{}",
        style(format!("Ошибка")).red().bold(),
        style(format!(" найти_замену_для_выдера")).blue(),
        style(format!(" - ")),
        style(format!("ничего не нашло для слова-замены ")).cyan(),
        style(format!("|{}| ", слово_замена)).red(),
        style(format!(",где [есть_ли вход] 1 -")),
        style(format!("|{}|", есть_ли_вход_1)).bold(),
        style(format!(" 2 -")),
        style(format!("|{}|", есть_ли_вход_2)).bold(),
        style(format!("|{}|", слово_замена)).red(),
        style(format!(" не-руское слово ")),
        style(format!("|{}|", искомое_слово)).green(),
        style(format!(" образец_искомого_окончания ")),
        style(format!("|{}|", образец_искомого_окончания)).yellow(),
    );
    //
    //println!("{}", ошибка);*/
    //
    return Err(ошибка);
}
pub fn найти_добавочное_окончание<'a>(
    образец: &'a str,
    выдер: &'a Вид_Окончания_со_строкой,
    искомое_слово: &String,
) -> Result<&'a Вид_Окончания_со_строкой, String> {
    //

    //идёт в торжок обменивать окончание
    match ТОРЖОК_ОКОНЧАНИЙ.найти_окончание_к_слову_замене(образец, &выдер)
    {
        Ok(окончание_для_выреза) => return Ok(окончание_для_выреза),
        Err(ошибка) => {
            return Err(format!(
                "{}{}{}",
                style(format!("Ошибка")).red().bold(),
                style(format!(" найти_добавочное_окончание ")),
                style(format!(" {ошибка} "))
            ));
        }
    }

    //
    //return Err(format!("ничего не нашло"));
}

pub fn определение_недопустимых_окончаний(
    основной_словарь: &Text_Changer::Словари_с_кучами,
    вид_словаря: &Text_Changer::Вид_Словаря,
    данные_при_загрузке: &Данные_при_загрузке,
) -> Vec<String> {
    use crate::utils::stringzilla::sz_упорядочить_кучу_строк_rapid_в_ряд_строк;
    struct Ложные_окончания_с_исключениями {
        pub ряд_re: &'static [Regex],
        pub ряд_исключений: &'static rapidhash::fast::RapidHashSet<&'static str>,
    }
    static СТОПКА_ЛОЖНЫХ_ОКОНЧАНИЙ: LazyLock<
        [Ложные_окончания_с_исключениями; 4],
    > = LazyLock::new(|| {
        [
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ВАН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ВАН,
            },
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЕН,
            },
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ОН,
            },
            Ложные_окончания_с_исключениями {
                ряд_re: &*RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЁН,
                ряд_исключений: &RE_ИСКЛЮЧЕНИЯ_ЁН,
            },
        ]
    });
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ВАН: LazyLock<[Regex; 31]> = LazyLock::new(|| {
        [
            //----------------------------------
            //ван
            //а
            Regex::new(r"(?i)ваная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)ванн$").unwrap(),
            Regex::new(r"(?i)ванние$").unwrap(),
            Regex::new(r"(?i)ваннием$").unwrap(),
            Regex::new(r"(?i)ванния$").unwrap(),
            Regex::new(r"(?i)ваннию$").unwrap(),
            Regex::new(r"(?i)ваннии$").unwrap(),
            Regex::new(r"(?i)ванний$").unwrap(),
            Regex::new(r"(?i)ванниям$").unwrap(),
            Regex::new(r"(?i)ванниями$").unwrap(),
            Regex::new(r"(?i)ванниях$").unwrap(),
            //
            Regex::new(r"(?i)ванна$").unwrap(),
            Regex::new(r"(?i)ванно$").unwrap(),
            Regex::new(r"(?i)ванны$").unwrap(),
            //ую
            Regex::new(r"(?i)ваную$").unwrap(),
            //о
            Regex::new(r"(?i)ваное$").unwrap(),
            Regex::new(r"(?i)ваного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)ваном$").unwrap(),
            Regex::new(r"(?i)ваному$").unwrap(),
            Regex::new(r"(?i)ваность$").unwrap(),
            Regex::new(r"(?i)ваностю$").unwrap(),
            Regex::new(r"(?i)ваности$").unwrap(),
            Regex::new(r"(?i)ваностей$").unwrap(),
            Regex::new(r"(?i)ваностям$").unwrap(),
            Regex::new(r"(?i)ваностями$").unwrap(),
            Regex::new(r"(?i)ваностях$").unwrap(),
            //ыа
            Regex::new(r"(?i)ваным$").unwrap(),
            Regex::new(r"(?i)ваными$").unwrap(),
            Regex::new(r"(?i)ваных$").unwrap(),
            Regex::new(r"(?i)ваные$").unwrap(),
            Regex::new(r"(?i)ваный$").unwrap(),
        ]
        //----------------------------------
    });
    static RE_ИСКЛЮЧЕНИЯ_ВАН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter(["диваном"]));
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЕН: LazyLock<[Regex; 18]> = LazyLock::new(|| {
        [
            //ен
            //а
            Regex::new(r"(?i)еная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)енн$").unwrap(),
            //Regex::new(r"(?i)енна$").unwrap(),
            //Regex::new(r"(?i)енно$").unwrap(),
            //Regex::new(r"(?i)енны$").unwrap(),
            //ую
            Regex::new(r"(?i)еную$").unwrap(),
            //о
            Regex::new(r"(?i)еное$").unwrap(),
            Regex::new(r"(?i)еного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)еном$").unwrap(),
            Regex::new(r"(?i)еному$").unwrap(),
            Regex::new(r"(?i)еность$").unwrap(),
            Regex::new(r"(?i)еностью$").unwrap(),
            Regex::new(r"(?i)ености$").unwrap(),
            Regex::new(r"(?i)еностей$").unwrap(),
            Regex::new(r"(?i)еностям$").unwrap(),
            Regex::new(r"(?i)еностями$").unwrap(),
            Regex::new(r"(?i)еностях$").unwrap(),
            //ы
            Regex::new(r"(?i)еным$").unwrap(),
            Regex::new(r"(?i)еными$").unwrap(),
            Regex::new(r"(?i)еных$").unwrap(),
            Regex::new(r"(?i)еные$").unwrap(),
            //----------------------------------
        ]
    });
    static RE_ИСКЛЮЧЕНИЯ_ЕН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| {
            rapidhash::fast::RapidHashSet::from_iter([
                "рекордсмен",
                "манекен",
                "орден",
                "концераген",
                "геном",
                "бизнесмен",
                "бармен",
                "антенн",
                "суперменом",
                "феноменом",
                "шатеном",
                "экзаменом",
                "доменом",
                "джентльменом",
                "голоценом",
                "авиазвеном",
                "промоушеном",
            ])
        });

    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ЁН: LazyLock<[Regex; 18]> = LazyLock::new(|| {
        [
            //ён
            //а
            Regex::new(r"(?i)ёная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)ённ$").unwrap(),
            //Regex::new(r"(?i)ённа$").unwrap(),
            //Regex::new(r"(?i)ённо$").unwrap(),
            //Regex::new(r"(?i)ённы$").unwrap(),
            //ую
            Regex::new(r"(?i)ёную$").unwrap(),
            //о
            Regex::new(r"(?i)ёное$").unwrap(),
            Regex::new(r"(?i)ёного$").unwrap(),
            //глаголы
            Regex::new(r"(?i)ёном$").unwrap(),
            Regex::new(r"(?i)ёному$").unwrap(),
            Regex::new(r"(?i)ёность$").unwrap(),
            Regex::new(r"(?i)ёностью$").unwrap(),
            Regex::new(r"(?i)ёности$").unwrap(),
            Regex::new(r"(?i)ёностей$").unwrap(),
            Regex::new(r"(?i)ёностям$").unwrap(),
            Regex::new(r"(?i)ёностями$").unwrap(),
            Regex::new(r"(?i)ёностях$").unwrap(),
            //ы
            Regex::new(r"(?i)ёным$").unwrap(),
            Regex::new(r"(?i)ёными$").unwrap(),
            Regex::new(r"(?i)ёных$").unwrap(),
            Regex::new(r"(?i)ёные$").unwrap(),
            //----------------------------------
            //----------------------------------
        ]
    });
    //
    static RE_ИСКЛЮЧЕНИЯ_ЁН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter([]));
    //
    static RE_ЛОЖНЫЕ_ОКОНЧАНИЯ_ОН: LazyLock<[Regex; 17]> = LazyLock::new(|| {
        [
            //он
            Regex::new(r"(?i)оная$").unwrap(),
            //одиночн
            Regex::new(r"(?i)онн$").unwrap(),
            //Regex::new(r"(?i)онна$").unwrap(),
            // Regex::new(r"(?i)онно$").unwrap(),
            //Regex::new(r"(?i)онны$").unwrap(),
            //ую
            Regex::new(r"(?i)оную$").unwrap(),
            //о
            Regex::new(r"(?i)оное$").unwrap(),
            Regex::new(r"(?i)оного$").unwrap(),
            //глаголы
            //Regex::new(r"(?i)оном$").unwrap(),
            Regex::new(r"(?i)оному$").unwrap(),
            Regex::new(r"(?i)оность$").unwrap(),
            Regex::new(r"(?i)оностью$").unwrap(),
            Regex::new(r"(?i)оности$").unwrap(),
            Regex::new(r"(?i)оностей$").unwrap(),
            Regex::new(r"(?i)оностям$").unwrap(),
            Regex::new(r"(?i)оностями$").unwrap(),
            Regex::new(r"(?i)оностях$").unwrap(),
            //ы
            Regex::new(r"(?i)оным$").unwrap(),
            Regex::new(r"(?i)оными$").unwrap(),
            Regex::new(r"(?i)оных$").unwrap(),
            Regex::new(r"(?i)оные$").unwrap(),
        ]
    });
    static RE_ИСКЛЮЧЕНИЯ_ОН: LazyLock<rapidhash::fast::RapidHashSet<&'static str>> =
        LazyLock::new(|| rapidhash::fast::RapidHashSet::from_iter(["скомпоную", "астроному"]));
    //
    let время_отсчёта_недопустимых_окончаний: Instant = Instant::now();
    //
    println!(
        "{}",
        style(format!("\t Проверка недопустимых окончаний")).yellow(),
    );
    //
    let mut куча_недопустимых_окончаний_общий: rapidhash::fast::RapidHashSet<String> =
        rapidhash::fast::RapidHashSet::default();
    //
    for раздел in СТОПКА_ЛОЖНЫХ_ОКОНЧАНИЙ.iter() {
        //
        for образец in раздел.ряд_re.iter() {
            //
            let куча_1: rapidhash::fast::RapidHashSet<String> =
                основной_словарь.кучи_полные.искомые[0]
                    .простое
                    .iter()
                    .filter_map(|слово_в_куче| {
                        //
                        for исключающее_слово in раздел.ряд_исключений.iter()
                        {
                            if sz_найти(&слово_в_куче.0, исключающее_слово)
                                && !исключающее_слово.is_empty()
                            {
                                return None;
                            }
                        }
                        //
                        if образец.is_match(слово_в_куче.0.as_str()) {
                            Some(слово_в_куче.0.clone())
                        } else {
                            None
                        }
                    })
                    .collect::<rapidhash::fast::RapidHashSet<String>>();
            //
            /*let ряд_недопустимых_окончаний: Vec<String> =
            sz_упорядочить_кучу_строк_rapid_в_ряд_строк(куча_1);*/
            //
            куча_недопустимых_окончаний_общий.extend(куча_1);
            //
        }
        //
    }
    let ряд_недопустимых_окончаний_общий =
        sz_упорядочить_кучу_строк_rapid_в_ряд_строк(
            куча_недопустимых_окончаний_общий,
        );
    //
    println!(
            "{}",
            style(format!(
                "⌚  Время занятое всего выполнения поиск недопустимых окончаний (от начала до конца): {:.2?}",
                время_отсчёта_недопустимых_окончаний.elapsed()
            ))
            .true_color(198, 100, 72)
        );
    return ряд_недопустимых_окончаний_общий;
}
pub fn есть_ли_пробелы_в_слове(слово: &String) -> bool {
    //let количество = слово.matches([' ', ' ']).count();
    // хорошо (увидит все виды пробелов):
    let количество = слово.chars().filter(|знак| знак.is_whitespace()).count();
    // let количество_черт_в_слове: usize = слово.matches(['-', '—', '–']).count();
    if количество > 0 {
        true
    } else {
        false
    }
}
