use std::sync::atomic::{AtomicBool, Ordering};
use std::time::Instant;

//use clap::builder::Str;
//use convert_case::{Case, Casing};
//use rapidhash::*;
use crate::utils::stringzilla::sz_найти;
use console::style;
use rayon::prelude::*;
pub fn сравнить_основной_и_запасной_словари(
    основной_словарь: &Text_Changer::Полный_Словарь,
    запасной_словарь: &Text_Changer::Полный_Словарь,
) -> Result<(), ()> {
    println!(
        "Длина простых слов (всего): Основной - |{}| Запасной - |{}| поделажщих переводу |{}|",
        основной_словарь.простое.len() / 3,
        запасной_словарь.простое.len(),
        основной_словарь.перевести.len(),
    );
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    let куча_переведенных_слов_в_запасном_словаре: rapidhash::fast::RapidHashSet<&str> =
        запасной_словарь
            .простое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи слов, подлежащих переводу - |{}|",
        куча_переведенных_слов_в_запасном_словаре.len()
    );
    //
    let куча_простых_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .простое
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_слов: rapidhash::fast::RapidHashSet<&str> = основной_словарь
        .составное
        .par_iter()
        .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
        .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    //
    let куча_составных_сложных_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .составное_важное
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    let куча_неизменных_коротких_слов: rapidhash::fast::RapidHashSet<&str> =
        основной_словарь
            .неизменное_короткое
            .par_iter()
            .filter_map(|ячейка| Some(ячейка.искомое_слово.as_str()))
            .collect::<rapidhash::fast::RapidHashSet<&str>>();
    //
    println!(
        "Длина кучи простых слов - |{}|",
        куча_простых_слов.len() / 3
    );
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_словарь_запасной: rapidhash::fast::RapidHashSet<usize> =
        запасной_словарь
            .простое
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_простых_слов.contains(ячейка.искомое_слово.as_str())
                {
                    //если в составных словах тоже отсутствует
                    if !куча_составных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_составных_сложных_слов.contains(ячейка.искомое_слово.as_str())
                        & !куча_неизменных_коротких_слов.contains(ячейка.искомое_слово.as_str())
                    {
                        Some(указатель)
                    } else {
                        None
                    }
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //проверка что переведенное слово из переведенные слова .xls нет в главном словаре
    let куча_указателей_на_страницу_не_переведённых_слов_главного_словаря: rapidhash::fast::RapidHashSet<usize> =
        основной_словарь
            .перевести
            .par_iter()
            .enumerate() //.filter(|(указатель,ячейка)|!ячейка.искомое_слово.is_empty())
            .filter_map(|(указатель, ячейка)| {
                //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                //если первый знак большой - вернуть отказ
                if ряд_знаков[0].is_uppercase() {
                    return None;
                }
                //если протсые слова в главном словаре не содержат слово переведённое - вывести
                if !куча_переведенных_слов_в_запасном_словаре.contains(ячейка.искомое_слово.as_str())
                {
                    Some(указатель)
                } else {
                    None
                }
            })
            .collect::<rapidhash::fast::RapidHashSet<usize>>();
    //
    println!(
        "Количество слов запасного словаря, которые отсутствуют в основном - |{}|",
        куча_указателей_на_словарь_запасной.len(),
    );
    println!(
        "куча_указателей_на_страницу_не_переведённых_слов_главного_словаря - |{}|",
        куча_указателей_на_страницу_не_переведённых_слов_главного_словаря.len(),
    );
    //
    crate::output::write::вывод_запасного_словаря_почищенного(
        &запасной_словарь,
        &куча_указателей_на_словарь_запасной,
        //
        &куча_указателей_на_страницу_не_переведённых_слов_главного_словаря,
        &основной_словарь,
        //
    )
    .unwrap();

    Ok(())
}
#[allow(non_camel_case_types)]
pub fn проверка_что_нет_пересечений_искомых_слов(
    основной_словарь: &Text_Changer::Полный_Словарь,
    куча_словарь_искомые: &[Text_Changer::Куча_Словарь_Искомые;
         Text_Changer::КОЛИЧЕСТВО_УРОВНЕЙ_СЛОВАРЯ_КУЧ],
    вид_словаря: &Text_Changer::Вид_Словаря,
) -> Result<(), ()> {
    use Text_Changer::Ячейка_словаря;
    let точка_отсчёта_по_времени_2: Instant = Instant::now();
    //
    const КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ: usize = 8;
    pub struct Подробный_Раздел_Кучи<'a> {
        pub куча: &'a rapidhash::fast::RapidHashSet<String>,
        pub _имя_раздела: Text_Changer::Раздел_Словаря,
    }
    pub struct Подробный_Раздел_Словаря<'a> {
        pub ячейки: &'a Vec<Ячейка_словаря>,
        pub имя_раздела: Text_Changer::Раздел_Словаря,
    }
    //куча слов со страницы перевести - главного словаря, которые должны быть переведены, но не переведены до сих пор или пропущены
    let указатели_раздела_кучи: [Подробный_Раздел_Кучи;
        КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ] = [
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].составное,
            _имя_раздела: Text_Changer::Раздел_Словаря::Составные,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].составное_важное,
            _имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_важные,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].составное_длинное,
            _имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_длинные,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].запятые,
            _имя_раздела: Text_Changer::Раздел_Словаря::Запятые,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].запятые_длинные,
            _имя_раздела:
                Text_Changer::Раздел_Словаря::Запятые_длинные,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].неизменное,
            _имя_раздела: Text_Changer::Раздел_Словаря::Неизменные,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].неизменное_короткое,
            _имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
        Подробный_Раздел_Кучи {
            куча: &куча_словарь_искомые[0].неизменное_длинное,
            _имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_длинные,
        },
    ];
    //
    let указатели_раздела_словаря: [Подробный_Раздел_Словаря;
        КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ] = [
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное,
            имя_раздела: Text_Changer::Раздел_Словаря::Составные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_важное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_важные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.составное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Составные_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые,
            имя_раздела: Text_Changer::Раздел_Словаря::Запятые,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.запятые_длинные,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Запятые_длинные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное,
            имя_раздела: Text_Changer::Раздел_Словаря::Неизменные,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_короткое,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
        Подробный_Раздел_Словаря {
            ячейки: &основной_словарь.неизменное_длинное,
            имя_раздела:
                Text_Changer::Раздел_Словаря::Неизменные_короткие,
        },
    ];
    //сама проверка
    for указатель_уровня in 0..КОЛИЧЕСТВО_РАЗДЕЛОВ_СЛОВАРЯ {
        let условие_поиска_заглавных: bool =
            match указатели_раздела_словаря[указатель_уровня].имя_раздела
            {
                Text_Changer::Раздел_Словаря::Составные
                | Text_Changer::Раздел_Словаря::Составные_важные
                | Text_Changer::Раздел_Словаря::Составные_длинные
                | Text_Changer::Раздел_Словаря::Запятые
                | Text_Changer::Раздел_Словаря::Запятые_длинные => true,
                _ => false,
            };
        //составные слова,запятые не надо проверять - там замена идёт по полному совпадению. Проверяем только неизменные
        /*if условие_поиска_заглавных {
            continue;
        }*/
        //
        /*println!(
            "Прооверка на пересечение искомых слов внутри себя - Длина раздела |{}| слов  |{}|  ",
            указатели_раздела_словаря[указатель_уровня].имя_раздела,
            if условие_поиска_заглавных {
                указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
            } else {
                указатели_раздела_словаря[указатель_уровня].ячейки.len()
            },
        );*/
        /*println!(
            "{}{}{}",
            style(format!(
                "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела ",
            ))
            .true_color(0, 255, 0),
            //
            style(format!(
                "|{}| слов  ",
                указатели_раздела_словаря[указатель_уровня].имя_раздела,
            ))
            .red(),
            style(format!(
                "|{}|",
                if условие_поиска_заглавных {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                } else {
                    указатели_раздела_словаря[указатель_уровня].ячейки.len()
                }
            ))
            .cyan()
        );*/
        //
        let указатель_раздела_словаря = &указатели_раздела_словаря[указатель_уровня];
        let указатель_раздела_кучи = &указатели_раздела_кучи[указатель_уровня];

        //
        //
        let куча_сообщений: rapidhash::fast::RapidHashSet<String> =
            указатель_раздела_словаря
                .ячейки
                .iter()
                .filter(|ячейка| {
                    if условие_поиска_заглавных {
                        let ряд_знаков: Vec<char> = ячейка.искомое_слово.chars().collect();
                        //если первый знак большой - вернуть отказ
                        !ряд_знаков[0].is_uppercase()
                    } else {
                        true
                    }
                })
                .flat_map(|ячейка| {
                    //если нет искомого слова из запасного словаря - то добавить его указатель в кучу
                    //счётчик заглавных букв, 1 раз можно его поменять - дальше выдаст ошибку, что повторное слово
                    let счётчик: AtomicBool = AtomicBool::new(false);
                    //если протсые слова в главном словаре не содержат слово переведённое - вывести
                    указатель_раздела_кучи
                        .куча
                        .iter()
                        .filter_map(|слово_в_куче| {
                            //есть ли совпадение
                            if sz_найти(слово_в_куче, ячейка.искомое_слово.получить_ссылку())
                            {
                                if слово_в_куче.as_str() != ячейка.искомое_слово.as_str()
                                {
                                    //проверка было ли совпадение ранее 1
                                    let уже_было_совпадение =
                                        счётчик.fetch_or(true, Ordering::Relaxed);
                                    //если это 1 случай
                                    if !уже_было_совпадение {
                                        счётчик.fetch_and(true, Ordering::Relaxed);
                                        None
                                    }
                                    //если это не первый случай
                                    else {
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| повторно содержит себя |{}|",
                                            указатели_раздела_словаря
                                                [указатель_уровня]
                                                .имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                    };
                                    //если заглавные буквы (составные) - то проверять количество слов в слове  - то тут заменят полностью всё слово
                                    // соответственно надо првоерять если только слов больше
                                    match условие_поиска_заглавных {
                                        //
                                        true=> {//если есть совпадение - указать
                                        let количество_слов_в_искомом_слове =
                                            ячейка.искомое_слово.split_whitespace().count();
                                        //
                                        let количество_слов_в_слове_из_кучи =
                                            слово_в_куче.split_whitespace().count();
                                        //если разное количество слов - то вывести
                                        if количество_слов_в_слове_из_кучи!=количество_слов_в_искомом_слове{
                                        Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        ))
                                        }
                                            //если одинаковое количество сллов - ничего не делать
                                        else {None}},
                                        //если неизменные - то тут заменят частично всё что ухавтит
                                        false=> Some(format!(
                                            " Раздел |{}| Слово |{}| пересекается со словом |{}|",
                                            указатели_раздела_словаря[указатель_уровня].имя_раздела,
                                            ячейка.искомое_слово,
                                            слово_в_куче,
                                        )),
                                        //
                                    }

                                } else {
                                    None
                                }
                            } else {
                                None
                            }
                        })
                        .collect::<rapidhash::fast::RapidHashSet<String>>()
                })
                .collect::<rapidhash::fast::RapidHashSet<String>>();
        //
        if куча_сообщений.len() > 0 {
            //
            println!(
                "{}{}{}",
                style(format!(
                    "⭐ Прооверка на пересечение искомых слов внутри себя - Длина раздела ",
                ))
                .true_color(0, 255, 0),
                //
                style(format!(
                    "|{}| слов  ",
                    указатели_раздела_словаря[указатель_уровня].имя_раздела,
                ))
                .red(),
                style(format!(
                    "|{}|",
                    if условие_поиска_заглавных {
                        указатели_раздела_словаря[указатель_уровня].ячейки.len() / 2
                    } else {
                        указатели_раздела_словаря[указатель_уровня].ячейки.len()
                    }
                ))
                .cyan()
            );
            //
            куча_сообщений.iter().for_each(|сообщение| {
                println!("{}", сообщение);
            })
            //
        }
    }
    //
    println!("{}",
             style(format!("⏰ |{}| Время занятое на соответствие проверку, что искомые слова не имеют схождений (итого): {:.2?}",
                                вид_словаря,
                                точка_отсчёта_по_времени_2.elapsed())).true_color(154, 136, 252)
    );
    //
    Ok(())
}
